<HTML>
<HEAD>
<TITLE>Datenaustausch zwischen Macromedia Flash und ASP</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="7 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Wenn man Flash in komplexe Aufgabenstellungen integriert, so mu&szlig; 
Flash als programmierbares Frontend mit serverseitigen Programmen 
wie ASP-Seiten zusammenarbeiten.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Flash,Macromedia,Macromedia Flash,Flash Generator,Turbine,ASP,Active Server Pages,Querystring">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff"  BACKGROUND="../images/layout/aspheutemainbg.gif" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<MAP NAME="titlebar">
<!--<AREA SHAPE=RECT COORDS="116,46,191,61" HREF="http://www.aspaktuell.com" ALT="ASP Aktuell">-->
<!--<AREA SHAPE=RECT COORDS="192,46,255,61" HREF="http://www.aspwelt.com" ALT="ASP Welt">-->
<AREA SHAPE=RECT COORDS="256,46,432,61" HREF="http://www.aspgerman.com/aspgerman/" ALT="ASP German">
<AREA SHAPE=RECT COORDS="115,15,269,42" HREF="../default.htm" ALT="Homepage">
<AREA SHAPE=RECT COORDS="278,26,587,42" HREF="../default.htm" ALT="Homepage">
</MAP>

<div style="position:absolute;left:0px;top:30px">
<table border=0 cellspacing=0 cellpadding=0>
<tr>
<td background="../images/layout/aspheutetitle.gif">
<img src="../images/layout/blind.gif" width="715" height="73" usemap="#titlebar" border="0">
</td>
<td width="100%" background="../images/layout/aspheutetitleext.gif">
&nbsp;
</td>
<td background="../images/layout/aspheutetitleend.gif">
<img src="../images/layout/blind.gif" width="25" height="1">
</td>
</tr>
</table>
</div>

<div style="position:absolute;left:1px;top:115px">
<table width="110" border="0" cellspacing="0" cellpadding="0">
<tr><td width="110"><img src="../Images/spacer.gif" width="110" height="1" alt="" border="0"></td></tr>
<tr>
<td background="../images/layout/aspheuteheader.gif" class="header" height=16 width="110">
<p>Liste</p>
</td>
</tr>
<tr>
<td background="../images/layout/aspheuteheaderext.gif" class="header" width="110">

<p class="content">
<a href="../kategorien/dotNET%202dot0.htm">.NET 2.0 (1)</a><br>
<a href="../kategorien/dotNET%20Allgemein.htm">.NET Allgemein (16)</a><br>
<a href="../kategorien/dotNET%20Fu.htm">.NET Fu (5)</a><br>
<a href="../kategorien/ADOdotNET.htm">ADO.NET (11)</a><br>
<a href="../kategorien/Aprilscherz.htm">Aprilscherz (3)</a><br>
<a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen (44)</a><br>
<a href="../kategorien/ASP%20Tricks.htm">ASP Tricks (83)</a><br>
<a href="../kategorien/ASPdotNET.htm">ASP.NET (44)</a><br>
<a href="../kategorien/ASPIntranetdotde.htm">ASPIntranet.de (5)</a><br>
<a href="../kategorien/Csharp.htm">C# (28)</a><br>
<a href="../kategorien/Datenbank.htm">Datenbank (44)</a><br>
<a href="../kategorien/Dokumentation.htm">Dokumentation (4)</a><br>
<a href="../kategorien/IIS%206dot0.htm">IIS 6.0 (1)</a><br>
<a href="../kategorien/Komponenten.htm">Komponenten (29)</a><br>
<a href="../kategorien/Optimierung.htm">Optimierung (10)</a><br>
<a href="../kategorien/Server.htm">Server (21)</a><br>
<a href="../kategorien/Sicherheit.htm">Sicherheit (34)</a><br>
<a href="../kategorien/Tee%20Off.htm">Tee Off (6)</a><br>
<a href="../kategorien/VBdotNET.htm">VB.NET (6)</a><br>
<a href="../kategorien/WAP.htm">WAP (8)</a><br>
<a href="../kategorien/Web%20Services.htm">Web Services (11)</a><br>
<a href="../kategorien/XML.htm">XML (9)</a><br>


<br>
<a href="/syndication/rss.xml"><img src="../Images/rss_small.png" width="25" height="10" alt="RSS 2.0 - Die neuesten f&uuml;nf Artikel auf AspHeute.com" border="0"></a>

</p><!-- </p> remains -->


<br>

</td>
</tr>
<tr>
<td class="empty" width="110">
&nbsp;
</td>
</tr>
<tr>
<td background="../images/layout/aspheutesearch.gif" class="header" height=16 width="110">
<p>Suchen</p>
</td>
</tr>
<tr>
<td background="../images/layout/aspheutesearchext.gif" class="header" width="110">
<form class="content" ACTION="REMOVED" METHOD="GET">
<div>
<input class="Newsletter" type="text" size="10" name="CiRestriction">
<span class="spacer2"><br></span>
<span class="spacer4"><br></span>
<INPUT TYPE="HIDDEN" NAME="CiMaxRecordsPerPage" VALUE="10">
<INPUT TYPE="HIDDEN" NAME="CiSort" VALUE="rank[d]">
<INPUT TYPE="HIDDEN" NAME="HTMLQueryForm" VALUE="../default.htm">
<img src="../images/layout/blind.gif" width="41" height="1"><input type="image" src="../images/layout/aspheutesearchenter.gif" border="0" width="49" height="14"><br>
<span class="spacer4"><br></span>
</div>
</form>
</td>
</tr>
<tr>
<td class="empty" width="110">
&nbsp;
</td>
</tr>
<tr>
<td background="../images/layout/aspheuteheaderext.gif" class="header" width="110">
<p class="content">
<a href="/REMOVED/" title="Our most popular articles translated into English">English Articles</a><br>
<a href="/REMOVED/" title="Visit our Chinese content section">Chinese Articles</a><br>
<a href="../autoren/UnsereAutoren.htm" title="Unsere Autoren">Unsere Autoren</a><br>
&nbsp;<br>
<a href="/REMOVED/link2us.asp" title="Setzen Sie einen Link zu AspHeute!">Link zu AspHeute</a><br>
<a href="/REMOVED/impressum.asp" title="Das Impressum von AspHeute">Impressum</a><br>
<a href="/REMOVED/advertise.asp" title="Werben auch Sie auf AspHeute">Werben</a><br>
<a href="/REMOVED/kontakt.asp" title="Teilen Sie uns Ihre W&uuml;nsche, Beschwerden und Anregungen mit">Anfragen</a><br>
</p>
</td>
</tr>
</table>
</div>



<!-- Content starts here  -->
<div style="position:absolute;left:120px;top:108px">
<table cellspacing="0" cellpadding="0"><!--Tabelle aussen-->
<tr><!--Tabelle aussen, 1/2-->
<td><!--Tabelle aussen, 1/1-->
    <table border=0 align=center><tr><td align=center>


</td></tr></table>

<H1>Datenaustausch zwischen Macromedia Flash und ASP</H1>
<p>
Geschrieben von: <a href="../autoren/guenterhoffellner.htm">Günter Hoffellner</a><br>
Kategorie: <a href="../kategorien/ASP%20Tricks.htm">ASP Tricks</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000719"></SCRIPT>
</p>
<p>Dies ist ein Forum f&uuml;r ASP Entwickler. Warum also ein Artikel zum Thema Macromedia Flash? 
Die Zeit, da Flash nur als reines Animationstool f&uuml;r Introsequenzen von Websites benutzt wurde 
ist seit dem Erscheinen von Flash 4.0 vorbei.</p>

<p>Wenn man Flash in komplexe Aufgabenstellungen integriert, so mu&szlig; 
Flash als programmierbares Frontend mit serverseitigen Programmen 
wie ASP-Seiten zusammenarbeiten. Dies bedeutet in erster Linie,
da&szlig; man Daten zwischen Flash und ASP austauscht, und zwar sowohl von 
Flash zu ASP, als auch von ASP zu Flash.</p> 

<p>Dieser Artikel soll der Auftakt f&uuml;r eine Reihe sein, die zum einen ein 
Verst&auml;ndnis f&uuml;r das Interface zwischen der Flash- und der ASP-Programmierung 
schaffen soll, und gleichzeitig Einsatzm&ouml;glichkeiten dieser 
beiden Technologien in ihrer Verbindung aufzeigt. </p>

<p>F&uuml;r diesen Artikel werden vom Flashdesigner vollst&auml;ndige Kenntnisse &uuml;ber 
statisches Flash und grundlegende Kenntnisse &uuml;ber Flash - Lingoprogrammierung 
vorausgesetzt.</p>

<p>Voraussetzungen f&uuml;r den ASP Programmierer zum vollst&auml;ndigen Verst&auml;ndnis der
in diesem Artikel vorgestellten Techniken sind Kenntnisse im Auslesen von 
Querystrings (mittels der <i>Request.QueryString</i> Collection &auml;hnlich dem Auslesen von
mittels GET gesendeten Formulardaten) und im Erstellen von URL-Encoded Strings.</p>


<h2>1. Einf&uuml;hrung</h2>

<p>In den folgendenden Abs&auml;tzen wird ein einfaches Beispiel gezeigt, in dem Daten 
von Flash an ASP &uuml;bergeben werden, dort Berechnungen mit den &uuml;bergebenen Daten stattfinden,
und die Ergebnisse schlie&szlig;lich zur Darstellung an Flash &uuml;bermittelt werden.</p> 

<p>In vielen ASP Applikationen werden Querystrings f&uuml;r verschiedene Zwecke eingesetzt. 
Im nachfolgenden Beispiel wird nun ein Querystring benutzt, um Daten von Flash
an ASP zu &uuml;bermitteln. Der Querystring ist dabei Teil der URL.</p>

<p>Die folgende URL enth&auml;lt den Querystring <i>sum=20&amp;status=Alles+in+Ordnung%21</i>, 
der an die ASP-Seite namens <i>getit.asp</i> &uuml;bergeben wird.</p>

<pre style="background='silver';">
http://www.someserver.com/getit.asp?sum=20&amp;status=Alles+in+Ordnung%21
</pre>

<p>Der Querystring enth&auml;lt die URL-Encoded Strings <b>sum=20</b> und 
<b>status=Alles in Ordnung!</b>. Diese repr&auml;sentieren f&uuml;r die ASP-Seite 
Paare von Namen und Werten, die f&uuml;r Berechnungen oder als Parameter f&uuml;r
Datenbankabfragen benutzt werden k&ouml;nnen.</p>

<p>Die meisten Flash Entwickler hatten bisher nichts mit Querystrings zu tun.
Es wird jedoch gezeigt werden, wie ein einfaches Userinterface in Flash 
erstellt werden kann, das von Flash aus Werte in einen Querystring verpackt,
um damit gezielt Daten an den Server zu schicken.</p>

<p>Weiters sehen Sie, wie die Ergebnisse von Server auf dem einfachsten Weg 
wieder in das Flash Userinterface transferiert werden und dort 
ausgegeben werden k&ouml;nnen.</p>


<h2>2. Aufgabenstellung f&uuml;r das Beispiel</h2>	

<p>Im Userinterface sollen zwei beliebige Zahlen vom Benutzer eingegeben werden. Innerhalb von 
Flash wird gepr&uuml;ft, ob der Benutzer Werte in das Fomular eingegeben hat, 
bevor die Werte zur ASP-Seite am Webserver geschickt werden.</p>

<p>Zum &Uuml;bermitteln der eingegebenen Werte wird ein Querystring zusammengebaut und 
der Inhalt der beiden Variablen an den Server geschickt (an eine 
ASP Seite des Webservers). Genauer gesagt: Es wird die ASP Seite aufgerufen und
die Daten als Teil des URLs im Querystring &uuml;bergeben.</p>

<p>Das Aufrufen einer URL und das Laden des Inhalts der betreffenden Seite geschieht in
Flash mittels dem Befehl <i>Load Variables (URL, 0)</i>.</p>

<p>Flash wartet daraufhin auf die Antwort des Servers. Damit Flash Variablen Werte
von der ASP-Seite lesen kann, mu&szlig; diese wieder Paare von Namen und Werten
als Querystring bereitstellen, der einfach wie eine HTML Seite an das Flash
Programm &uuml;bermittelt wird. Flash setzt daraufhin Variablenwerte im aufrufenden Frame
entprechend den Werten die von der ASP-Seite geschickt wurden.</p>

<p>Die ASP Seite in unserem Beispiel errechnet Ergebnisse der vier mathematischen 
Grundoperationen zwischen den beiden im Flash Formular eingebenen Zahlen aus.
Weiters wird eine Statusmeldung zu Flash geschickt, die Auskunft dar&uuml;ber gibt, 
ob alle Operationen erfolgreich durchgef&uuml;hrt wurden oder ob eine Division 
durch Null dies verhindert hat.</p>


<h2>3. Die Flash Grundstruktur des Beispiels</h2>

<p>Hier wird der grundlegende Aufbau des herunterladbaren 
Flash Files erkl&auml;rt. Erfahrene Flash User m&ouml;gen Punkt 3.1 getrost &uuml;berspringen.</p>

<p>Das Flash Formular sehen Sie im folgenden Bild:</p>

<IMG SRC="Bilder/200007/20000719_userinterface.png" width="550" height="400" alt="" border="0">


<h3>3.1 Beschreibung der Layerstruktur</h3>

<p>Die Layerstruktur ist der besseren Anschaulichkeit halber stark aufgesplittet 
(siehe nachfolgendes Bild).
Es w&auml;re ohne weiteres m&ouml;glich diese auf nur zwei Layer zu reduzieren. </p>

<IMG SRC="Bilder/200007/20000719_layers.png" width="450" height="240" alt="" border="0">

<ol>
	<li><b>Design</b>: Enth&auml;lt die rein grafischen Teile, die Namen der Texteingabefelder 
sowie die Erkl&auml;rungen f&uuml;r den User.</li>

	<li><b>Zahl 1, Zahl2</b>: Enthalten die beiden Texteingabefelder f&uuml;r die beiden  
(der Berechnungen auf der ASP-Seite zugrundeliegenden) Zahlen <i>Zahl1</i> und <i>Zahl2</i>.</li>

	<li><b>Ergebnisse</b>: Enth&auml;lt die vier Text-Ein/Ausgabefelder f&uuml;r die Ergebnisse auf 
der rechten Seite des Formulars.</li>

	<li><b>Statusmeldung</b>: Enth&auml;lt das Text- Ein/ausgabefeld f&uuml;r die Statusmeldungen 
die entweder von Flash selbst oder vom Server (bzw. der ASP Seite) stammen k&ouml;nnen.</li>

	<li><b>Button_zum Start</b>: Enth&auml;lt den hellblauen Button, der nach &Uuml;berpr&uuml;fung 
der Textfelder deren Inhalt an den Server weiterleitet.</li>

	<li><b>Daten_an_ Server und retour</b>: Enth&auml;lt den Code zum Versenden und Empfangen der 
Daten. Au&szlig;erdem bewerkstelligt er die Ausgabe. </li>
</ol>


<h3>3.2 Die Logik des Flash Files</h3>

<p>In Frame 2 wird das User Interface aufgebaut und eine STOP Action gestetzt. 
Danach hat der User Zeit, Werte in die Felder <i>Zahl1</i> und <i>Zahl2</i> einzugeben. 
Die Eingabe wird durch Dr&uuml;cken des blauen Buttons best&auml;tigt und &uuml;berpr&uuml;ft. 
Der Einfachheit halber wird nur auf "keine Eingabe" oder "Eingabe" gepr&uuml;ft, nicht 
aber ob der Benutzter Zahlen oder Strings eingegeben hat.</p>

<p>In Frame 4 wird der Querystring zusammengebaut, damit die eingegebenen Zahlen 
als Teil der URL zum Server geschickt werden k&ouml;nnen.</p>

<p>Zu guter letzt wird in Frame 5 die ASP Seite aufgerufen, die Variablen verschickt
(URL enth&auml;lt den Querystring) und auf eine Antwort des Servers 
gewartet. Die vom Server r&uuml;ckgesendeten Variablen haben die selben Namen wie
die Ausgabefelder und werden somit von Flash automatisch &uuml;bernommen.</p>


<h2>4. Die Flash Programmierung</h2>

<p>Im folgenden Punkt wird die Programmierung des Flash Action Scripts zum Datenaustausch zwischen 
Flash und ASP genauer unter die Lupe genommen. </p>


<h3>4.1 Die verwendeten Variablen</h3>

<p>F&uuml;r die Textein(aus)gabefelder werden bei der statischen Erzeugung des Formulares folgende 
Variablennamen verwendet:</p>

<ul>
	<li>Eingabefeld f&uuml;r die erste Zahl: <i>zahl1</i></li>
	<li>Eingabefeld f&uuml;r die zweite Zahl: <i>zahl2</i></li>
	<li>Ausgabefelder f&uuml;r Addition, Multiplikation, Division und Subtraktion: <i>sum</i>, 
<i>mult</i>, <i>div</i>, <i>dif</i></li>
	<li>Statusfeld f&uuml;r Meldungen an den User: <i>status</i></li>
</ul>


<h3>4.2 Button - Action zur Eingabeverifizierung</h3>

<p>Wird der hellblaue Button gedr&uuml;ckt, so findet eine &Uuml;berpr&uuml;fung statt, ob Werte 
eingegeben wurden, oder ob sich in den Feldern noch immer ein Leerstring befindet. 
F&uuml;r den Fall, da&szlig; <i>zahl1</i> oder <i>zahl2</i> einen Leerstring enth&auml;lt
wird eine Meldung in der Statuszeile ausgegeben sowie die Werte der Variablen 
nicht an die ASP Seite geschickt.</p>

<p>Folgendes Button - Actionscript wird unter "Eigenschaften" des in Frame 2 auf der B&uuml;hne 
positionierten Buttons eingegeben:</p>

<pre style="background='silver';">
On (Press)
    If ((zahl1 ne "") and (zahl2 ne ""))
        Go to Next Frame
    Else
        Set Variable: "status" = "Bitte Zahlen eingeben"
    End If
End On
</pre>

<p>Nach dem Dr&uuml;cken des Buttons wird gepr&uuml;ft, ob keines der beiden Textfelder einen 
Leerstring enth&auml;lt. Wie zu sehen ist, wird der Inhalt des Textfeldes direkt 
&uuml;ber seinen Variablennamen angesprochen. </p>

<p><b>Achtung:</b></p>

<p>Flash erlaubt als Vergleichsoperatoren in <i>if</i> - Abfragen sowohl 
<i>eq</i>, <i>ne</i>, <i>lt</i>, <i>gt</i>, <i>le</i>, <i>ge</i> als auch 
<i>=</i>, &lt;&gt;, &lt;, &gt;, &lt;=, &gt;=. 
Dabei sollte strikt darauf geachtet werden, da&szlig; bei Stringvergleichen 
<i>equal</i>,<i> not equal</i>  usw. und bei numerischen Vergleichen
<i>=</i>, <i>&lt;&gt;</i> usw. zu verwenden ist.
Ansonsten interpretiert Flash Stringwerte als numerische Werte (oder umgekehrt). 
Nebeneffekte sind, da&szlig; Null als Leerstring oder ein Leerstring als Null interpretiert 
werden k&ouml;nnte.
Das h&auml;tte im vorherigen Skript nat&uuml;rlich fatale Folgen, da somit ein echter 
Leerstring nicht erkannt werden w&uuml;rde (implizite Konvertierung in 
eine Null bei Verwendung des <i>&lt;&gt;</i> Operators anstelle von <i>ne</i>). </p>

<p>Sollte noch ein Leerstring vorhanden sein, so wird eine Meldung in die Statuszeile geschrieben. 
Dies geschieht direkt durch Zuweisung eines Wertes auf die Variable "<i>status</i>".</p>

<h3>4.3 L&ouml;schen des Statusfeldes</h3>

<p>Liegt eine g&uuml;ltige Eingabe der zwei Zahlenwerte (also kein Leerstring) erst beim zweiten 
(oder sp&auml;terem) Klick auf den Button vor, so w&uuml;rde nach wie vor die Statusmeldung der 
falschen Eingabe sichtbar sein. 
Dies macht es n&ouml;tig die Statusmeldung durch &Uuml;berschreiben der <i>status</i>
Variable mit einem Leerstrings zu l&ouml;schen.</p>

<p>Dies geschieht in Frame 3 des Layers "Daten_an_ Server und retour":</p>

<pre style="background='silver';">
Set Variable: "status" = ""
Go to Next Frame
</pre>

<p>Nachdem die Statuszeile gel&ouml;scht wurde geht Flash zum n&auml;chsten Frame.</p>


<h3>4.4 Zusammenbau des Querystrings</h3>

<p>In Frame 4 wird der Querystring vorbereitet. Dies ist n&ouml;tig um ausschlie&szlig;lich 
die Variablen <i>zahl1</i> und <i>zahl2</i> an den Server zu schicken.
Der Zusammenbau k&ouml;nnte auch direkt im Statement zum Aufrufen der ASP-Seite 
stattfinden, wurde aber der &Uuml;bersichtlichkeit halber in ein eigenes 
Actionscript verpackt.</p>

<p>Dieses Script stellt sich folgenderma&szlig;en dar:</p>

<pre style="background='silver';">
Set Variable: "aspfile" = "/calc.asp?"&amp;"a="&amp;Zahl1&amp;"&amp;"&amp;"b="&amp;Zahl2
Go to Next Frame
</pre>

<p>Der eigentliche Querystring, der dadurch an den Server geschickt wird, sieht 
folgenderma&szlig;en aus: <i>a=[zahl1]&amp;b=[zahl2]</i>.

<p>Der Querystring wird an den Namen der ASP-Datei durch <i>?</i> getrennt 
angeh&auml;ngt.</p>

<i>[zahl1]</i> und <i>[zahl2]</i> stehen f&uuml;r die Werte der Variablen bzw. Eingabefelder <i>zahl1</i> und <i>zahl2</i>. Also: /calc.asp?a=<i>zahl1</i>&amp;b=<i>zahl2</i>. 
</pre>

<p>Bei einer Eingabe der Zahlen <i>17</i> und <i>4</i> sieht der Inhalt der Variablen 
<i>aspfile</i> wie folgt aus:</p>

<pre style="background='silver';">
/calc.asp?a=17&amp;b=4
</pre>

<p>Dieser String stellt die aufzurufende URL der ASP Seite dar. Die URL wird in Flash 
unter Verwendung des &amp;-Zeichen aus Strings und numerischen Variablen aufgebaut. 

<p>Das Ergebnis wird in der Variablen <i>aspfile</i> gespeichert. 
Der Server bekommt dann die eingegebenen Zahlenwerte als Werte der 
Querystring-Variablen <i>a</i> und <i>b</i>.</p>

<p>Dadurch kann man die Werte in der ASP Seite &uuml;ber 
<i>Request.QueryString("a")</i> und <i>Request.QueryString("b")</i> auslesen.</p>


<h3>4.5 Aufrufen der ASP-Seite, Serverantwort, Ergebnisausgabe</h3>

<p>Der eigentliche Kernteil stellt sich sehr einfach dar. 
Nachdem eine ASP-Seite mittles <i>Load&nbsp;Variables</i> Befehl aufgerufen 
und die Variablen im Querystring &uuml;bergeben wurden, wartet Flash 
solange im gleichen Frame, bis die Antwort der ASP Seite eintrifft. </p>

<p>Die Antwort der ASP Seite besteht dabei einfach aus einem URL-Encoded String, 
der alle Variablen und Werte enth&auml;lt, die im Flash gesetzt werden sollen.
So liefert eine ASP Seite (mittels <i>Response.Write</i>) den folgenden 
String zur&uuml;ck, um in Flash die Variable <i>sum</i> auf den Wert <i>7</i>
und die Variable <i>dif</i> auf den Wert <i>9</i> zu 
setzen:</p>

<pre style="background='silver';">
sum=7&amp;dif=9
</pre>

<p>Die Variablennamen des vom Server geschickten "Textes" werden also analog zu den 
Textein/Ausgabefeldern von Flash definiert. So werden die vom Server gesendeten Werte ohne Umweg 
direkt in die Ergebnisfelder geschrieben. Der Aufruf der ASP-Seite erfolgt in den folgenden Zeilen:</p>

<pre style="background='silver';">
Set Variable: "status" = "Variablen werden an den Server geschickt"
Load Variables (aspfile, 0)
Stop
</pre>

<p>Bis die Antwort des Servers im Script eintrifft, wird in der Statuszeile also
eine Meldung angezeigt.</p>

<p>Mit dem <i>Load&nbsp;Variables</i> Befehl, der sinnigerweise ein Unterbefehl des 
<i>Load&nbsp;Movie</i> Befehls ist, wird der im vorherigen Frame erzeugte 
URL-String <i>aspfile</i> benutzt, um die zugeh&ouml;rige ASP-Datei aufzurufen
und Werte im Query-String zu &uuml;bergeben.</p>

<p>Wie die ASP Datei des Servers genau aufgebaut ist wird unter Punkt 5 erkl&auml;rt.</p>

<p>Alternativ zu dieser Vorgangsweise des selektiven Versendens von Variablenwerten durch Angeben 
im Querystring der URL k&ouml;nnen die Variablen auch ohne das 
umst&auml;ndliche Zusammenstellen des Query-Strings an den Server geschickt werden:
Dazu gibt man als URL nur das ASP-File an und w&auml;hlt 
"<i>send&nbsp;using&nbsp;get</i>" oder "<i>post</i>" aus. 
In diesem Fall w&uuml;rden aber alle Variablen des gleichen Levels, 
in unserem Beispiel also nicht nur <i>zahl1</i> und <i>zahl2</i> 
sondern auch alle anderen Variablen, an den Server geschickt werden, 
was bei einem aufwendigen Flash Script einen gro&szlig;en Datenstrom 
zwischen Browser (Flash Script) und Server zur Folge h&auml;tte.</p>

<p><b>Achtung:</b></p>

<p>Es darf nicht vergessen werden beim <i>Load&nbsp;Variables</i> Befehl den 
Button neben dem URL - Eingabefeld von "<i>ABC</i>" auf "<i>=</i>"  zu setzen, 
da ansonsten der angegebene Wert als String und nicht als Expression 
(Ausdruck) behandelt werden w&uuml;rde.
Das hei&szlig;t in diesem Fall, da&szlig; Flash versuchen w&uuml;rde "nichts" (kein "send 
using get" oder "post") an die Datei "<i>aspfile</i>" zu schreiben.
Grunds&auml;tzlich kann gesagt werden, da&szlig; das Nichtsetzen des Expression Buttons 
"<i>=</i>" die h&auml;ufigste Fehlerquelle beim Flash-Programmieren darstellt.</p>

<p><b>Achtung:</b></p>

<p>Bei der <i>Load&nbsp;Movie</i> - <i>Load&nbsp;Variable</i> Action ist der Level 
standardm&auml;&szlig;ig auf Eins (1) gesetzt.
Werden Variablen in der Haupinstanz von Flash genutzt (Szenenebene), 
mu&szlig; dieser Wert auf Null (0) umgestellt werden, da ansonsten die Variablen 
des Servers nicht an ihrem Bestimmungsort eintreffen.</p>


<h2>5. ASP Datei, Aktionen am Server</h2>

<p>Die im Querystring gesendeten Werte werden mittels 
<nobr><i>Request.QueryString("Variablenname")</i></nobr> 
ausgelesen:</p>

<pre style="background='silver';">
a = Request.QueryString("a")
b = Request.QueryString("b")
</pre>

<p>Danach werden die Werte f&uuml;r die Variablen <i>sum</i>, <i>mult</i>, <i>div</i> 
und <i>dif</i> errechnet:</p>

<pre style="background='silver';">
a = CDbl(a)
b = CDbl(b)
strStatus = "Alles in Ordnung!"
dblSum = a + b
dblMult = a * b
dblDif = a - b
If Abs(b) &lt; 0.00001 Then
   dblDiv = "Error"
   strStatus = "Fehler: Division durch Null!"
Else
   dblDiv = a / b
End If
</pre>

<p>Nun k&ouml;nnen die Ergebnisse an Flash zur&uuml;ckgeschickt werden. 
Die geschieht durch das Senden eines URL-Encoded Strings, 
der alle Variablen und Werte enth&auml;lt, mittels <nobr><i>Response.Write</i>:</nobr></p>

<pre style="background='silver';">
strURLEncoded = "sum=" &amp; Server.URLEncode(dblSum)
strURLEncoded = strURLEncoded &amp; "&amp;mult=" &amp; Server.URLEncode(dblMult)
strURLEncoded = strURLEncoded &amp; "&amp;div=" &amp; Server.URLEncode(dblDiv)
strURLEncoded = strURLEncoded &amp; "&amp;dif=" &amp; Server.URLEncode(dblDif)
strURLEncoded = strURLEncoded &amp; "&amp;status=" &amp; Server.URLEncode(strStatus)
Response.Write strURLEncoded
</pre>

<p>Wenn Flash also die Werte <i>16</i> (<i>a</i>) und <i>4</i> (<i>b</i>) sendet, 
so sieht der von der ASP Seite retournierte String wie folgt aus:</p>

<pre style="background='silver';">
sum=20&amp;mult=64&amp;div=4&amp;dif=12&amp;status=Alles+in+Ordnung%21
</pre>


<h2>Schlu&szlig;bemerkung</h2>

<p>Wie zu zeigen war, ist die &Uuml;bergabe von Daten an den Server nicht wirklich schwierig.
Nat&uuml;rlich gibt es auch hier Fallen die in schwer zu erkennenden Fehlern resultieren 
k&ouml;nnen. Dies vor allem dann, wenn die mit "<b>Achtung</b>" gekennzeichneten Tips nicht 
eingehalten werden. 
Au&szlig;erdem ist die unkonventionelle Art um Flash-Scripts zu programmieren fehlertr&auml;chtig. </p>

<p>Nichts desto trotz er&ouml;ffnet sich f&uuml;r den Flash Programmierer eine neue Welt 
durch die M&ouml;glichkeit in Flash sehr komplexe oder unm&ouml;gliche Berechnungen 
in einer ASP-Seite verrichten zu lassen. Somit sind ansonsten unl&ouml;sbare Aufgaben 
relativ leicht zu l&ouml;sen (z.B. Array Emulation, trigonometrische 
Funktionen).</p>

<p>In kommenden Artikeln wird auf die Kommunikation zwischen Flash-Script
und ASP-Seite zur Nutzung der besten M&ouml;glichkeiten beider Welten 
weiter eingegangen werden.</p>
<h2>Download des Codes</h2>
<p><a href="../Code/20000719.zip">Klicken Sie hier</a>, um den Download zu starten.</p>
<h2>Verwandte Artikel</h2>
<p>
<a href="20000908.htm">Cookies in Flash mittels ASP manipulieren</a><br>
<a href="20020320.htm">Flash Detection ohne Komponente</a><br>

</p>

<h2>Wenn Sie jetzt Fragen haben...</h2>
<p>
Wenn Sie Fragen rund um die in diesem Artikel vorgestellte Technologie haben, dann schauen Sie einfach bei uns
in den <a href="http://glengamoi.com/forums/">Community Foren der deutschen .NET Community</a> vorbei. Die Teilnehmer 
helfen Ihnen gerne, wenn Sie sich zur im Artikel vorgestellten Technologie weiterbilden m&ouml;chten.
</p>

<p>
<a href="http://glengamoi.com/forums/"><img src="../images/glengamoi.com_250.gif" width="250" height="80" alt="" border="0"></a>
</p>


<p>
Haben Sie Fragen die sich direkt auf den Inhalt des Artikels beziehen, dann schreiben Sie dem Autor! Unsere Autoren
freuen sich &uuml;ber Feedback zu ihren Artikeln. Ein einfacher Klick auf die <i>Autor kontaktieren</i>
Schaltfl&auml;che (weiter unten) und schon haben Sie ein f&uuml;r diesen Artikel personalisiertes Anfrageformular.
</p>

<p>&nbsp;</p>
<p>
Und zu guter Letzt m&ouml;chten wir Sie bitten, den Artikel zu bewerten. Damit helfen Sie uns, 
die Qualit&auml;t der Artikel zu verbessern - und anderen Lesern bei der Auswahl der Artikel,
die sie lesen sollten.
</p>

<FORM METHOD="POST" STYLE="margin-bottom: 0px;" NAME="formRating" ACTION="/service/bewerten.asp">
<INPUT TYPE="HIDDEN" NAME="ArticleId" VALUE="20000719" />
<CENTER>
<TABLE BORDER="0" CELLSPACING="0" CELLPADDING="0">
<TR>
	<TD ALIGN="CENTER" VALIGN="MIDDLE" COLSPAN="7">Bewerten Sie diesen Artikel</TD>
</TR>
<TR>
	<TD><EM>&nbsp;Sehr gut&nbsp;</EM></TD>
	<TD><INPUT TYPE="radio" value="1" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="2" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="3" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="4" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="5" NAME="radioRating" /></TD>
	<TD ALIGN="right"><EM>&nbsp;Nicht gen&uuml;gend</EM></TD>
	<TD ROWSPAN="2" VALIGN="middle">&nbsp;<INPUT TYPE="submit" VALUE="Werten!" /></TD>
</TR>
<TR>
	<TD>&nbsp;</TD>
	<TD ALIGN="CENTER">&nbsp;1</TD>
	<TD ALIGN="CENTER">&nbsp;2</TD>
	<TD ALIGN="CENTER">&nbsp;3</TD>
	<TD ALIGN="CENTER">&nbsp;4</TD>
	<TD ALIGN="CENTER">&nbsp;5</TD>
	<TD>&nbsp;</TD>
</TR>
</TABLE>
</FORM>
</center>
&nbsp;<P>
<center>
<p><table><tr><td valign=top>
<form action="REMOVED" method="GET"><input type="hidden" name="pagetitle" value="Datenaustausch zwischen Macromedia Flash und ASP"><input type="hidden" name="pageurl" value="http://www.aspheute.com/artikel/20000719.htm"><input type="image" src="../images/layout/senden.png" width="107" height="20" border="0" alt="Schicken Sie diese Seite einem Freund!" style="cursor='hand';"></form>
<td>&nbsp;&nbsp;</td>
<td valign=top>
<form action="REMOVED" method="GET"><input type="hidden" name="Author" value="Günter Hoffellner"><input type="hidden" name="AuthorEmail" value="hoffellner@aon.at"><input type="hidden" name="Artikel" value="20000719"><input type="image" src="../images/layout/kontakt.png" width="107" height="20" border="0" alt="Kontaktieren Sie den Autor!" style="cursor='hand';"></form>
<td>&nbsp;&nbsp;</td>
<td valign=top><a href="../PrinterFriendly/20000719.htm"><img src="../images/layout/druck.png" width="118" height="20" border="0" alt="F&uuml;r Ausdruck optimierte Seite"></a></td>
</tr></table></p>
</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
