<HTML>
<HEAD>
<TITLE>Schreib"kunst" f&uuml;r Programmierer, Teil II</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="7 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Heute besch&auml;ftigen wir uns mit Stilfragen und den kleinen Tricks die aus einem verst&auml;ndlichem technischen Text einen gut zu lesenden, interessanten Text machen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Technisches Schreiben,Dokumentation,Schreibstil,Stilrichtlinien,Guideline,Gutes Schreiben,Dokumentation">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff"  BACKGROUND="../images/layout/aspheutemainbg.gif" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<MAP NAME="titlebar">
<!--<AREA SHAPE=RECT COORDS="116,46,191,61" HREF="http://www.aspaktuell.com" ALT="ASP Aktuell">-->
<!--<AREA SHAPE=RECT COORDS="192,46,255,61" HREF="http://www.aspwelt.com" ALT="ASP Welt">-->
<AREA SHAPE=RECT COORDS="256,46,432,61" HREF="http://www.aspgerman.com/aspgerman/" ALT="ASP German">
<AREA SHAPE=RECT COORDS="115,15,269,42" HREF="../default.htm" ALT="Homepage">
<AREA SHAPE=RECT COORDS="278,26,587,42" HREF="../default.htm" ALT="Homepage">
</MAP>

<div style="position:absolute;left:0px;top:30px">
<table border=0 cellspacing=0 cellpadding=0>
<tr>
<td background="../images/layout/aspheutetitle.gif">
<img src="../images/layout/blind.gif" width="715" height="73" usemap="#titlebar" border="0">
</td>
<td width="100%" background="../images/layout/aspheutetitleext.gif">
&nbsp;
</td>
<td background="../images/layout/aspheutetitleend.gif">
<img src="../images/layout/blind.gif" width="25" height="1">
</td>
</tr>
</table>
</div>

<div style="position:absolute;left:1px;top:115px">
<table width="110" border="0" cellspacing="0" cellpadding="0">
<tr><td width="110"><img src="../Images/spacer.gif" width="110" height="1" alt="" border="0"></td></tr>
<tr>
<td background="../images/layout/aspheuteheader.gif" class="header" height=16 width="110">
<p>Liste</p>
</td>
</tr>
<tr>
<td background="../images/layout/aspheuteheaderext.gif" class="header" width="110">

<p class="content">
<a href="../kategorien/dotNET%202dot0.htm">.NET 2.0 (1)</a><br>
<a href="../kategorien/dotNET%20Allgemein.htm">.NET Allgemein (16)</a><br>
<a href="../kategorien/dotNET%20Fu.htm">.NET Fu (5)</a><br>
<a href="../kategorien/ADOdotNET.htm">ADO.NET (11)</a><br>
<a href="../kategorien/Aprilscherz.htm">Aprilscherz (3)</a><br>
<a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen (44)</a><br>
<a href="../kategorien/ASP%20Tricks.htm">ASP Tricks (83)</a><br>
<a href="../kategorien/ASPdotNET.htm">ASP.NET (44)</a><br>
<a href="../kategorien/ASPIntranetdotde.htm">ASPIntranet.de (5)</a><br>
<a href="../kategorien/Csharp.htm">C# (28)</a><br>
<a href="../kategorien/Datenbank.htm">Datenbank (44)</a><br>
<a href="../kategorien/Dokumentation.htm">Dokumentation (4)</a><br>
<a href="../kategorien/IIS%206dot0.htm">IIS 6.0 (1)</a><br>
<a href="../kategorien/Komponenten.htm">Komponenten (29)</a><br>
<a href="../kategorien/Optimierung.htm">Optimierung (10)</a><br>
<a href="../kategorien/Server.htm">Server (21)</a><br>
<a href="../kategorien/Sicherheit.htm">Sicherheit (34)</a><br>
<a href="../kategorien/Tee%20Off.htm">Tee Off (6)</a><br>
<a href="../kategorien/VBdotNET.htm">VB.NET (6)</a><br>
<a href="../kategorien/WAP.htm">WAP (8)</a><br>
<a href="../kategorien/Web%20Services.htm">Web Services (11)</a><br>
<a href="../kategorien/XML.htm">XML (9)</a><br>


<br>
<a href="/syndication/rss.xml"><img src="../Images/rss_small.png" width="25" height="10" alt="RSS 2.0 - Die neuesten f&uuml;nf Artikel auf AspHeute.com" border="0"></a>

</p><!-- </p> remains -->


<br>

</td>
</tr>
<tr>
<td class="empty" width="110">
&nbsp;
</td>
</tr>
<tr>
<td background="../images/layout/aspheutesearch.gif" class="header" height=16 width="110">
<p>Suchen</p>
</td>
</tr>
<tr>
<td background="../images/layout/aspheutesearchext.gif" class="header" width="110">
<form class="content" ACTION="REMOVED" METHOD="GET">
<div>
<input class="Newsletter" type="text" size="10" name="CiRestriction">
<span class="spacer2"><br></span>
<span class="spacer4"><br></span>
<INPUT TYPE="HIDDEN" NAME="CiMaxRecordsPerPage" VALUE="10">
<INPUT TYPE="HIDDEN" NAME="CiSort" VALUE="rank[d]">
<INPUT TYPE="HIDDEN" NAME="HTMLQueryForm" VALUE="../default.htm">
<img src="../images/layout/blind.gif" width="41" height="1"><input type="image" src="../images/layout/aspheutesearchenter.gif" border="0" width="49" height="14"><br>
<span class="spacer4"><br></span>
</div>
</form>
</td>
</tr>
<tr>
<td class="empty" width="110">
&nbsp;
</td>
</tr>
<tr>
<td background="../images/layout/aspheuteheaderext.gif" class="header" width="110">
<p class="content">
<a href="/REMOVED/" title="Our most popular articles translated into English">English Articles</a><br>
<a href="/REMOVED/" title="Visit our Chinese content section">Chinese Articles</a><br>
<a href="../autoren/UnsereAutoren.htm" title="Unsere Autoren">Unsere Autoren</a><br>
&nbsp;<br>
<a href="/REMOVED/link2us.asp" title="Setzen Sie einen Link zu AspHeute!">Link zu AspHeute</a><br>
<a href="/REMOVED/impressum.asp" title="Das Impressum von AspHeute">Impressum</a><br>
<a href="/REMOVED/advertise.asp" title="Werben auch Sie auf AspHeute">Werben</a><br>
<a href="/REMOVED/kontakt.asp" title="Teilen Sie uns Ihre W&uuml;nsche, Beschwerden und Anregungen mit">Anfragen</a><br>
</p>
</td>
</tr>
</table>
</div>



<!-- Content starts here  -->
<div style="position:absolute;left:120px;top:108px">
<table cellspacing="0" cellpadding="0"><!--Tabelle aussen-->
<tr><!--Tabelle aussen, 1/2-->
<td><!--Tabelle aussen, 1/1-->
    <table border=0 align=center><tr><td align=center>


</td></tr></table>

<H1>Schreib"kunst" f&uuml;r Programmierer, Teil II</H1>
<p>
Geschrieben von: <a href="../autoren/bernhardspuida.htm">Bernhard Spuida</a><br>
Kategorie: <a href="../kategorien/Dokumentation.htm">Dokumentation</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20020701"></SCRIPT>
</p>
<p>
In Teil I haben wir uns mit den Grundlagen - Lesbarkeit und Verst&auml;ndlichkeit von Texten - besch&auml;ftigt. Heute besch&auml;ftigen wir uns mit 
Stilfragen und den kleinen Tricks die aus einem verst&auml;ndlichem technischen Text einen gut zu lesenden, interessanten Text machen.
</p>
<p>
F&uuml;r diese beiden Artikel wird nichts besonderes vorausgesetzt. Au&szlig;er vielleicht ein wenig Ehrgeiz, besser zu werden. Und Bereitschaft, sich 
durch &Uuml;bung weiterzuentwickeln. Das trifft auch auf mich zu. Also mit Anregungen, Erg&auml;nzungen und konstruktiver Kritik bitte an mich wenden. 
Ich freue mich &uuml;ber alles was ich von Dir, Leser, dazulernen kann.
</p>

<h2>Stil</h2>
<p>
Hier werden wir uns mit all den kleinen Dingen besch&auml;ftigen, die annehmbare technische Texte in gutes Deutsch umwandeln. Es gibt eine Anzahl kleiner, 
unauff&auml;lliger 'Du sollst'- und 'Du sollst nicht'-Gebote auf die wir als Autoren bewu&szlig;t achten m&uuml;ssen, auch wenn sie bei der Erkl&auml;rung im 
folgenden offensichtlich zu sein scheinen.
</p>
<p>
Das vorgestellte Material <i>ist nicht nach Wichtigkeit sortiert</i>, es wird in der Reihenfolge pr&auml;sentiert in der sie mir einfielen. Es handelt sich 
sozusagen um eine pers&ouml;nlich gef&auml;rbte 'Wunschliste' f&uuml;r gutes Schreiben. F&uuml;r Erg&auml;nzungsvorschl&auml;ge bin ich jederzeit offen: 
bernhard@icsharpcode.net
</p>

<h3>1. Gro&szlig;e Worte</h3>
<p>
<b>Als Autor sei stets bescheiden. Es mag wohl eine bestechende Verlockung sein, Vokabular zu verwenden das obskuren Werken &uuml;ber Sprache entlehnt sein 
m&ouml;ge, darob gro&szlig;artige rhetorische Obfuskation zu erzeugen woraufhin der Leser sich wohlweislich in einen Zustand vollst&auml;ndigen 
Nichtverst&auml;ndnisses begeben wird.</b>
</p>
<p>
Es d&uuml;rfte nach diesem Beispiel wohl klar sein, worum es hier geht:  stehen zwei Worte mit gleicher Bedeutung zur Wahl, ist das einfachere Wort zu 
bevorzugen. Mit einer Ausnahme - ist das 'gr&ouml;&szlig;ere' Wort klarer in seiner Bedeutung, ist dieses zu bevorzugen.
</p>
<p>
Sollte man eine H&auml;ufung gro&szlig;er Worte in seinem Text bemerken, ist es ratsam auch die S&auml;tze auf &Uuml;berl&auml;nge zu &uuml;berpr&uuml;fen, da 
diese beiden Dinge erfahrungsgem&auml;&szlig; zusammen auftreten.
</p>
<p>
Verwendet man jedoch immer nur das einfachste m&ouml;gliche Wort, wird der Text jedoch schnell langweilig. Ein wenig Abwechslung schadet nie!
</p>

<h3>2. Anglizismen</h3>
<p>
Gerade im Bereich des technischen Schreibens ist die Verwendung von englischen (Fach)Worten oft unumg&auml;nglich, da eine genau entsprechende deutsche 
Vokabel h&auml;ufig nicht verf&uuml;gbar ist.
</p>
<p>
Dementsprechend besteht h&auml;ufig eine gewisse Tendenz, englische Vokabeln unn&ouml;tig zu verwenden. Dies w&auml;re ja nicht weiter schlimm wenn diese 
'Anglizismen' korrekt verwendet w&uuml;rden. Leider wird oft nicht auf den genauen Sinn des verwendeten Wortes geachtet, so da&szlig; durch die Verwendung 
des englischen Ausdruckes mitunter der Sinn des Satzes verfremdet oder sogar v&ouml;llig entstellt wird.
</p>
<p>
Ein besonderer Fallstrick sind in dieser Hinsicht die 'falschen Freunde' &mdash; sinnentstellende &Uuml;bersetzungen. So ist zum Beispiel das Englische 
'copy' auf Deutsch meist mit 'Exemplar' besser &uuml;bersetzt.
</p>
<p>
Diese <a href="http://uebersetzungsfallen.de" target="_blank">Website</a> bietet einen guten &Uuml;berblick &uuml;ber die Probleme mit Anglizismen und 'falschen Freunden'.
</p>

<h3>3. Ego-trip</h3>
<p>
Da ein technischer Fachartikel keine Lebensbeichte oder pers&ouml;nliche Weltsicht des Autors darstellt, sollte das Wort 'Ich' vermieden werden. Nur in den 
wenigen F&auml;llen wo pers&ouml;nliche Vorlieben oder Entscheidungen eine bestimmende Rolle spielen kann 'ich' verwendet werden. Bei der Begr&uuml;ndung von 
Architekturentscheidungen (die man alleine getroffen hat - ohne Teammitglieder zu fragen) ist also 'ich' tolerierbar, nicht aber bei der detaillierten 
Beschreibung der daraus entstandenen Schnitttstellen.
</p>
<p>
'Unpers&ouml;nlicher' Stil ist bereits seit C&auml;sar akzeptabel. <b>Er</b> schilderte <b>seine</b> Sicht des Gallischen Krieges in der dritten Person - ein 
St&uuml;ck klassische Literatur und doch ein rein technischer Bericht &uuml;ber die Vorkommnisse. Die Verwendung des Passivs sollte allerdings soweit 
m&ouml;glich vermieden werden, da es erm&uuml;dend wirkt. Wer das nicht glaubt, braucht nur einen Blick in juristische Texte zu werfen.
</p>
<p>
Wenn wir wollen, da&szlig; unsere Texte mit Interesse gelesen werden sollten wir darauf achten, da&szlig; zwischen unseren Lesern und uns Autoren eine 
gleichberechtigte Beziehung aufgebaut wird. 'Klassische' technische Artikel sind meist unpers&ouml;nlich, heute ist dies nicht mehr die Regel. Dennoch 
gilt: wir haben ein Ziel, sind aber keine Verwandten.
</p>

<h3>4. Hilfe! Hilfsverben!</h3>
<p>
Mit Hilfsverben sollte man sparsam umgehen. Verwendet man sie zu h&auml;ufig, wirkt der Text schnell unbeholfen.</p>
<p>
<b>Tut man zu viele Hilfsw&ouml;rter einbauen, wird der Stil schlechter werden.</b>
</p>
<p>
Dazu mu&szlig; nicht mehr viel gesagt werden, da das Beispiel die Aussage gut illustriert. Besonders das oben verwendete 'tun' und das ebenso ber&uuml;chtigte 
'haben' sollten vermieden werden.
</p>

<h3>5. Schachteln</h3>
<p>
Eine Folge unseres Mitteilungsdranges als Autoren ist leider oft da&szlig; wir zu viel auf einmal sagen wollen. Wir schreiben dann so 'wie unser Schnabel 
gewachsen ist': ohne Pause, ohne logische Gliederung. Und h&auml;ufig ohne R&uuml;cksicht auf den Leser.
</p>
<p>
<b> Unsere S&auml;tze werden lang und l&auml;nger mit Folgen f&uuml;r das Verst&auml;ndnis des Lesers &mdash; durchsetzt von Einsch&uuml;ben die oft 
unn&ouml;tig sind, auch wenn sie spontan f&uuml;r das Verst&auml;ndnis n&ouml;tig zu sein scheinen &mdash;  welches wie bereits im ersten Teil des 
Artikels unter dem Kapitel 'Rekursion' erw&auml;hnt, dort wurde eine Aufteilung in einzelne S&auml;tze empfohlen, &uuml;berlastet wird.</b>
</p>
<p>
Die schlimmste Sorte Schachtelsatz hat einen umfassenden Hauptsatz wobei das Verb am Ende des Monsters 'h&auml;ngt' &ndash; ganz ohne Bezug zu Subjekt 
und Objekt. Also: was logisch zusammen geh&ouml;rt, geh&ouml;rt auch im Satz zusammen.
</p>

<h3>6. Passiva</h3>
<p>
Der Vorgang des Lesens ist f&uuml;r den Leser ohnehin anstrengend. Und der grammatikalische Begriff 'Passiv' heisst auf Deutsch nicht umsonst 'Leidensform'. 
Wir wollen <b>zusammen mit unseren Lesern</b> am Ende unseres Textes ein Ziel erreichen, statt ihnen einen Vortrag &uuml;ber die M&ouml;glichkeit einer 
Reise dorthin zu halten.
</p>
<p>
<b>Wenn Verben von uns im Passiv verwandt werden, werden sie genauso wie unsere Leser mit Fortschreiten des Textes erm&uuml;den und unser Ziel wird nicht 
erreicht werden.</b>
</p>
<p>
Unsere Leser 'erdulden' bereits unseren Text. M&uuml;ssen wir die Subjekte und Objekte unserer S&auml;tze auch noch in eine Leidenssituation bringen? Nein! 
Je aktiver die Verwendung von Verben in unseren Texten ist, desto besser f&uuml;r die Leser, uns und den Text.
</p>

<h3>7. Typo und Interpunktion</h3>
<p>
Dieser Abschnitt verdankt seine Existenz einem Leser des ersten Artikels &mdash; danke Mischa!</p>
<p>
Lesbarkeit und auch Verst&auml;ndlichkeit eines Textes h&auml;ngt auch von der korrekten Verwendung von Satzzeichen ab. Dies ist einerseits eine Frage der 
Zeichensetzung &ndash; also der Interpunktion &ndash; andererseits auch eine Frage des Schriftsatzes &ndash; d.h. der Typographie. Erstere regelt das 
'wo', 'was' und 'wann'; letztere das 'wie', denn nicht immer haben wir die vollen M&ouml;glichkeiten des klassischen Buchdrucks zur Verf&uuml;gung.
</p>
<p>
Interpunktion wurde bereits im ersten Artikel angeschnitten, auf dieses Thema wird also nicht n&auml;her eingegangen. F&uuml;r Leser mit Wunsch nach 
n&auml;herer Information zu diesem Thema sei wieder auf das exzellente Buch 'Deutsch f&uuml;r Profis' von Wolf Schneider verwiesen.
</p>
<p>
Was das 'wie' der Zeichensetzung angeht, so haben wir heute Probleme, die in der Zeit vor dem Computer nicht existierten: Zeichens&auml;tze, speziell ASCII. 
ASCII ist der kleinste gemeinsame Nenner f&uuml;r (West-)Europ&auml;ische Alphabete. Vergleichen wir einen ASCII-Zeichensatz mit modernem Unicode &mdash; 
oder dem Setzkasten eines Buchdruckers vor weniger als hundert Jahren &mdash; so stellen wir fest da&szlig; wir in der Zeichenanzahl stark eingeschr&auml;nkt 
sind.
</p>
<p>
ASCII unterscheidet zum Beispiel nicht zwischen:
</p>

<table width="80%" align=center>
<tr><td width="40%">Trennstrich</td><td>-</td><td>-</td></tr>
<tr><td>Bindestrich</td><td>&ndash;</td><td>&amp;ndash;</td></tr>
<tr><td>Gedankenstrich</td><td>&mdash;</td><td>&amp;mdash;</td></tr>
</table>

<p>
Der Trennstrich wird am Zeilenende bei Silbentrennung verwendet. Der Bindestrich kommt in zusammengesetzten Worten zum Einsatz, der Gedankenstrich setzt 
eingeschobene Gedanken vom Hauptsatz ab.
</p>
<p>
Genauso gibt es in ASCII kein &Auml;quivalent zu den Auslassungspunkten ('Ellipsis', dargestellt durch drei Punkte mit geringerem Abstand, Unicode 8230). Wenn 
wir ein Office-Paket oder TeX verwenden, so ist diese Beschr&auml;nkung kein Problem. In HTML oder in unformatierten Textdateien die einem Programm 
mitgegeben werden ist das jedoch mitunter ein Problem f&uuml;r uns und unsere Leser. In HTML kann man laut Standard &amp;mdash; so es vom Browser 
unterst&uuml;tzt wird darstellen &mdash; jedoch kann das nicht jeder Browser.
</p>
<p>
&Auml;hnlich ist die Situation bez&uuml;glich anderer Satzzeichen. Wenn wir m&ouml;glichst nahe am kleinsten gemeinsamen Nenner bleiben wollen, m&uuml;ssen 
wir leider Abstriche an der typographischen Qualit&auml;t unserer Texte machen.
</p>

<h3>7. Eine Frage der Zeit</h3>
<p>
Die Verwendung von Zeitformen sollte m&ouml;glichst in sich konsistent bleiben:
</p>
<p>
<b>In technischen Texten ist es die Gegenwart, die z&auml;hlt.</b>
</p>
<p>
In technischen Texten ist eine einheitliche Verwendung von Zeitformen wichtig; speziell die Gegenwartsform, denn vergangene Entwicklungen sind selten 
Gegenstand technischer Artikel. Futur ist ebenfalls nur selten notwendig, da wir ja etwas bestehendes beschreiben und nicht &uuml;ber k&uuml;nftige 
Entwicklungen spekulieren. Ganz generell: je weniger Zeitformen, desto klarer wird der Text.
</p>

<h3>8. Terminologie</h3>
<p>
Die Verwendung von technischem Fachvokabular sollte korrekt und in sich schl&uuml;ssig sein. Wenn man sich einmal f&uuml;r eine Schreibeweise  &mdash; und 
sei sie falsch &mdash; entschieden hat, so sollte man bei ihr bleiben. Richtige Schreibung ist nat&uuml;rlich besser, aber wenn, dann sollte man zu seinen 
Fehlern stehen.
</p>
<p>
Hier eine Liste korrekter Schreibweisen h&auml;ufig vorkommender (meist englischer) Fachworte:
</p>

<table width="80%" align="center">
<tr><td>Clipart</td></tr>
<tr><td>Clipboard</td></tr>
<tr><td>Desktop</td></tr>
<tr><td>drop-down (Adjektiv)</td></tr>
<tr><td>Einheiten:
<table width="80%" align="center">
<tr><td width="30%">bps</td><td>Bits pro Sekunde (baud)</td></tr>
<tr><td>GHz</td><td>Gigahertz</td></tr>
<tr><td>Hz</td><td>Hertz</td></tr>
<tr><td>KB</td><td>Kilobyte</td></tr>
<tr><td>Kb</td><td>Kilobit</td></tr>
<tr><td>Kbps</td><td>Kilobit pro Sekunde (Kbaud)</td></tr>
<tr><td>KHz</td><td>Kilohertz</td></tr>
<tr><td>MB</td><td>Megabyte</td></tr>
<tr><td>Mb</td><td>Megabit</td></tr>
<tr><td>ms</td><td>Millisekunde</td></tr></table></td></tr></table>
<table width="80%" align="center"><tr><td>Was die 'Kilo'&ndash;einheiten angeht, so sollte man sich von Anfang an festlegen ob man dezimale '1000' oder
 bin&auml;re '1000' meint. Im letzteren Fall hei&szlig;t 1000 in Dezimal umgerechnet 1024. Wenn wir auf dieser Basis weiterrechnen, weichen dezimale und
 bin&auml;re Gr&ouml;&szlig;enangaben schnell stark von einander ab. Die IEC (Norm IEC 60027-2) und andere Normenorganisationen haben zur Unterscheidung 
 vorgeschlagen, die bin&auml;re Variante entweder durch die Bezeichnung 'Kibobyte' (abgek&uuml;rzt KiB) oder durch kB (vergleiche mit Kb!) zu kennzeichen. 
 Dieser Vorschlag hat bisher wenig Anh&auml;nger gefunden.                            </td></tr></table>
<table width="80%" align="center">
<tr><td width="30%">Net</td><td>Netzwerk</td></tr>
<tr><td valign="top">.NET/.net</td><td>Die Microsoft&ndash;technologie, konsequent die eine oder die andere Schreibweise verwenden.</td></tr>
<tr><td>online/offline</td><td>Ohne Bindestrich!</td></tr>
<tr><td>PostScript</td></tr>
<tr><td>ToolTip</td></tr>
<tr><td>TrueType</td></tr>
</table>

<h3>Schlu&szlig;bemerkung</h3>
<p>
Das wars! Mit den Tips aus diesen zwei Artikeln und mit ein wenig &Uuml;bung wirst Du, geneigter Leser, eine erfolgreiche und befriedigende Karriere im 
technischen Schreiben vor Dir haben. Viel Spa&szlig; und Erfolg!
</p>

<h2>Literatur</h2>
<p>
<i>Wolf Schneider:</i> <b>Deutsch f&uuml;r Profis, Goldmann Verlag</b> - Ein absolutes Mu&szlig; f&uuml;r jeden der beruflich schreibt. Gut geschrieben, rein auf Praxis orientiert - der langj&auml;hrige Chefredakteur des 'Stern' wei&szlig; wovon er schreibt.
</p><h2>Verwandte Artikel</h2>
<p>
<a href="20020506.htm">Schreib&quot;kunst&quot; f&uuml;r Programmierer, Teil I</a><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fuebersetzungsfallen%2Ede">Anglizismen und Übersetzungsfallen</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fphysics%2Enist%2Egov%2Fcuu%2FUnits%2Fbinary%2Ehtml">Binäre Kilobyte&ndash;definition</a><br>

</p>

<h2>Wenn Sie jetzt Fragen haben...</h2>
<p>
Wenn Sie Fragen rund um die in diesem Artikel vorgestellte Technologie haben, dann schauen Sie einfach bei uns
in den <a href="http://glengamoi.com/forums/">Community Foren der deutschen .NET Community</a> vorbei. Die Teilnehmer 
helfen Ihnen gerne, wenn Sie sich zur im Artikel vorgestellten Technologie weiterbilden m&ouml;chten.
</p>

<p>
<a href="http://glengamoi.com/forums/"><img src="../images/glengamoi.com_250.gif" width="250" height="80" alt="" border="0"></a>
</p>


<p>
Haben Sie Fragen die sich direkt auf den Inhalt des Artikels beziehen, dann schreiben Sie dem Autor! Unsere Autoren
freuen sich &uuml;ber Feedback zu ihren Artikeln. Ein einfacher Klick auf die <i>Autor kontaktieren</i>
Schaltfl&auml;che (weiter unten) und schon haben Sie ein f&uuml;r diesen Artikel personalisiertes Anfrageformular.
</p>

<p>&nbsp;</p>
<p>
Und zu guter Letzt m&ouml;chten wir Sie bitten, den Artikel zu bewerten. Damit helfen Sie uns, 
die Qualit&auml;t der Artikel zu verbessern - und anderen Lesern bei der Auswahl der Artikel,
die sie lesen sollten.
</p>

<FORM METHOD="POST" STYLE="margin-bottom: 0px;" NAME="formRating" ACTION="/service/bewerten.asp">
<INPUT TYPE="HIDDEN" NAME="ArticleId" VALUE="20020701" />
<CENTER>
<TABLE BORDER="0" CELLSPACING="0" CELLPADDING="0">
<TR>
	<TD ALIGN="CENTER" VALIGN="MIDDLE" COLSPAN="7">Bewerten Sie diesen Artikel</TD>
</TR>
<TR>
	<TD><EM>&nbsp;Sehr gut&nbsp;</EM></TD>
	<TD><INPUT TYPE="radio" value="1" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="2" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="3" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="4" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="5" NAME="radioRating" /></TD>
	<TD ALIGN="right"><EM>&nbsp;Nicht gen&uuml;gend</EM></TD>
	<TD ROWSPAN="2" VALIGN="middle">&nbsp;<INPUT TYPE="submit" VALUE="Werten!" /></TD>
</TR>
<TR>
	<TD>&nbsp;</TD>
	<TD ALIGN="CENTER">&nbsp;1</TD>
	<TD ALIGN="CENTER">&nbsp;2</TD>
	<TD ALIGN="CENTER">&nbsp;3</TD>
	<TD ALIGN="CENTER">&nbsp;4</TD>
	<TD ALIGN="CENTER">&nbsp;5</TD>
	<TD>&nbsp;</TD>
</TR>
</TABLE>
</FORM>
</center>
&nbsp;<P>
<center>
<p><table><tr><td valign=top>
<form action="REMOVED" method="GET"><input type="hidden" name="pagetitle" value="Schreib"kunst" f&uuml;r Programmierer, Teil II"><input type="hidden" name="pageurl" value="http://www.aspheute.com/artikel/20020701.htm"><input type="image" src="../images/layout/senden.png" width="107" height="20" border="0" alt="Schicken Sie diese Seite einem Freund!" style="cursor='hand';"></form>
<td>&nbsp;&nbsp;</td>
<td valign=top>
<form action="REMOVED" method="GET"><input type="hidden" name="Author" value="Bernhard Spuida"><input type="hidden" name="AuthorEmail" value="bernhard@icsharpcode.net"><input type="hidden" name="Artikel" value="20020701"><input type="image" src="../images/layout/kontakt.png" width="107" height="20" border="0" alt="Kontaktieren Sie den Autor!" style="cursor='hand';"></form>
<td>&nbsp;&nbsp;</td>
<td valign=top><a href="../PrinterFriendly/20020701.htm"><img src="../images/layout/druck.png" width="118" height="20" border="0" alt="F&uuml;r Ausdruck optimierte Seite"></a></td>
</tr></table></p>
</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
