<HTML>
<HEAD>
<TITLE>Spam wirkungsvoll bek&auml;mpfen</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="7 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Spam ist die Pest des Internet. Wie kann man sie wirkungsvoll bek&auml;mpfen? Das ist die Frage die sich fast jeder Internetbenutzer und -provider stellt.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Spam,Spambekämpfung,SAproxy,Spamassassin,spam assassin,lurhq,spamdemic map,spamdemic,Rechtslage,Recht,POP3,Erkennung">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff"  BACKGROUND="../images/layout/aspheutemainbg.gif" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<MAP NAME="titlebar">
<!--<AREA SHAPE=RECT COORDS="116,46,191,61" HREF="http://www.aspaktuell.com" ALT="ASP Aktuell">-->
<!--<AREA SHAPE=RECT COORDS="192,46,255,61" HREF="http://www.aspwelt.com" ALT="ASP Welt">-->
<AREA SHAPE=RECT COORDS="256,46,432,61" HREF="http://www.aspgerman.com/aspgerman/" ALT="ASP German">
<AREA SHAPE=RECT COORDS="115,15,269,42" HREF="../default.htm" ALT="Homepage">
<AREA SHAPE=RECT COORDS="278,26,587,42" HREF="../default.htm" ALT="Homepage">
</MAP>

<div style="position:absolute;left:0px;top:30px">
<table border=0 cellspacing=0 cellpadding=0>
<tr>
<td background="../images/layout/aspheutetitle.gif">
<img src="../images/layout/blind.gif" width="715" height="73" usemap="#titlebar" border="0">
</td>
<td width="100%" background="../images/layout/aspheutetitleext.gif">
&nbsp;
</td>
<td background="../images/layout/aspheutetitleend.gif">
<img src="../images/layout/blind.gif" width="25" height="1">
</td>
</tr>
</table>
</div>

<div style="position:absolute;left:1px;top:115px">
<table width="110" border="0" cellspacing="0" cellpadding="0">
<tr><td width="110"><img src="../Images/spacer.gif" width="110" height="1" alt="" border="0"></td></tr>
<tr>
<td background="../images/layout/aspheuteheader.gif" class="header" height=16 width="110">
<p>Liste</p>
</td>
</tr>
<tr>
<td background="../images/layout/aspheuteheaderext.gif" class="header" width="110">

<p class="content">
<a href="../kategorien/dotNET%202dot0.htm">.NET 2.0 (1)</a><br>
<a href="../kategorien/dotNET%20Allgemein.htm">.NET Allgemein (16)</a><br>
<a href="../kategorien/dotNET%20Fu.htm">.NET Fu (5)</a><br>
<a href="../kategorien/ADOdotNET.htm">ADO.NET (11)</a><br>
<a href="../kategorien/Aprilscherz.htm">Aprilscherz (3)</a><br>
<a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen (44)</a><br>
<a href="../kategorien/ASP%20Tricks.htm">ASP Tricks (83)</a><br>
<a href="../kategorien/ASPdotNET.htm">ASP.NET (44)</a><br>
<a href="../kategorien/ASPIntranetdotde.htm">ASPIntranet.de (5)</a><br>
<a href="../kategorien/Csharp.htm">C# (28)</a><br>
<a href="../kategorien/Datenbank.htm">Datenbank (44)</a><br>
<a href="../kategorien/Dokumentation.htm">Dokumentation (4)</a><br>
<a href="../kategorien/IIS%206dot0.htm">IIS 6.0 (1)</a><br>
<a href="../kategorien/Komponenten.htm">Komponenten (29)</a><br>
<a href="../kategorien/Optimierung.htm">Optimierung (10)</a><br>
<a href="../kategorien/Server.htm">Server (21)</a><br>
<a href="../kategorien/Sicherheit.htm">Sicherheit (34)</a><br>
<a href="../kategorien/Tee%20Off.htm">Tee Off (6)</a><br>
<a href="../kategorien/VBdotNET.htm">VB.NET (6)</a><br>
<a href="../kategorien/WAP.htm">WAP (8)</a><br>
<a href="../kategorien/Web%20Services.htm">Web Services (11)</a><br>
<a href="../kategorien/XML.htm">XML (9)</a><br>


<br>
<a href="/syndication/rss.xml"><img src="../Images/rss_small.png" width="25" height="10" alt="RSS 2.0 - Die neuesten f&uuml;nf Artikel auf AspHeute.com" border="0"></a>

</p><!-- </p> remains -->


<br>

</td>
</tr>
<tr>
<td class="empty" width="110">
&nbsp;
</td>
</tr>
<tr>
<td background="../images/layout/aspheutesearch.gif" class="header" height=16 width="110">
<p>Suchen</p>
</td>
</tr>
<tr>
<td background="../images/layout/aspheutesearchext.gif" class="header" width="110">
<form class="content" ACTION="REMOVED" METHOD="GET">
<div>
<input class="Newsletter" type="text" size="10" name="CiRestriction">
<span class="spacer2"><br></span>
<span class="spacer4"><br></span>
<INPUT TYPE="HIDDEN" NAME="CiMaxRecordsPerPage" VALUE="10">
<INPUT TYPE="HIDDEN" NAME="CiSort" VALUE="rank[d]">
<INPUT TYPE="HIDDEN" NAME="HTMLQueryForm" VALUE="../default.htm">
<img src="../images/layout/blind.gif" width="41" height="1"><input type="image" src="../images/layout/aspheutesearchenter.gif" border="0" width="49" height="14"><br>
<span class="spacer4"><br></span>
</div>
</form>
</td>
</tr>
<tr>
<td class="empty" width="110">
&nbsp;
</td>
</tr>
<tr>
<td background="../images/layout/aspheuteheaderext.gif" class="header" width="110">
<p class="content">
<a href="/REMOVED/" title="Our most popular articles translated into English">English Articles</a><br>
<a href="/REMOVED/" title="Visit our Chinese content section">Chinese Articles</a><br>
<a href="../autoren/UnsereAutoren.htm" title="Unsere Autoren">Unsere Autoren</a><br>
&nbsp;<br>
<a href="/REMOVED/link2us.asp" title="Setzen Sie einen Link zu AspHeute!">Link zu AspHeute</a><br>
<a href="/REMOVED/impressum.asp" title="Das Impressum von AspHeute">Impressum</a><br>
<a href="/REMOVED/advertise.asp" title="Werben auch Sie auf AspHeute">Werben</a><br>
<a href="/REMOVED/kontakt.asp" title="Teilen Sie uns Ihre W&uuml;nsche, Beschwerden und Anregungen mit">Anfragen</a><br>
</p>
</td>
</tr>
</table>
</div>



<!-- Content starts here  -->
<div style="position:absolute;left:120px;top:108px">
<table cellspacing="0" cellpadding="0"><!--Tabelle aussen-->
<tr><!--Tabelle aussen, 1/2-->
<td><!--Tabelle aussen, 1/1-->
    <table border=0 align=center><tr><td align=center>


</td></tr></table>

<H1>Spam wirkungsvoll bek&auml;mpfen</H1>
<p>
Geschrieben von: <a href="../autoren/bernhardspuida.htm">Bernhard Spuida</a><br>
Kategorie: <a href="../kategorien/Sicherheit.htm">Sicherheit</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20030901"></SCRIPT>
</p>
<p>
Spam ist die Pest des Internet. Wie kann man sie wirkungsvoll bek&auml;mpfen? Das ist
die Frage die sich fast jeder Internetbenutzer und -provider stellt.
</p>
<p>
Email ist heutzutage eines der wichtigsten Kommunikationsmedien. Sie ist schnell und
kosteng&uuml;nstig. Leider trifft dies auch f&uuml;r die Versendung unerw&uuml;nschter Emails zu.
In den letzten Jahren hat die Anzahl der unerw&uuml;nschten kommerziellen Emails (<i>UCE
= Unsolicited Commercial Email</i> oder <i>UBE = Unsolicited Bulk Email</i>)- auch <b>Spam</b>
genannt - Ausma&szlig;e angenommen, die Email als Kommunikationsmedium inzwischen ernsthaft
gef&auml;hrden und die auch f&uuml;r die ISPs &uuml;ber deren Server diese Emails geleitet werden
ein ernsthaftes &ouml;konomisches und technisches Problem darstellen. 
</p>
<p>
In diesem Artikel besch&auml;ftigen wir uns mit dieser Problematik und den L&ouml;sungsans&auml;tzen
die in der Praxis angewandt werden sowie mit eventuellen zuk&uuml;nftigen Entwicklungen.
</p>
<p>
Es wird keine bestimmte Plattform vorausgesetzt um die Inhalte dieses Artikels
verwenden zu k&ouml;nnen.
</p>

<h2>Spam - das Monster in der Inbox</h2>
<p>
Vor wenigen Jahren war das Versenden von Werbung und anderen unerw&uuml;nschten Inhalten
per Email noch eine Kuriosit&auml;t - eine in Dutzenden wenn nicht Hunderten von Emails
warb f&uuml;r Kredite, dubiose Pillen oder biologisch ausgefallene Websites. Heute ist
das leider deutlich anders. Laut Kaspersky Messagelabs, Brightmail und anderen
Email-Filterdiensten ist die Anzahl der Spams inzwischen bei mehr als 50% der
eingehenden Nachrichten angelangt. Der asiatische Emailprovider Outblaze berichtet
sogar von mehr als 80% Spam im Eingang. Mein pers&ouml;nlicher Rekord (auf einer meiner
'Spamfallen') war 3 erw&uuml;nschte Mails unter 217 eingegangenen in einer Woche. Was
diese Mengen an unerw&uuml;nschtem Netzwerkverkehr f&uuml;r die Bandbreite bei Providern
Kunden bedeutet ist klar - der einzige der hier so gut wie nichts zahlt ist der
Versender.
</p>
<p>
Leider ist Spam f&uuml;r den Versender effektiv. Eine beispielhafte Kalkulation eines
Spamanbieters folgt:
</p>

<pre background='silver'>
FROM: stacy911@pop.net
Message-ID: &lt;1wRiY5hFB5&gt;
SUBJECT: Its me stacy look @ this
X-PMFLAGS: 33554560 0 1 P5B780.CNM

We will put your product or service instantly into the hands of millions!

Since 1996, Bulk Email Network has provided bulk email marketing
to thousands of well-satisfied customers. We offer the most competitive 
prices in the industry, made possible by our high percentage of repeat 
business. We have the most advanced direct email technology employed by 
only a knowledgeable few in the world.

We have over 160 million active email addresses All sorted by
country, state, city and target.

Call us for a free consultation at 323 876 6148  [U.S.A.].

We guarantee the lowest prices or your service is free!

 1) Let's say you... Sell a $24.95 PRODUCT or SERVICE.
 2) Let's say you... Mass Email to 1,000,000 PEOPLE DAILY.
 3) Let's say you... Receive JUST 1 ORDER for EVERY 2,500 EMAILS.

 CALCULATION OF YOUR EARNINGS BASED ON THE ABOVE STATISTICS:
 [Day 1]: $9,980  [Week 1]: $69,860  [Month 1]: $279,440

Now you know why you receive so many email advertisements...

Best of ALL, Bulk Email Network can be used as a 100% TAX
WRITE OFF for your Business!

===============================================================
"Many business people are finding out that they can now advertise in
ways that they never could have afforded in the past.  The cost of sending mass e-
mail is extremely low, and the response rate is high and quick." - USA TODAY
===============================================================

Remember we also offer:

*Bulletproof Web Hosting
And
*Bulletproof Dial-up Account

Best Regards,

Jennifer O&rsquo;Conner,
Bulk Email Network
Marketing Dept.

Phone:1 (323) 876 6148 [U.S.A.]

To be Opt-out Please email: optout88542@aol.com with the email
address that you would like removed.
</pre>

<p>
Diese Kalkulation stammt aus dem Jahr 2001, inzwischen hat sich gezeigt da&szlig;
Antwortquoten von 1 in 6000 oder geringer noch wirtschaftlich f&uuml;r den Spammer sind
- wenn der Spammer t&auml;glich 20 Millionen (!) Emails verschickt, brummt das Gesch&auml;ft...
</p>
<p>
Die Email-Adressen und Telephonnummern in dieser Email sind &uuml;brigens nat&uuml;rlich
schon lange nicht mehr g&uuml;ltig.
</p>
<p>
Wir k&ouml;nnen hier auch einige typische Spammerkmale feststellen, die wir sp&auml;ter
noch n&auml;her besprechen werden. Frage an den Leser: welche sind dies?
</p>
<p>
Die Firmen die in Spams beworben werden versenden diese Emails nat&uuml;rlich nicht
selbst, sondern &uuml;berlassen dies Dienstleistern. Eine Karte die wirtschaftliche
Beziehungen in einem kleinen Teil dieses Netzwerkes darstellt findet sich bei
<a href="http://www.cluelessmailers.org/spamdemic/index.html" target="_blank">Clueless Mailers</a>:
</p>

<IMG SRC="Bilder/200309/20030901.gif" height="250" width="382" />

<p>
Die Hydra der griechischen Sage scheint vergleichsweise harmlos.
</p>

<h2>Spam-Anatomie</h2>
<p>
Gl&uuml;cklicherweise k&ouml;nnen wir in Spam immer wiederkehrende Merkmale finden, die
wir dann zur Erkennung/Bek&auml;mpfung mittels Filtern heranziehen k&ouml;nnen:
</p>

<ul>
<li>Gef&auml;lschte Absenderadressen
<li>Adressen oder Betreffzeilen mit langen Ziffernketten oder sinnlosen Buchstabenkombinationen xcdfgew9217
<li>Gro&szlig;e Empf&auml;ngerlisten
<li>Verf&auml;lschte R.e.c.h.t.s.$.C.h r'eibung
<li>Text ausschlie&szlig;lich aus GROSSBUCHSTABEN
<li>Exzessives HTML
<li>Javascript
<li>Webbugs
<li>'Opt-out' URLs: Click here if you do not want to receive further emails
</ul>

<p>
Es gibt nat&uuml;rlich noch wesentlich mehr Kriterien. So lie&szlig;en sich zum Beispiel
Schl&uuml;sselwortlisten anlegen die typische Worte/Wortkombinationen wie 'Teens live',
'Casino', 'Buy cheap Viagra now' usw. enthalten. Dieser Ansatz ist allerdings
problematisch da jeder
Emailbenutzer andere pers&ouml;nliche Kriterien hat - ein Einsatz providerseitig ist
also nicht praktikabel, alleine schon durch die Verschleierungsm&ouml;glichkeit mit
der oben angef&uuml;hrten Verf&auml;lschung der Rechtschreibung.
</p>
<p>
Betrachten wir nun ein konkretes Beispiel, Spammerkmale sind hervorgehoben:
</p>

<pre>
Return-Path: &lt;mauro385@inmail.xxx&gt;
X-Flags: 0000
Delivered-To: XYZ delivery to bspuida@xyz.net
Received: (qmail 1296 invoked by uid 65534); 13 Jun 2003 22:57:44 -0000
Received: from <b>unknown (HELO 213.165.64.100) (218.0.211.120)</b>
  by mx0.xyz.net (mx003) with SMTP; 14 Jun 2003 00:57:44 +0200
Received: from dzrre.g1rt3a.org [41.75.202.173] by 213.165.64.100 with SMTP; Sat, 14 Jun 2003 17:02:45 +0100
Message-ID: &lt;71w4y276$50z-53x$x$6$e4n@b9d8fj.x83o&gt;
From:<b> "Sharlene Barnard" &lt;mauro385@inmail.sk&gt;</b>
To: <b>&lt;kai.loehner@xyz.net&gt;, &lt;gewuerzgurke@xyz.net&gt;, &lt;bspuida@xyz.net&gt;, &lt;elfchild@xyz.net&gt;</b>
Subject: <b>Ebay is the best vrulbpcyqqdeokz</b>
Date: Sat, 14 Jun 03 17:02:45 GMT
X-Mailer: Microsoft Outlook Express 6.00.2462.0000
MIME-Version: 1.0
Content-Type: multipart/alternative;
	boundary="A0_8DA03FA368.C3B_"
X-Priority: 3
X-MSMail-Priority: Normal

This is a multi-part message in MIME format.

--A0_8DA03FA368.C3B_
Content-Type: text/plain;
Content-Transfer-Encoding: quoted-printable

<b>hi, Kai.loehner</b>
Ebay and You: Are you making money? If not, then you need to attend our

free online conference where we will teach you the ebay ropes and show 
you how to cut the middleman out of your product buying line. Visit our

website at
<b>http://www.foryou-ontheweb.com/xxx/xxx/</b>

and sign up for the conference. You even get about 317.00 worth of ebay 
tools at no charge to you just for attending the free conference.
<b>Remove is at the website.

thanks,,,,Sharlene Barnard

Ebay is the best vrulbpcyqqdeokz
Ebay is the best vrulbpcyqqdeokz
fourteen
gwdbeqydv
vmq    naozqdfyahs  gpgy
wqeestyskiqeoz
 fuqvm w aoa tr  sfpnbivnu kkr ke xy
 e yu
l mq
e x
v</b>

--A0_8DA03FA368.C3B_--
</pre>

<p>
Wie man diese Merkmale nun filtert wird ein wesentlicher Gegenstand im weiteren
Verlauf des Artikels sein. Bevor wir uns nun der Bek&auml;mpfung von Spam widmen, m&ouml;chte
ich noch kurz die Aufmerksamkeit auf die Emailheader der obigen Nachricht lenken -
wie es sich f&uuml;r Spam geh&ouml;rt ist da viel gef&auml;lscht. Besonders die HELO-Zeile verdient
Aufmerksamkeit.
</p>

<h2>Was tun?</h2>
<p>
Nachdem wir jetzt den Feind zumindest gesehen haben k&ouml;nnen wir uns Gedanken &uuml;ber die
Bek&auml;mpfung machen. Es gibt drei Fronten an denen wir in diesem Kampf ansetzen k&ouml;nnen:
</p>

<ul>
<li>Die Inbox
<li>Der Server
<li>Recht und Marktwirtschaft
</ul>

<p>
Wir werden uns im folgenden mit allen dreien auseinandersetzen, da ein Ansatz alleine
nicht gen&uuml;gt.
</p>

<h3>Die Inbox</h3> 
<p>
Ziel jeder Spamnachricht ist es in die Inbox zu gelangen, diese mu&szlig; also unbedingt
gesch&uuml;tzt werden. Dies k&ouml;nnen wir mit folgenden Methoden erreichen:
</p>

<ul>
<li>Die Emailadresse nicht &ouml;ffentlich machen oder zumindest verschleiern</li>
<li>Niemals auf die 'Opt-out'-Links klicken</li>
<li>Nie Spam beantworten</li>
<li>HTML-Mails als Plaintext &ouml;ffnen, keine HTML-Vorschau verwenden</li>
<li>Die Filter des Email-Clients aktivieren so vorhanden</li>
<li>Einen POP3-Filterproxy vorschalten</li>
<li>Antivirensoftware und Firewall stets aktuell halten</li>
</ul>

<p>
Das h&ouml;rt sich im gro&szlig;en und ganzen alles nach gesundem Menschenverstand an,
wird aber leider viel zu wenig praktiziert. Wichtig an den ersten drei Punkten ist
die Existentz einer g&uuml;ltigen Emailadresse niemals bekannt zu geben. Wenn man in
irgendeiner Form auf Spam reagiert, bekommt man noch mehr; die Adresse 'lebt' ja...
</p>
<p>
HTML-Mails k&ouml;nnen nicht nur Webbugs (unsichtbare Grafiken zur Verfolgung einer
Adresse) enthalten, sie k&ouml;nnen auch &uuml;ber eingebettete Skripte unliebsame Inhalte
nachladen.
</p>
<p>
Filterung erkl&auml;rt sich witgehend von selbst, vorgeschaltete Proxies sind meist
wesentlich leistungsf&auml;higer als die Filter der Emailclients. Ein besonders
empfehlenswerter POP3-Proxyfilter ist <i>SAProxy</i> der frei verf&uuml;gbar ist. Er
l&auml;sst sich jedem beliebigen Email-Client vorschalten und kann mit unerkannten Spams
trainiert werden soda&szlig; er immer besser auf die W&uuml;nsche des Benutzers reagiert.
SAProxy kann auch f&uuml;r mehrere POP3-Accounts von einer Maschine aus verwendet werden.
Das Programm basiert auf dem <i>Spam Assassin</i>, der auch serverseitig zum Einsatz
kommen kann. Die Arbeitsweise werden wir weiter unten besprechen.
</p>
<p>
Derartige Proxyfilter &auml;ndern meist die Mailheader und/oder Betreffzeile, soda&szlig;
man mit einer einfachen Filterregel im Mailclient die Spams erkennen und entsorgen
kann:
</p>

<pre>
SPAM: -------------------- Start SpamAssassin results ----------------------
SPAM: This mail is probably spam.  The original message has been altered
SPAM: so you can recognise or block similar unwanted mail in future.
SPAM: See http://spamassassin.org/tag/ for more details.
SPAM: 
SPAM: Content analysis details:   (6.00 hits, 5 required)
SPAM: NO_REAL_NAME       (1.3 points)  From: does not include a real name
SPAM: X_PRIORITY_HIGH    (0.4 points)  Sent with 'X-Priority' set to high
SPAM: EXCUSE_16          (0.1 points)  BODY: I wonder how many emails they sent in error...
SPAM: SPAM_PHRASE_08_13  (1.4 points)  BODY: Spam phrases score is 08 to 13 (medium)
SPAM:                    [score: 10]
SPAM: HTML_FONT_COLOR_CYAN (0.4 points)  BODY: HTML font color is cyan
SPAM: BIG_FONT           (0.3 points)  BODY: FONT Size +2 and up or 3 and up
SPAM: HTML_FONT_COLOR_RED (0.3 points)  BODY: HTML font color is red
SPAM: HTML_FONT_COLOR_UNSAFE (0.3 points)  BODY: HTML font color not within safe 6x6x6 palette
SPAM: MAILTO_LINK        (0.2 points)  BODY: Includes a URL link to send an email
SPAM: MIME_LONG_LINE_QP  (0.3 points)  RAW: Quoted-printable line longer than 76 characters
SPAM: PRIORITY_NO_NAME   (1.0 points)  Message has priority setting, but no X-Mailer
SPAM: 
SPAM: -------------------- End of SpamAssassin results ---------------------
</pre>

<p>
Dieses Beispiel stammt von SAProxy, der mehr als 300 (!) Tests auf die Emails anwendet.
Derartige Filterregeln selbst im Email-Client zu implementieren ist nahezu unm&ouml;glich.
Die Bewertungsschwelle kann der Benutzer selbst einstellen, hier ist sie beim
Standardwert von 5 gesetzt. Ebenso l&auml;&szlig;t sich die Gewichtung der einzelnen Regeln
an individuelle Vorlieben anpassen. 
</p>
<p>
Was Antivirensoftware und Firewalls angeht, so mag das vielleicht auf den ersten
Blick in Zusammenhang mit Emails &uuml;berraschen, aber die Erfahrungen der letzten
Zeit zeigen leider da&szlig; mitunter &uuml;ber Viren Trojaner eingeschleppt werden, die PCs
als Spamverteiler &uuml;bernehmen. Details zu einem solchen Programm finden sich bei 
<a href="http://www.lurhq.com/migmaf.html" target="_blank">lurhq</a>. Nicht vergessen - der User
dem die gekaperte Maschine geh&ouml;rt zahlt die Bandbreite f&uuml;r den Spammer!
</p>

<h3>Der Server</h3>
<p>
Die PCs der User zu sch&uuml;tzen ist immer der letzte Schritt im Kampf gegen Spam,
besser ist es den Server zu sch&uuml;tzen,
da so die &uuml;bertragenen Datenmengen minimiert werden. Ebenso ist die Verhinderung
der Annahme von Spam durch den Server g&uuml;nstig f&uuml;r die Serverlast - Spammer versenden
von einer einzelnen IP-Adresse aus bis zu 20000 Emails pro Minute. Meist verwenden
sie allerdings mehrere IP-Adressen parallel...
</p>
<p>
Au&szlig;erdem wird Spamschutz immer h&auml;ufiger als Pluspunkt in der Kundenwerbung der
Provider verwendet - ein nicht unwichtiges Argument f&uuml;r den Aufbau eines
zuverl&auml;ssigen Schutzes der Emailserver.
</p>
<p>
Serverseitiger Spamschutz l&auml;&szlig;t sich mit folgenden Methoden realisieren:
</p>

<ul>
<li>Offenes Relaying stoppen</li>
<li>HELO kontrollieren</li>
<li>Timing der eingehenden Emails kontrollieren</li>
<li>Teergruben</li>
<li>Mailfilter</li>
<li>Blacklisting / Whitelisting</li>
<li>Challenge/Response</li>
</ul>

<p>
Offene Relays waren fr&uuml;her eine der Hauptquellen f&uuml;r Spam - jedes beliebige Email
wird in diesem Fall weitergeleitet, egal ob es von einem Rechner der Domain stammt
oder nicht. Inzwischen sind die meisten Mailserver per Voreinstellung nicht mehr
als Open Relays konfiguriert, man sollte jedoch vorsichtshalber alle Server daraufhin
untersuchen.
</p>
<p>
Emails werden immer per SMTP-Protokoll angeliefert. Der Datenaustausch vor der
eigentlichen Annahme erfolgt nach RFC 2554, dabei wird mit HELO bzw. EHLO die
Identit&auml;t der Gegenseite festgestellt. Die IP-Adresse des einliefernden Rechners
wird von ihm angegeben und vom Mailserver ebenfalls aus den TCP-Paketen ausgelesen.
Sollten diese beiden Adressen nicht &uuml;bereinstimmen - wie in der obigen Email - ist
die Spamwahrscheinlichkeit sehr hoch. Ein Vergleich dieser beiden Adressen wird
allerdings meist unterlassen, ist aber dringend zu empfehlen. Nach meinen
Erfahrungen l&auml;sst sich alleine durch diese Ma&szlig;nahme ein gro&szlig;er Teil (&gt;60%) 
der eingehenden
Spams blockieren. Weitergehende Ma&szlig;nahmen wie eine Aufl&ouml;sung der Domain aus der
angegebenen IP-Adresse und anschlie&szlig;ender Vergleich mit der Absenderdomain im
Mailheader sind zwar hilfreich, brauchen aber relativ viel Ressourcen und Bandbreite.
Au&szlig;erdem mu&szlig; daf&uuml;r die Email angenommen werden, und das wollen wir ja mit dieser
Technik vermeiden. 
</p>
<p>
Eine Weiterentwicklung des obigen Ansatzes sind sogenannte 'Teergruben'. In
diesem Fall wird die Email angenommen, aber mit dem Eintreffen weiterer Emails von
derselben Adresse innerhalb des kritischen Zeitfensters der entsprechende
Netzwerkverkehr serverseitig k&uuml;nstlich verlangsamt. Normalerweise weicht der Spammer
bei einer Blockade seiner Emails auf einen anderen Server aus - hier wird er nicht
blockiert, aber seine Ressourcen sind durch den langsamen Verkehr solange gebunden
bis er von sich aus aufgibt. Der (*nix-)Mailserver Postfix zum Beispiel stellt
dieses Verfahren als Option zur Verf&uuml;gung.
</p>
<p>
Wie bereits erw&auml;hnt, werden Spams h&auml;ufig in gro&szlig;en Mengen in kurzen Zeitr&auml;umen
abgesetzt. Daher ist das Timing der Emails ein gutes Kriterium zur Erkennung von
Spam - wohl kaum ein normaler User wird 20000 Emails in einer Minute absetzen.
Wird ein derartiges Verhalten festgestellt, sollte die entsprechende IP-Adresse
zumindest f&uuml;r eine begrenzte Zeit gesperrt werden. Permanentes Sperren kann
problematisch sein, da IP-Adressen h&auml;ufig dynamisch vergeben werden.
</p>
<p>
Auch wenn die obigen Ma&szlig;nahmen eine deutliche Verminderung der eintreffenden
Spams bewirken, kommen immer noch mehr als genug durch. Man kann also auf Filter
nicht verzichten. Filter k&ouml;nnen nach mehreren Prinzipien funktionieren:
</p>

<ul>
<li>Header-Analyse</li>
<li>Schl&uuml;sselwortlisten</li>
<li>Struktur des Textes</li>
<li>Statistische Filter</li>
</ul>

<p>
Die Analyse der Header einer Email ist h&auml;ufig ein starkes Kriterium zur Erkennung
von Spam. Wenn z.B. die 'Received:' Header in sich nicht stimmig sind, ist nur
in den seltensten F&auml;llen eine Fehlkonfiguration eines 'legalen' Mailservers gegeben.
Fehlende X-mailer Header sind ebenso ein verbreitetes Spammerkmal wie erh&ouml;hte
Sendepriorit&auml;ten.
</p>
<p>
Schl&uuml;sselwortlisten sind einer der &auml;ltesten Ans&auml;tze zur Erkennung von Spam. Daher
sind sie auch meist nicht sonderlich wirksam - die oben besprochene verf&auml;lschte
Rechtschreibung dient dazu eben diese Listen zu umgehen. Weitere Ans&auml;tze zur Umgehung
derartiger Listen ist die Aufteilung der Worte in HTML-Mails in Tabellen mit Spalten
die jeweils nur einen oder zwei Buchstaben enthalten:
</p>

<pre>
|SP|a|m| |
|f|I|lt|er|
</pre>

<p>
Die HTML-Tags zerreissen den Text, soda&szlig; er nicht mehr mit den Listen abgeglichen
werden kann. Ein weiteres Problem ist da&szlig; die Schl&uuml;sselwortlisten sehr allgemein
gehalten werden m&uuml;ssten um m&ouml;glichst wenig in die Bed&uuml;rfnisse der Benutzer einzugreifen
und falschen Alarm zu vermeiden.
</p>
<p>
Daraus folgt andererseits da&szlig; Spams h&auml;ufig &uuml;ber typische Strukturen verf&uuml;gen, die
als Erkennungskriterien dienen k&ouml;nnen - die oben angef&uuml;hrte Tabellenstruktur ist
eine davon, Pseudo-HTML (etwas das wie ein Tag aussieht, aber nicht g&uuml;ltiges HTML
darstellt) w&auml;re eine andere. Ebenso sind exzessive Schriftgr&ouml;ssen, fehlende Textversionen
der Email oder ausschlie&szlig;liche Verwendung von Gro&szlig;buchstaben, &uuml;bertriebener
Einsatz von Ausrufungszeichen (Gratis!!!) oder Base64-Kodierung der Nachricht 
typisch f&uuml;r Spam.
</p>
<p>
Der andauernde Krieg zwischen Spammern und Opfern f&uuml;hrt dazu da&szlig; nat&uuml;rlich immer
f&uuml;r jede erkannte und blockierte Technik Ersatz entsteht. Au&szlig;erdem verbreiten sich
HTML-Mails immer mehr im Bereich erw&uuml;nschter Emails, da z.B. Webmailer h&auml;ufig 
ausschlie&szlig;lich HTML-Mails versenden. Die Filter m&uuml;ssen also idealerweise lernf&auml;hig
sein. Dies l&auml;&szlig;t sich mittels sogenannter <i>Bayes-Filter</i> erreichen. Diese
Technik wurde erstmals vor 2 Jahren von Paul Graham in seiner Ver&ouml;ffentlichung 'A
Plan for Spam' diskutiert. Kurz gesagt wird dem Programm ein Korpus aus erw&uuml;nschten
und ein Korpus aus unerw&uuml;nschten Emails vorgesetzt. Das Programm berechnet f&uuml;r beide
die Wahrscheinlichkeit f&uuml;r bestimmte Worte und Strukturen und berechnet aus diesen
H&auml;ufigkeiten f&uuml;r die eingehenden Emails einen Wert der aussagt ob die Email in Ordnung
ist oder nicht. Werden Spams nicht als solche erkannt, legt man sie dem Programm zur
Analyse vor.
</p>
<p>
Ein weiterer Ansatz ist eine Annahmesperre bekannter Spammer-Adressen und Spam-Server.
Die Pflege derartiger Listen ist allerdings aufwendig. Daher gibt es diverse online verf&uuml;gbare 
Listen die direkt von Mailfiltern aus abgefragt werden k&ouml;nnen. Die Verwendung derartiger
Sperrlisten birgt allerdings Risiken: manche Listen wie z.B. SPEWS sperren pauschal ganze
Providersubnetze wenn aus diesem Subnetz Spams eingingen (zeitweise wurde ein Drittel des
Adressraums von T-Online durch SPEWS blockiert - wegen 8 (in Worten: acht) abgefangenen
Spams aus diesem Adressraum). K&uuml;rzlich ging die Blacklist von Osirusoft
offline, da sie durch Denial of Service-Attacken blockiert wurde. Offline hie&szlig;
in diesem speziellen Fall zuerst da&szlig; die Blockliste ohne Vorwarnung an die Benutzer 
durch eine Wildcard (*) auf <b>alle</b> Adressen ersetzt wurde. Zum Zeitpunkt des
Schreibens dieses Artikels waren beide Sites nicht erreichbar, Osirusoft scheint
definitiv nicht mehr zu existieren. Die Verwendung von Blacklists ist also problematisch.
Whitelists k&ouml;nnen eine Alternative darstellen, doch m&uuml;ssen sie auf einer Per-User-Basis
erstellt werden, sind also sehr aufwendig in der Pflege.
</p>
<p>
Um die 'Erw&uuml;nschtheit' einer Email festzustellen werden mitunter 
'Challenge/Response'-Verfahren eingesetzt. D.h. eingehende Emails von unbekannten
Absendern werden direkt durch den Server mit einer Aufforderung zu einer Antwort
beantwortet. Erfolgt keine Antwort, so wird die urspr&uuml;ngliche Email als Spam behandelt
und die Absenderadresse auf eine Blacklist gesetzt. Ansonsten wird die Absenderadresse
in eine Whitelist des Empf&auml;ngers eingef&uuml;gt. Dieses Verfahren hat allerdings zwei
Nachteile: Mailinglisten und automatisierte Verteiler werden automatisch blockiert,
f&uuml;r jede unbekannte Email im Eingang werden zumindest zwei weitere Emails erzeugt.
</p>
<p>
Ein guter Spamfilter kombiniert diese Ans&auml;tze um m&ouml;glichst hohe Spam-Erkennungsraten
bei gleichzeitig m&ouml;glichst wenigen Fehlalarmen zu erzielen. Der wohl bekannteste
derartige Filter ist <i>Spam Assassin</i>, der plattformunabh&auml;ngig arbeitet und sowohl
server- als auch clientseitig eingesetzt werden kann. Spam Assassin ist Open Source
und ben&ouml;tigt lediglich eine Perl-Installation. Alle diskutierten Methoden au&szlig;er
Challenge/Response k&ouml;nnen
eingesetzt werden - C/R sollte falls gew&uuml;nscht &uuml;ber den Mailserver realisiert werden. 
Gro&szlig;e Email-Provider wie GMX setzen
diesen Filter produktiv ein, er ist also als ausgereift zu betrachten. N&auml;here
Informationen &uuml;ber die eingesetzten Filtertechniken und Regeln finden sich auf der
Homepage des Projektes. Die URL dazu befindet sich im oben angef&uuml;hrten Beispiel.
</p>
<p>
Inzwischen gibt es Unmengen an Filtern die eingesetzt werden k&ouml;nnen, eine &Uuml;bersicht
ist daher nicht mehr m&ouml;glich. Der Spam Assassin bietet sich aber f&uuml;r erste Experimente
wie f&uuml;r den produktiven Einsatz an, da er frei verf&uuml;gbar ist.
</p>

<h3>Recht und Marktwirtschaft</h3>
<p>
Die Probleme die durch die &Uuml;berflutung von Email als Kommunikationsform hervorgerufen
werden sind sowohl dem Gesetzgeber als auch der Wirtschaft bewusst. Es gibt verschiedenste
Ans&auml;tze von dieser Seite aus das Problem wenn schon nicht zu l&ouml;sen so doch zumindest
zu minimieren.
</p>
<p>
Die L&ouml;sungsvorschl&auml;ge auf Gesetzesbasis reichen von Kennzeichnung im Betreff (z.B.
durch Voranstellen des K&uuml;rzels 'ADV:') bis zum pauschalen Verbot unaufgefordert
zugesandter Emails.
</p>
<p>
Das erste wichtige Problem bei gesetzgeberischen L&ouml;sungsans&auml;tzen ist nat&uuml;rlich
eine sinnvolle Definition des Begriffes Spam. In einem Gerichtsurteil vor kurzem
wurde eine Unterlassungserkl&auml;rung bewirkt um zu verhindern da&szlig; ein Mailinglistenbetreiber
von potentiellen Abonnenten Anmeldebest&auml;tigungen erhalten kann - die Mail mit der
Aufforderung die Anmeldung
zu best&auml;tigen  sei ja unaufgefordert zugesandt worden, mithin Spam... Andererseits
soll ja durch 'Opt-in'-Verfahren mit genau diesem Ansatz Spam verhindert werden.
Kurz - effektive gesetzgeberische Initiativen sind fast unm&ouml;glich solange weder die
Grundbegriffe klar sind, noch ein Ziel zu sehen ist oder technisches Grundverst&auml;ndnis
bei den zust&auml;ndigen Gremien vorhanden ist.
</p>
<p>
Das zweite wichtige - und noch gravierendere - Problem ist das der Zust&auml;ndigkeit.
Wenn mich Spam f&uuml;r ein amerikanisches Produkt erreicht der von einem chinesischen
Account aus &uuml;ber einen gehackten Server in den Niederlanden auf meiner deutschen
Email-Adresse (Server in Berlin, ich in Bayern) erreicht, in wessen Zust&auml;ndigkeit
f&auml;llt die Verfolgung? Auch wenn es inzwischen einiges an relevanter Gesetzgebung
weltweit gibt, so ist immer noch unklar welche in einem konkreten Fall anzuwenden
ist. Das Internet kann also diesbez&uuml;glich de facto als rechtsfreier Raum angesehen
werden.
</p>
<p>
Ans&auml;tze auf wirtschaftlicher Basis scheinen da vielversprechender zu sein,
schlie&szlig;lich geht es ja darum mittels Spam mit m&ouml;glichst wenig Einsatz Geld zu
verdienen. Es liegt also nahe, da&szlig; die Kosten f&uuml;r Spamversand steigen m&uuml;ssen bzw.
die Effektivit&auml;t von Spam minimiert wird.
</p>
<p>
Die oben diskutierten serverseitigen Ma&szlig;nahmen k&ouml;nnen sicher zu einer Steigerung
der Kosten f&uuml;r den Spammer beitragen - er mu&szlig; bei effizienter Blockade wesentlich
mehr - und komplizierter aufgebaute - Nachrichten versenden um potentielle Kunden
zu erreichen. Dies gilt nat&uuml;rlich auch f&uuml;r benutzerseitige Ma&szlig;nahmen. Je mehr Filterstufen
im Transportweg der Email liegen, desto geringer wird die Wahrscheinlichkeit f&uuml;r
eine erfolgreiche Auslieferung. Es steht allerdings zu bef&uuml;rchten da&szlig; sich Denial
of Service Attacken auf Spambek&auml;mfungsdienste und Provider mehren k&ouml;nnten um so
'Freie Fahrt' f&uuml;r Spam zu erzwingen.
</p>
<p>
Ein weiterer wichtiger Ansatzpunkt ist die &Auml;chtung von Providern die mit Spammern
sogenannte 'Pink Contracts' abschlie&szlig;en, Zugangsvertr&auml;ge die die Antispamklauseln
in den AGBs des Providers ausklammern und den Spammer nat&uuml;rlich entsprechend mehr als
ein gew&ouml;hnlicher Zugang kosten. Derartige Vertr&auml;ge werden zwar gew&ouml;hnlich schnell
gek&uuml;ndigt sobald Beschwerden beim Provider eintrudeln, doch sollte durch Fachverb&auml;nde
und andere Provider Druck ausge&uuml;bt werden um diese Vertr&auml;ge m&ouml;glichst zu verhindern.
</p>
<p>
Ebenso sollte den Kunden die Spam als Werbema&szlig;nahme buchen klar gemacht werden
da&szlig; sie auf diese Art und Weise nur negative Einstellung zu ihrem beworbenen Produkt
erzeugen. Manche Firmen sind sich nicht bewu&szlig;t da&szlig; ihre Werbung per Email Spam
darstellt, bei einem entsprechenden (freundlichen!) Anschreiben wird diese Werbung
meist eingestellt. Leider gilt dies meist nicht f&uuml;r Anbieter eher zweifelhafter
Produkte.
</p>  

<h2>Schlu&szlig;bemerkung</h2>
<p>
Es gibt keine einfache L&ouml;sung f&uuml;r dieses Problem - Spam kann nur durch konsequenten
Einsatz m&ouml;glichst vielseitiger Ma&szlig;nahmen bek&auml;mpft werden. Auch wenn der Kampf
aussichtslos erscheint - nicht aufgeben! Gemeinsam kriegen wir die schon klein. 
</p><h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epaulgraham%2Ecom%2Fspam%2Ehtml">'A Plan for Spam' und weitere Artikel zum Thema</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ecluelessmailers%2Eorg%2Fspamdemic%2Findex%2Ehtml">Clueless Mailers (Spamdemic Map)</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Eunileoben%2Eac%2Eat%2F%7Elucs%2FTopLinks%2Fmonth1102%2Ehtml">Diverses zum Thema 'Spam'</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Esalon%2Ecom%2Ftech%2Ffeature%2F2003%2F03%2F27%2Fspam%5Ffighter%2Findex%2Ehtml">Ein Bericht von der 'Front'</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Elurhq%2Ecom%2Fmigmaf%2Ehtml">lurhq</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Erfc%2Deditor%2Eorg%2Frfc%2Frfc2554%2Etxt">RFC 2554</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fsaproxy%2Ebloomba%2Ecom%2F">SAProxy</a><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Espamassassin%2Eorg%2Findex%2Ehtml">Spam Assassin</a><br>

</p>

<h2>Wenn Sie jetzt Fragen haben...</h2>
<p>
Wenn Sie Fragen rund um die in diesem Artikel vorgestellte Technologie haben, dann schauen Sie einfach bei uns
in den <a href="http://glengamoi.com/forums/">Community Foren der deutschen .NET Community</a> vorbei. Die Teilnehmer 
helfen Ihnen gerne, wenn Sie sich zur im Artikel vorgestellten Technologie weiterbilden m&ouml;chten.
</p>

<p>
<a href="http://glengamoi.com/forums/"><img src="../images/glengamoi.com_250.gif" width="250" height="80" alt="" border="0"></a>
</p>


<p>
Haben Sie Fragen die sich direkt auf den Inhalt des Artikels beziehen, dann schreiben Sie dem Autor! Unsere Autoren
freuen sich &uuml;ber Feedback zu ihren Artikeln. Ein einfacher Klick auf die <i>Autor kontaktieren</i>
Schaltfl&auml;che (weiter unten) und schon haben Sie ein f&uuml;r diesen Artikel personalisiertes Anfrageformular.
</p>

<p>&nbsp;</p>
<p>
Und zu guter Letzt m&ouml;chten wir Sie bitten, den Artikel zu bewerten. Damit helfen Sie uns, 
die Qualit&auml;t der Artikel zu verbessern - und anderen Lesern bei der Auswahl der Artikel,
die sie lesen sollten.
</p>

<FORM METHOD="POST" STYLE="margin-bottom: 0px;" NAME="formRating" ACTION="/service/bewerten.asp">
<INPUT TYPE="HIDDEN" NAME="ArticleId" VALUE="20030901" />
<CENTER>
<TABLE BORDER="0" CELLSPACING="0" CELLPADDING="0">
<TR>
	<TD ALIGN="CENTER" VALIGN="MIDDLE" COLSPAN="7">Bewerten Sie diesen Artikel</TD>
</TR>
<TR>
	<TD><EM>&nbsp;Sehr gut&nbsp;</EM></TD>
	<TD><INPUT TYPE="radio" value="1" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="2" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="3" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="4" NAME="radioRating" /></TD>
	<TD><INPUT TYPE="radio" value="5" NAME="radioRating" /></TD>
	<TD ALIGN="right"><EM>&nbsp;Nicht gen&uuml;gend</EM></TD>
	<TD ROWSPAN="2" VALIGN="middle">&nbsp;<INPUT TYPE="submit" VALUE="Werten!" /></TD>
</TR>
<TR>
	<TD>&nbsp;</TD>
	<TD ALIGN="CENTER">&nbsp;1</TD>
	<TD ALIGN="CENTER">&nbsp;2</TD>
	<TD ALIGN="CENTER">&nbsp;3</TD>
	<TD ALIGN="CENTER">&nbsp;4</TD>
	<TD ALIGN="CENTER">&nbsp;5</TD>
	<TD>&nbsp;</TD>
</TR>
</TABLE>
</FORM>
</center>
&nbsp;<P>
<center>
<p><table><tr><td valign=top>
<form action="REMOVED" method="GET"><input type="hidden" name="pagetitle" value="Spam wirkungsvoll bek&auml;mpfen"><input type="hidden" name="pageurl" value="http://www.aspheute.com/artikel/20030901.htm"><input type="image" src="../images/layout/senden.png" width="107" height="20" border="0" alt="Schicken Sie diese Seite einem Freund!" style="cursor='hand';"></form>
<td>&nbsp;&nbsp;</td>
<td valign=top>
<form action="REMOVED" method="GET"><input type="hidden" name="Author" value="Bernhard Spuida"><input type="hidden" name="AuthorEmail" value="bernhard@icsharpcode.net"><input type="hidden" name="Artikel" value="20030901"><input type="image" src="../images/layout/kontakt.png" width="107" height="20" border="0" alt="Kontaktieren Sie den Autor!" style="cursor='hand';"></form>
<td>&nbsp;&nbsp;</td>
<td valign=top><a href="../PrinterFriendly/20030901.htm"><img src="../images/layout/druck.png" width="118" height="20" border="0" alt="F&uuml;r Ausdruck optimierte Seite"></a></td>
</tr></table></p>
</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
