<?xml version="1.0" encoding="Windows-1252"?>
<articles>
<article>
<ArticleId>20041025</ArticleId>
<title><![CDATA[XHTML Strict 1.0 mit ASP.NET 1.1]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[25.10.2004]]></date>
<description><![CDATA[Da das Thema XHTML (endlich) immer popul&auml;rer wird, habe ich die Website 
<a href="http://www.waltergmbh.de" target="_blank">http://www.waltergmbh.de</a> nach ASP.NET 1.1 und XHTML 1.0 Strict portiert. Wie die Umsetzung von XHTML 1.0 Strict mit ASP.NET 1.1 und Visual Studio.NET 2003 funktioniert, werde ich in diesem Artikel beschreiben.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20040929</ArticleId>
<title><![CDATA[DataGrid - Daten bearbeiten leicht gemacht]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[29.9.2004]]></date>
<description><![CDATA[Das ASP.NET DataGrid ist das WebControl schlechthin, wenn es um die Anzeige und Bearbeitung tabellarischer Daten geht - w&auml;re da nicht das leidige Problem mit den Unique-IDs der Datens&auml;tze: in der Praxis steht man immer wieder vor dem Problem, wie man die ID eines Datensatzes, der upgedatet  werden soll, ermittelt, ohne die ID-Spalte im DataGrid anzuzeigen. Einen einfachen und eleganten L&ouml;sungsweg m&ouml;chte ich heute aufzeigen.]]></description>
<category><![CDATA[.NET Fu]]></category>
</article>
<article>
<ArticleId>20040922</ArticleId>
<title><![CDATA[Mehrsprachige Applikationen in .Net]]></title>
<author><![CDATA[Dani Meier]]></author>
<date><![CDATA[22.9.2004]]></date>
<description><![CDATA[Sicher sind die meisten schon einmal vor der Aufgabe gestanden, eine Applikation mehrsprachig umzusetzen. M&ouml;gliche L&ouml;sungsans&auml;tze gibt es daf&uuml;r mehr als genug: Ressource-Files, Xml-Files, Flat-Files, Datenbanken, Usw.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20040901</ArticleId>
<title><![CDATA[Optimiertes Erstellen von DropDowns]]></title>
<author><![CDATA[Stephan Troxler]]></author>
<date><![CDATA[1.9.2004]]></date>
<description><![CDATA[Das Problem tritt &uuml;berall dort auf, wo &uuml;berlange Dropdownmen&uuml;s mit Dutzenden, ja vielleicht sogar Hunderten von Eintr&auml;gen aus einer Datenbank gelesen und aufbereitet werden. Durch die enorme Datenmenge, welche normalerweise &uuml;ber ein Recordset abgearbeitet und HTML-konform aufbereitet werden muss, verz&ouml;gert sich der Seitenaufbau schnell einmal 
um einige Sekunden. Das muss nicht sein! Dieser Artikel zeigt einen cleveren Weg auf, wie mittels weniger Tricks der gr&ouml;sste Teil der Arbeit der Datenbank &uuml;berlassen wird.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20040701</ArticleId>
<title><![CDATA[Visual Studio 2005 und .NET 2.0 Beta 1]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[1.7.2004]]></date>
<description><![CDATA[Am 29ten Juni hat Microsoft eine Welle von Betaprodukten auf die Entwicklergemeinde losgelassen. Um sozusagen f&uuml;r die Sommerbesch&auml;ftigung (und dar&uuml;ber hinaus) zu sorgen,  habe ich in diesem Artikel wichtige Anlaufpunkte f&uuml;r den "verspielten" Programmierer zusammengetragen, um das Verwenden der Betas auch zum Vergn&uuml;gen werden zu lassen.]]></description>
<category><![CDATA[.NET 2.0]]></category>
</article>
<article>
<ArticleId>20040628</ArticleId>
<title><![CDATA[MouseOver-Effekte beim DataGrid]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[28.6.2004]]></date>
<description><![CDATA[Das ASP.NET DataGrid bietet zur besseren &Uuml;bersicht in gro&szlig;en Datenmengen das allseits bekannte Paging an. Hat man jedoch mehrere Datenspalten im DataGrid, ist die &Uuml;bersichtlichkeit unter Umst&auml;nden dennoch  ziemlich eingeschr&auml;nkt. In diesem Artikel werden wir deshalb eine L&ouml;sung erarbeiten, die die &Uuml;bersichtlichkeit dadurch erh&ouml;ht, da&szlig; beim &Uuml;berfahren der einzelnen Zeilen mit der Maus die jeweils aktuelle Zeile komplett farbig hervorgehoben wird.]]></description>
<category><![CDATA[.NET Fu]]></category>
</article>
<article>
<ArticleId>20040624</ArticleId>
<title><![CDATA[Wer bist Du? Eine kurze Einf&uuml;hrung in das .NET Reflection API]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[24.6.2004]]></date>
<description><![CDATA[Will man zum Beispiel einem selbst entwickelten User- oder Server Control eine DataSource Property spendieren, welche au&szlig;er DataSets und Collections auch selbst (oder von Dritten) entwickelte Objekte (Klassen) verarbeiten kann, ist es notwendig, dass diese von einer von uns bereitgestellten Klasse erben oder ein Interface (z.B. ICollection) implementieren - im Normalfall.]]></description>
<category><![CDATA[.NET Fu]]></category>
</article>
<article>
<ArticleId>20040622</ArticleId>
<title><![CDATA[Einf&uuml;hrung in Typed DataSets]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[22.6.2004]]></date>
<description><![CDATA[Eine Neuerung, die mit ADO.NET eingef&uuml;hrt wurde, sind die sogenannten DataSets, welche eine oder mehrere Datentabellen im Speicher abbilden. Hierzu werden die Namen der Spalten und die Daten des Abfrageergebnisses aus der Datenbank &uuml;ber den Namen als Strings angesprochen. Doch eben diese Art der Speicherung kann in der Praxis zu Problemen f&uuml;hren. Die L&ouml;sung ist 
Gegenstand dieses Artikels und hei&szlig;t "Typed DataSets".]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20040519</ArticleId>
<title><![CDATA[Entwicklung eines Event-Managers mit ASP.NET 1.1]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[19.5.2004]]></date>
<description><![CDATA[Die Zahl der Informations- und Fortbildungsveranstaltungen - inbesondere im IT-Sektor - nimmt zu. Die Besucher dieser Veranstaltungen erwarten heutzutage, daß Sie sich über eine Website komfortabel anmelden können und auch weitergehende Informationen zum Event erhalten. Dieser Artikel gibt einen Überblick über die Architektur des EventManagers, der für die vom 04. - 05. Juni 2004 zum ersten Mal stattfindende .NET Community Conference mit ASP.NET 1.1 und C# entwickelt wurde.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20040517</ArticleId>
<title><![CDATA[Filesystem-Watcher leicht gemacht]]></title>
<author><![CDATA[Herbert Hahn]]></author>
<date><![CDATA[17.5.2004]]></date>
<description><![CDATA[Dieser Artikel zeigt wie man mit Bordmitteln plus eines Freewaretools einen kleinen Service realisiert, der per E-Mail eine Verst&auml;ndigung schickt, wenn in einem bestimmten Verzeichnis (hier ein FTP-Verzeichnis) ein File landet.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20040401</ArticleId>
<title><![CDATA[Neues in .NET Codename "Swinomish"]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[1.4.2004]]></date>
<description><![CDATA[Lange hat es gedauert und die Ger&uuml;chtek&uuml;che brodelt dementsprechend. Die n&auml;chste Version des .NET Framework steht vor der T&uuml;r, noch umfangreicher, das steht fest. Aber was bringt uns Microsoft danach? Von Generics in .NET "Whidbey" hat schon fast jeder geh&ouml;rt, aber was wird sich danach in diesen und anderen Bereichen tun? In diesem Artikel betrachten wir einige der innovativsten Features des kommenden .NET "Swinomish", das wie seine Vorg&auml;nger seinen Codenamen von einem Landmark aus der Pudget Sound Area rund um Seattle erhalten hat.]]></description>
<category><![CDATA[Aprilscherz]]></category>
</article>
<article>
<ArticleId>20040318</ArticleId>
<title><![CDATA[Pager- und Footerzeilen des DataGrid erweitern]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[18.3.2004]]></date>
<description><![CDATA[Der Pager des DataGrids bietet standardm&auml;&szlig;ig nur zwei Arten der Formatierung: Seitenzahlen und "Symbole" zum Bl&auml;ttern ohne Angabe der Seitenzahlen. &Auml;hnlich langweilig gestaltet sich der Footer - im Normalfall ist er n&auml;mlich leer, obwohl er sich gerade bei DataGrids f&uuml;r zB Summierung einzelner Spalten eignet.]]></description>
<category><![CDATA[.NET Fu]]></category>
</article>
<article>
<ArticleId>20040317</ArticleId>
<title><![CDATA[Eintr&auml;ge numerieren im DataGrid]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[17.3.2004]]></date>
<description><![CDATA[F&uuml;r eine Website wollte ich im Rahmen einer von mir entwickelten Online-Petition einen Z&auml;hler f&uuml;r die Anzahl der Eintr&auml;ge sowie die Nummer des aktuellen Eintrages im Stil "Eintrag 10 von 452" im DataGrid realisieren. Dabei stie&szlig; ich auf unerwarteten Widerstand seitens des DataGrids. Welcher Art dieser Widerstand war und wie eine m&ouml;gliche 
L&ouml;sung aussehen k&ouml;nnte, m&ouml;chte ich deshalb hier darstellen.]]></description>
<category><![CDATA[.NET Fu]]></category>
</article>
<article>
<ArticleId>20040303</ArticleId>
<title><![CDATA[Vergleich von DataGrid, DataList und Repeater-Control - was verwende ich wann?]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[3.3.2004]]></date>
<description><![CDATA[Wie bereits im Artikel Das ASP.NET DataGrid selbst erweitern beschrieben, handelt es sich beim DataGrid um ein sehr flexibles Webcontrol zur tabellarischen Darstellung von Daten. Doch das DataGrid ist nicht das einzige Control, das das .NET-Framework zur Darstellung von Daten bereithält. Zwei weitere Vertreter dieser Gattung stellen das DataList- und das Repeater- Control dar. Die Unterschiede - aber auch Gemeinsamkeiten - zwischen diesen drei Controltypen und die jeweils sinnvollen Einsatzbereiche zeigt dieser Artikel auf.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20040225</ArticleId>
<title><![CDATA[Installation von Subversion in einer .NET Entwicklungsumgebung]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[25.2.2004]]></date>
<description><![CDATA[Die derzeit sowohl preislich als auch funktionell interessanteste Software zur Versionsverwaltung stellt Subversion dar. Allerdings ist der Weg von der ersten Installation bis zum reibungsfreien Betrieb in einer .NET-Entwicklungsumgebung mitunter steinig. Einige Steine soll dieser Artikel aus dem Weg r&auml;umen.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20040123</ArticleId>
<title><![CDATA[DataViews als DataTable persistieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.1.2004]]></date>
<description><![CDATA[Datenzugriff ist mit ADO.NET sehr einfach - Daten werden mit Hilfe eines DataAdpaters vom Server geholt und in ein DataSet gespeichert, und dann kann man Daten aus den DataTables auslesen. Und braucht man eine andere Sortierung oder Filterung, wozu zum Server gehen, mit Hilfe der DataView Klasse kann man das Client-seitig erledigen. Einziger Sch&ouml;nheitsfehler in .NET 1.x an dieser Sache ist, da&szlig; man aus der eben erzeugten Sicht (DataView mit .Sort oder .RowFilter Kriterien) nicht einfach einen neuen DataTable machen kann.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20040105</ArticleId>
<title><![CDATA[Passw&ouml;rter speichern - aber richtig!]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.1.2004]]></date>
<description><![CDATA[In sehr vielen - um nicht zu sagen fast allen - Webanwendungen werden Benutzerdaten verwaltet, vom Webforum bis hin zum Webshop. Diese Benutzerdaten umfassen auch die Logininformationen der User, welche neben dem Usernamen auch das Passwort enthalten - und das als Plain Text. Eine Sicherheitsl&uuml;cke par excellence.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20031222</ArticleId>
<title><![CDATA[Tee Off! Wolpertinger Genome Project]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[22.12.2003]]></date>
<description><![CDATA[Nach langer Pause gab es wieder ein Golfturnier mit spannender Aufgabe und
heroischen Mitspielern. Dieses Mal stammt die Aufgabenstellung von Alexander Veit.
Die Aufgabe erscheint auf den ersten Blick kompliziert - weshalb auch eine Dauer von einem Monat f&uuml;r das Turnier festgesetzt wurde - ist aber mit erstaunlich wenig Schl&auml;gen zu bew&auml;tigen.]]></description>
<category><![CDATA[Tee Off]]></category>
</article>
<article>
<ArticleId>20031128</ArticleId>
<title><![CDATA[Die ersten Schritte in Visual Basic .NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[28.11.2003]]></date>
<description><![CDATA[Programmiersprachen gibt es ja viele - alle mit unterschiedlichen Anwendungsbereichen und Erfordernissen. Je komplexer aber die Aufgabenstellung wird, desto gr&ouml;&szlig;er wird aber auch die Anforderung an den Programmierer. Eine Sprache sticht jedoch hervor - Visual Basic. Die Lernkurve ist relativ niedrig und man kann auch aufwendigere Projekte damit realisieren. Visual Basic .NET geht nun noch um einiges weiter. Diese Artikelserie soll Ihnen einen Einstieg in diese .NET Sprache geben.]]></description>
<category><![CDATA[VB.NET]]></category>
</article>
<article>
<ArticleId>20031010</ArticleId>
<title><![CDATA[Einstieg in Visual Studio.NET - die erste Webanwendung mit Visual C#]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[10.10.2003]]></date>
<description><![CDATA[F&uuml;r die Entwicklung von ASP.NET-Webanwendungen steht inzwischen eine Reihe von hochwertigen Entwicklungsumgebungen zur Verf&uuml;gung. 
Die wohl bekannteste und von Microsoft forcierte ist sicherlich Microsoft Visual Studio.NET. Dem Einstieg in ebendiese IDE (=Integrated Development Environment) sowie die Erstellung einer einfachen ASP.NET-Webapplikation widmet sich dieser Artikel.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20030911</ArticleId>
<title><![CDATA[Virtuelle Verzeichnisse umbenennen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[11.9.2003]]></date>
<description><![CDATA[Willkommen beim ersten Artikel zu Administrationsthemen rund um den IIS 6.0. Heute beginnen wir mit einem Thema das auf den ersten Blick f&uuml;rchterlich banal aussieht: dem Umbenennen von virtuellen Verzeichnissen. Hier existiert n&auml;mlich ein gr&ouml;&szlig;erer Unterschied zum alten IIS 5 als man zuerst annehmen m&ouml;chte.]]></description>
<category><![CDATA[IIS 6.0]]></category>
</article>
<article>
<ArticleId>20030910</ArticleId>
<title><![CDATA[Plagiat oder nicht?]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[10.9.2003]]></date>
<description><![CDATA[Ob das Aussehen einer Website, die Funktionalit&auml;t eines Programmes, &uuml;berall steht Sourcecode dahinter - von HTML bis C#. Stellen Sie sich vor, es kommt Ihnen zuf&auml;llig ein Sourcecode unter, der Sie ganz stark an Ihren eigenen aus einem Projekt erinnert... so ist es uns, dem SharpDevelop Team, passiert. Die Frage die sich nun stellt, wie weist man nach da&szlig; geklaut wurde?]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20030909</ArticleId>
<title><![CDATA[Das ASP.NET DataGrid selbst erweitern]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[9.9.2003]]></date>
<description><![CDATA[Das als Standard im .NET-Framework enthaltene DataGrid-Steuerelement ist bereits ein m&auml;chtiges Objekt zur Darstellung und Bearbeitung von Daten in tabellarischer Form. M&ouml;chte man das DataGrid allerdings in ein fixes Design implementieren, st&ouml;rt unter Umst&auml;nden das etwas "sprunghafte Verhalten" des DataGrids, d.h. die Zeilenzahl und damit die H&ouml;he des DataGrids variiert mit der Zahl der anzuzeigenden Datens&auml;tze.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20030905</ArticleId>
<title><![CDATA[Eine Webanwendung auf CD]]></title>
<author><![CDATA[Andreas Roth]]></author>
<date><![CDATA[5.9.2003]]></date>
<description><![CDATA[F&uuml;r das Internet werden mittlerweile nicht mehr nur einfache Anwendungen geschrieben - oft ist sehr n&uuml;tzliche Software  im Internet zu finden. Daher ist der oft geh&ouml;rte Wunsch verst&auml;ndlich, diese Applikationen auch Kunden ohne Internetzugang zur Verf&uuml;gung zu stellen. Mit der Software Intorel ActiveSite Compiler ist es m&ouml;glich, ein ASP Anwendung als Exe(cutable) weiterzugeben. Hier nun der Bericht, von einem Projekt das den Weg vom Netz auf die Scheibe mit einigen seiner Haken wieder gibt.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20030901</ArticleId>
<title><![CDATA[Spam wirkungsvoll bek&auml;mpfen]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[1.9.2003]]></date>
<description><![CDATA[Spam ist die Pest des Internet. Wie kann man sie wirkungsvoll bek&auml;mpfen? Das ist die Frage die sich fast jeder Internetbenutzer und -provider stellt. In den letzten Jahren hat die Anzahl der unerw&uuml;nschten kommerziellen Emails Ausma&szlig;e angenommen, die Email als Kommunikationsmedium inzwischen ernsthaft gef&auml;hrden und die auch f&uuml;r die ISPs &uuml;ber deren Server diese Emails geleitet werden ein ernsthaftes &ouml;konomisches und technisches Problem darstellen.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20030502</ArticleId>
<title><![CDATA[Authentifizierung in Web Services - WS-Security, Benutzername / Passwort]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.5.2003]]></date>
<description><![CDATA[Der WS-Security Standard umfasst das Signieren von SOAP Nachrichten, das Verschl&uuml;sseln von SOAP Nachrichten, sowie das Anh&auml;ngen von Security Credentials an SOAP Nachrichten. Diese Security Credentials werden f&uuml;r die Authentifizierung verwendet, und k&ouml;nnen Benutzername / Passwort, ein X.509 Zertifikat oder Bin&auml;rtoken sein. Wir besch&auml;ftigen uns heute mit ersterem, und werden dies mit Hilfe der Web Services Enhancements (WSE) 1.0 unter .NET implementieren.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20030501</ArticleId>
<title><![CDATA[Authentifizierung in Web Services - SOAP Header]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[1.5.2003]]></date>
<description><![CDATA[Im letzten Artikel zum Thema Authentifizierung in Web Services haben wir uns mit protokollabh&auml;ngiger Authentifizierung besch&auml;ftigt. Obwohl Windows Integrated eine gute Intranet-L&ouml;sung ist, so ist sie nicht Plattform-&uuml;bergreifend, man ist an Windows Clients gebunden. Man kann diese Einschr&auml;nkung umgehen, indem man zus&auml;tzliche SOAP Header in den SOAP Nachrichten mitschickt.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20030430</ArticleId>
<title><![CDATA[MP3-Titelinformationen mit .NET auslesen]]></title>
<author><![CDATA[Björn Waide]]></author>
<date><![CDATA[30.4.2003]]></date>
<description><![CDATA[Das MP3-Format erfreut sich ungebrochener Beliebtheit, um die gesamte heimische Platten- und CD-Sammlung auf g&auml;ngige PC-Festplatten zu rippen. Tagelanger Musik-Genuss ohne CD-Wechsel ist die Folge. Ohne die auf den CD-Covern 
abgedruckten Informationen &uuml;ber Titel, Interpret und Sonstigem kann man jedoch schnell den &Uuml;berblick verlieren. Dieser Artikel beschreibt, wie leicht man mit den Klassen des .NET-Frameworks diese Titelinformationen aus MP3-Dateien auslesen kann.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20030429</ArticleId>
<title><![CDATA[Authentifizierung in Web Services - Windows Integrated]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[29.4.2003]]></date>
<description><![CDATA[Standardm&auml;&szlig;ig sind Web Services die man programmiert f&uuml;r jedermann zug&auml;nglich, das hei&szlig;t, unauthentifizierte anonyme Benutzer k&ouml;nnen darauf zugreifen. Manches Mal ist das gew&uuml;nscht, in vielen anderen F&auml;llen (zb Kreditkarten-Abbuchungsservice) allerdings nicht. In dieser
Artikelserie werden wir verschiedene Authentifizierungsmethoden beleuchten, und wir beginnen heute mit der Windows Integrierten Authentifizierung.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20030428</ArticleId>
<title><![CDATA[Mailadressen sch&uuml;tzen]]></title>
<author><![CDATA[Stefan Mayer]]></author>
<date><![CDATA[28.4.2003]]></date>
<description><![CDATA[G&auml;steb&uuml;cher und Diskussionsforen sind immer &ouml;fter Ziele von eMail-Spidern. Sie werden als unersch&ouml;pfliche Datenquelle f&uuml;r 
Spammings diverser besonders "seri&ouml;ser" Firmen mi&szlig;braucht. Aber auch simple Kontaktadressen auf Homepages sind sehr beliebt, weil diese mit hoher Wahrscheinlichkeit auch gelesen werden. Ziel dieses Artikels ist es, eine Variante anzubieten, die es erm&ouml;glicht, Mailadressen bestm&ouml;glich vor Mi&szlig;brauch zu sch&uuml;tzen und trotzdem einen gr&ouml;&szlig;tm&ouml;glichen Komfort f&uuml;r die Besucher der Webseiten zu bieten.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20030403</ArticleId>
<title><![CDATA[Crystal Reports mit DataSets bef&uuml;llen - Teil 2]]></title>
<author><![CDATA[Rudolf Ball]]></author>
<date><![CDATA[3.4.2003]]></date>
<description><![CDATA[DataSets bieten sich als Quelle f&uuml;r den Inhalt eines Reports an, da sie von der Datenbank disconnected sind. Doch es ist ein wenig knifflig, dieses DataSet hinter den Report zu schieben. Wie man einen solchen Report erstellen kann, lernen Sie heute im zweiten Teil dieser Artikelserie.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20030402</ArticleId>
<title><![CDATA[Crystal Reports mit DataSets bef&uuml;llen - Teil 1]]></title>
<author><![CDATA[Rudolf Ball]]></author>
<date><![CDATA[2.4.2003]]></date>
<description><![CDATA[Nicht immer ist es optimal, einen Report direkt aus einer Datenbank zu bef&uuml;llen. Man w&uuml;nscht sich, Daten kurz vor dem Anzeigen noch zu manipulieren. Ob es sich nun um das Hinzuf&uuml;gen von Werten oder korrektes Runden handelt, in jedem Fall ist das Unterlegen eines DataSets hinter Crystal Reports eine gelungene Alternative. Anhand eines durchg&auml;ngigen Beispiels werden die Vorteile von DataSets und XML Schemas aufgezeigt.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20030401</ArticleId>
<title><![CDATA[Hochleistungskompression mit .NET-Bordmitteln]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[1.4.2003]]></date>
<description><![CDATA[Das Internet kennt einen 'Heiligen Gral': Bandbreite. Bandbreite ist kostbar,
sie mu&szlig; gespart werden um uns als Betreibern eines Auftrittes m&ouml;glichst wenig Traffic-Kosten zu verursachen und um den Besuchern einen m&ouml;glichst schnellen Zugang zum gew&uuml;nschten Inhalt zu gew&auml;hren. In diesem Artikel werden wir sehen welche M&ouml;glichkeiten uns das .NET Framework bietet um m&ouml;glichst hohe Kompression - und somit m&ouml;glichst effiziente Bandbreitennutzung - zu erreichen.]]></description>
<category><![CDATA[Aprilscherz]]></category>
</article>
<article>
<ArticleId>20030324</ArticleId>
<title><![CDATA[Minigolf - 99 Bottles of Beer]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[24.3.2003]]></date>
<description><![CDATA[Damit ein wenig Abwechslung ins Golferleben kommt, wurde dieses Mal ein Kurzturnier mit nur 48 Stunden Dauer ausgetragen - Minigolf sozusagen. Die Aufgabe war nat&uuml;rlich passend zum St. Patrick's Day gew&auml;hlt...]]></description>
<category><![CDATA[Tee Off]]></category>
</article>
<article>
<ArticleId>20030203</ArticleId>
<title><![CDATA[Web Folders mit IIS]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.2.2003]]></date>
<description><![CDATA[Bei der Verwendung eines Intranets kam mir ein interessantes Feature unter - durch einen Klick auf einen Hyperlink auf einer Seite &ouml;ffnete sich der Windows Explorer, und ich konnte wie vom Explorer gewohnt, Dateien auf den Webserver kopieren oder auf lokale Datentr&auml;ger schreiben. Mein Interesse war geweckt, und ich wollte wissen, wie denn das funktioniert.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20030115</ArticleId>
<title><![CDATA[Tee Off! Zahlen, W&ouml;rter, Zahlw&ouml;rter]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[15.1.2003]]></date>
<description><![CDATA[Die Zeit der Entzugserscheinungen ist vorbei! Wieder wurde ein spannendes Turnier ausgetragen. Es gab immerhin 79 Einsendungen mit einer Spannweite von 1578 bis zu 271 Schl&auml;gen. Wie man dem Leaderboard entnehmen kann war der Kampf an der Spitze recht hart und spannend. Es ist also an der Zeit endlich das vierte Turnier und seine &uuml;beraus interessanten L&ouml;sungen vorzustellen.]]></description>
<category><![CDATA[Tee Off]]></category>
</article>
<article>
<ArticleId>20021230</ArticleId>
<title><![CDATA[Programmierer hilft Programmierer]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.12.2002]]></date>
<description><![CDATA[Wer kennt das nicht - man kommt bei der L&ouml;sung eines Problems einfach nicht weiter, oder man wei&szlig; nicht, wie man es am besten anpacken soll. Wenn man doch einen anderen Programmierer fragen k&ouml;nnte... man kann! Und zwar in Mailinglisten, die auf dem Prinzip der gegenseitigen Hilfe aufbauen. Der heutige Artikel stellt Ihnen die wichtigsten deutschen Diskussionslisten zu ASP und 
ASP.NET vor.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20021202</ArticleId>
<title><![CDATA[3. Loch - Dr. Evils Qualit&auml;tskontrolle]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.12.2002]]></date>
<description><![CDATA[Die Entzugserscheinungen in den Golf-losen Tagen scheinen mit jedem Turnier immer schlimmer zu werden, was sich w&auml;hrend des Golfens dann etwa so manifestiert: "Neulich bei Vera am Mittag - Thema: Hilf mir, Vera, mein Mann spielt ASP Golf...". Aber zur&uuml;ck zum Turnier des Monats November: es galt den zentralen Teil einer erfolgreichen Weltuntergangsmaschine - den Countdownz&auml;hler - einer rigiden Qualit&auml;tskontrolle zu unterziehen!]]></description>
<category><![CDATA[Tee Off]]></category>
</article>
<article>
<ArticleId>20021107</ArticleId>
<title><![CDATA[Index Server Abfragen per Web Service]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[7.11.2002]]></date>
<description><![CDATA[Wenn Google seinen Suchkatalog per Web Service anbietet, warum sollte man dann nicht seine lokale Sitesuche per Web Service den Programmierern &ouml;ffnen? Heute werden wir einen solchen Suchservice basierend auf dem Index Server, der ja
Teil von Windows 2000 ist, implementieren. Und damit man die N&uuml;tzlichkeit eines solchen Services sieht, erstellen wir ihn f&uuml;r AspHeute.com, und geben auch noch einen Windows-Client mit dazu.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20021106</ArticleId>
<title><![CDATA[URL Rewriting am IIS]]></title>
<author><![CDATA[Carsten Wawer]]></author>
<date><![CDATA[6.11.2002]]></date>
<description><![CDATA[F&uuml;r den Apache Webserver gibt es schon seit geraumer Zeit (fast seit Ewigkeiten) ein Modul namens mod_rewrite, das URLs beliebig "Umschreiben" kann. Dies reicht von einfachen Rewrites (vorgaukeln einer statischen Site) bis hin zu komplexen Rewrites die sich regul&auml;rer Ausdr&uuml;cke bedienen. Heute werden wir ein Tool f&uuml;r IIS kennenlernen, das uns genau diese Funktionalit&auml;t als ISAPI Filter bietet.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20021105</ArticleId>
<title><![CDATA[Online File Management System mit ASP.NET und C# - Teil 2]]></title>
<author><![CDATA[Rudolf Ball]]></author>
<date><![CDATA[5.11.2002]]></date>
<description><![CDATA[Es gibt eine komfortable M&ouml;glichkeit, seine Daten, Dateien und Verzeichnisse online zu verwalten: ein Online File Management System (OFMS). Im ersten Teil der Artikelserie haben wir uns damit besch&auml;ftigt, Dateien und Verzeichnisse online browsebar zu machen. Heute implementieren wir die Funktionen f&uuml;r Upload und Download, sowie das Editieren von Textdateien.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20021104</ArticleId>
<title><![CDATA[Tee Off! Die Zweite]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[4.11.2002]]></date>
<description><![CDATA[Nach dem Erfolg des ersten ASP Golfturniers ging es mit folgender Aufgabenstellung in die zweite Runde: Eine Wortliste ist gegeben. Alle in ihr vorkommenden Anagramme sollen gruppiert werden. Gro&szlig;/Kleinschreibung mu&szlig; nicht ber&uuml;cksichtigt werden. Die &Uuml;bergabe an das Testskript folgt der im ersten Minigolf.]]></description>
<category><![CDATA[Tee Off]]></category>
</article>
<article>
<ArticleId>20021031</ArticleId>
<title><![CDATA[Online File Management System mit ASP.NET und C# - Teil 1]]></title>
<author><![CDATA[Rudolf Ball]]></author>
<date><![CDATA[31.10.2002]]></date>
<description><![CDATA[Websites werden im Laufe der Zeit ver&auml;ndert, und wenn man nicht gerade ein CMS (Content Management System) einsetzt, dann bedeutet das in den meisten F&auml;llen da&szlig; &Auml;nderungen durch Dateiupload mit FTP auf die Website kommen. Es gibt aber noch eine andere, komfortablere M&ouml;glichkeit, seine Daten, Dateien und Verzeichnisse online zu verwalten: ein Online File Management 
System (im weiteren nur mehr OFMS).]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20021030</ArticleId>
<title><![CDATA[Logfiles auswerten mit Webalizer]]></title>
<author><![CDATA[Stephan Troxler]]></author>
<date><![CDATA[30.10.2002]]></date>
<description><![CDATA[Wer heutzutage statistische Auswertungen aus seinen Logfiles generieren will, hat die Qual der Wahl aus hunderten von Tools das passende auszuw&auml;hlen. Auf AspHeute wurde schon Analog pr&auml;sentiert, und in diesem Artikel wird mit Webalizer ein weiteres Freewareprogramm vorgestellt. Gegen&uuml;ber Analog bietet Webalizer diverse Vorteile, die Handhabung bedarf jedoch anfangs etwas 
Gew&ouml;hnung.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20021029</ArticleId>
<title><![CDATA[Amazon.com Web Services 2.0]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[29.10.2002]]></date>
<description><![CDATA[Die Landschaft der verf&uuml;gbaren Web Services wird langsam bunter - neben den Google Web APIs hat auch ein weiterer "Gro&szlig;er" des Internets Web Services f&uuml;r uns Programmierer im Angebot - Amazon.com. Im heutigen
Artikel werden wir uns mit der Suche nach B&uuml;chern besch&auml;ftigen, der gezeigte Code ist leicht auf andere Angebote Amazons umlegbar.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20021028</ArticleId>
<title><![CDATA[ACT MetaMailer - Mails verschicken leicht gemacht]]></title>
<author><![CDATA[Gerhard Buchner]]></author>
<date><![CDATA[28.10.2002]]></date>
<description><![CDATA[Mails mit ASP zu verschicken ist schon l&auml;ngst keine Kunst mehr. Diverse Komponenten von Drittherstellern erleichtern dies ungemein. Sie programmieren einen Mailversand f&uuml;r die Komponente XYZ. Aus diversen Gr&uuml;nden wechseln Sie nun aber den Provider und dieser setzt die Mailkomponente ZYX ein. Oder Ihr Kunde B benutzt eine andere Komponente. Was tun? Alles neu programmieren, da die Befehle anders sind?]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020930</ArticleId>
<title><![CDATA[Tee Off - Das erste ASP Golf Turnier]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.9.2002]]></date>
<description><![CDATA[Den Perl Programmierern sind Golfturniere bereits ein Begriff, und seit kurzem geh&ouml;ren auch die ASP Programmierer zu den begeisterten Code-Golfern: wer eine vorgegebene Aufgabe mit den wenigsten Schl&auml;gen (Zeichen in einer ASP Datei) l&ouml;st, der hat das Turnier gewonnen. Unser erstes Turnier hat gleich eine ganze Zahl von Cracks auf den Platz gelockt, sehen Sie selbst...]]></description>
<category><![CDATA[Tee Off]]></category>
</article>
<article>
<ArticleId>20020906</ArticleId>
<title><![CDATA[On-the-fly Erstellung von vCard's]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[6.9.2002]]></date>
<description><![CDATA[Die virtuellen Businesskarten - die vCards - werden vielen von uns schon einmal untergekommen sein. Entweder als Attachment bei einer Email, oder als Download von einer Website. Einigen wird es dabei schon in den Sinn gekommen sein,
f&uuml;r das eigene Communityportal solche vCards dynamisch f&uuml;r die Mitglieder zu generieren. Dieser Artikel zeigt, wie's geht.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020905</ArticleId>
<title><![CDATA[Wochenberechnung mit .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.9.2002]]></date>
<description><![CDATA[Die Frage des Tages lautet: Wie erh&auml;lt man die Nummer der Woche f&uuml;r ein vorgegebenes Datum? Nun, die <i>Week</i> Funktion aus dem guten, alten VBScript gibt es nicht mehr, und auch die DateTime Klasse stellt keinerlei Methoden
oder Eigenschaften zur Verf&uuml;gung - wie also kommen wir wirklich vom Datum zur Woche?]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020904</ArticleId>
<title><![CDATA[Delay Signing von Assemblies]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[4.9.2002]]></date>
<description><![CDATA[Assemblies unter .NET m&uuml;ssen signiert werden, wenn sie in den Global Assembly Cache (GAC) installiert werden sollen. Auch sonst sollten Assemblies signiert werden, da die Runtime dann &uuml;berpr&uuml;fen kann, ob die zu ladende Assembly mit der &uuml;bereinstimmt, die zum Kompilierungszeitpunkt verwendet wurde. Dies passiert mittels Public und Private Keys, und wir werden uns heute mit der Frage auseinandersetzen, ob es denn klug ist, einem Entwickler den Private Key der Firma zu geben.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020903</ArticleId>
<title><![CDATA[Stored Procedures einfach erstellt]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.9.2002]]></date>
<description><![CDATA[Stored Procedures bieten sich als Schnittstelle zwischen Applikation und SQL Server Datenbank geradezu an, da man der Applikation nur Rechte auf die Stored Procedures geben mu&szlig;, und einen Direktzugriff auf Tabellen somit verhindern kann. Au&szlig;erdem ist es m&ouml;glich, erweiterte &Uuml;berpr&uuml;fungslogik in die Stored Procedure einzubauen - bevor ein INSERT, UPDATE oder DELETE ausgef&uuml;hrt wird. Warum werden SP's dann so selten eingesetzt? Weil viele Leute glauben, da&szlig; es mit viel Arbeit verbunden ist. Stimmt aber nicht.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20020902</ArticleId>
<title><![CDATA[Regex'en zu Assemblies kompilieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.9.2002]]></date>
<description><![CDATA[Mit .NET kann man regul&auml;re Ausdr&uuml;cke (Regex) in eine Assembly vorkompilieren, was einen Geschwindigkeitsvorteil zur Ausf&uuml;hrungszeit mit sich bringt. Heute werden wir uns die notwendigen Schritte daf&uuml;r anhand eines sehr praktischen Szenarios ansehen - wir werden eine Emailvalidierungs-Regex vorkompilieren, die man dann in allen Programmiersprachen und quer &uuml;ber Windows Forms oder ASP.NET Web Forms einsetzen kann.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020801</ArticleId>
<title><![CDATA[MS IE WebControls 101]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[1.8.2002]]></date>
<description><![CDATA[Die MS Internet Explorer WebControls sind eine kleine Erg&auml;nzung der bestehenden "Feature-rich" ASP.NET Server Controls. Separat zum Download angeboten, ersparen diese Server Controls einiges an Schreibarbeit um komplexe ASP.NET Seiten erstellen zu k&ouml;nnen. Dieser Artikel geleitet Sie von der Installation bis zu den wichtigsten Details dieser Server Controls.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20020731</ArticleId>
<title><![CDATA[Trafficreduzierung mit XCompress]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[31.7.2002]]></date>
<description><![CDATA[Der Traffic einer Site wächst mit deren Popularität, und irgendwann erreichen die Kosten für den Datentransfer eine Höhe, wo man sich Optionen überlegen sollte. Ein einfacher und schnell umgesetzter Ansatz ist die HTTP Komprimierung, die den Traffic deutlich reduzieren kann.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20020730</ArticleId>
<title><![CDATA[C# XML-Kommentare &mdash; Dokumentation von selbst]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[30.7.2002]]></date>
<description><![CDATA["Kommentare brauche ich nicht, ist doch eh klar was passiert" &mdash; Zwei Monate sp&auml;ter: "H&auml;h???". K&auml;ufer der Komponente: "Und wie bitte soll ich das aufrufen?" &mdash; wenn wir mit unseren Softwarekomponenten erfolgreich sein wollen, m&uuml;ssen sie leicht verwendbar sein. Dokumentation ist der Schl&uuml;ssel dazu. Hier geht es nicht um Endbenutzerhandb&uuml;cher, sondern um Dokumentation f&uuml;r Programmierer in unserem Team, Programmierer als Kunden unseren Codes.]]></description>
<category><![CDATA[Dokumentation]]></category>
</article>
<article>
<ArticleId>20020729</ArticleId>
<title><![CDATA[Den Webserver umsiedeln (IIS 4 oder 5)]]></title>
<author><![CDATA[Herbert Hahn]]></author>
<date><![CDATA[29.7.2002]]></date>
<description><![CDATA[Dieser Artikel besch&auml;ftigt sich mit dem Problem, das man hat, wenn man daran denkt einen Webserver mit mehreren konfigurierten Websites auf eine andere (neue) Servermaschine umzusiedeln. Ohne Handarbeit geht es n&auml;mlich mit den mitgelieferten Bordmitteln nicht. Wenn dann noch dazukommt da&szlig; sich der Pfad zur Site &auml;ndert, hat man nat&uuml;rlich gleich eine Menge an zus&auml;tzlich m&ouml;glichen Fehlerquellen. Praktisch w&auml;re es also, wenn man die ganze Konfiguration einfach kopieren k&ouml;nnte.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20020705</ArticleId>
<title><![CDATA[Formularbasierte Authentifizierung in f&uuml;nf Minuten]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.7.2002]]></date>
<description><![CDATA[In Anlehnung an diverse Buchserien werde ich Ihnen heute zeigen, wie schnell man mit ASP.NET eine Website f&uuml;r registrierte User erstellen kann. Da mir nach den f&uuml;nf Minuten noch Zeit &uuml;brig bleibt, gebe ich Ihnen noch eine fix und fertige L&ouml;sung f&uuml;r ein technisch sauberes und vor allem sicheres Loginformular mit auf den Weg.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20020704</ArticleId>
<title><![CDATA[Zahl, Datum und W&auml;hrung korrekt formatiert ausgeben]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[4.7.2002]]></date>
<description><![CDATA[Ein wenig geliebtes Thema unter ASP war das Formatieren von Zahlen passend zu l&auml;nderspezifischen Einstellungen - meist schummelten sich die Programmierer dar&uuml;ber hinweg, mit dem Ergebnis, da&szlig; wenn man von einem deutschen Webserver auf einen englischen migrierte, nichts mehr korrekt ausgegeben wurde. Unter .NET gibt es keine Ausreden mehr, seine Applikationen von vorne herein global auszulegen: Internationalisierung hat seinen Schrecken verloren.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020703</ArticleId>
<title><![CDATA[Eine kleine Bilddatenbank, Teil 1]]></title>
<author><![CDATA[Herbert Hahn]]></author>
<date><![CDATA[3.7.2002]]></date>
<description><![CDATA[Auf die Idee f&uuml;r diese Artikelserie hat mich das Lesen der diversen Mailinglisten von ASPGerman gebracht. Immer wieder werden solche Themen nachgefragt: Wie kann ich ein Popup Fenster auf die Gr&ouml;&szlig;e des Bildes einstellen? Wie kann ich beim Upload von Bildern die Gr&ouml;&szlig;e des Bildes begrenzen? Und so weiter. Diese Artikelserie wird die &uuml;blichsten Fragen abdecken.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20020702</ArticleId>
<title><![CDATA[.NET Komponenten in COM+ Clients einsetzen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.7.2002]]></date>
<description><![CDATA[Mit dem .NET Framework sind Funktionen in die Griffweite eines jeden Programmierers ger&uuml;ckt, von denen man noch vor nicht allzu langer Zeit nur tr&auml;umen durfte. Trotz all dieser neuen Features kann man meist seine alten Applikationen nicht einfach wegwerfen und in .NET neu schreiben, sondern man mu&szlig; sie weiterwarten. Dieser Artikel zeigt, wie man seine existierende Applikation mit in .NET geschriebenen Komponenten verbinden kann.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020701</ArticleId>
<title><![CDATA[Schreib"kunst" f&uuml;r Programmierer, Teil II]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[1.7.2002]]></date>
<description><![CDATA[In Teil I haben wir uns mit den Grundlagen - Lesbarkeit und Verst&auml;ndlichkeit von Texten - besch&auml;ftigt. Heute besch&auml;ftigen wir uns mit Stilfragen und den kleinen Tricks die aus einem verst&auml;ndlichem technischen Text einen gut zu lesenden, interessanten Text machen.]]></description>
<category><![CDATA[Dokumentation]]></category>
</article>
<article>
<ArticleId>20020619</ArticleId>
<title><![CDATA[Unit Testing]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.6.2002]]></date>
<description><![CDATA[Das Unit Testing ist in der Java Welt schon lange ein Begriff und wird auch oft eingesetzt. Im heutigen Artikel besch&auml;ftigen wir uns mit der Frage warum man Unit Testing auch in .NET einsetzen soll, wie man es machen kann, und welche Vorteile man daraus ziehen kann.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020618</ArticleId>
<title><![CDATA[Das ASP.NET Web Matrix Projekt]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[18.6.2002]]></date>
<description><![CDATA[Nach einer l&auml;ngeren Testphase (und nach einigen Ger&uuml;chten) ist es nun so weit - die ASP.NET Web Matrix ist endlich da! Hinter dem Namen ASP.NET Web Matrix verbirgt sich ein freies, leicht zu erlernendes Entwicklungstool f&uuml;r ASP.NET Applikationen, das selbst mit Hilfe von .NET, C# und Windows Forms implementiert wurde. Web Forms und Web Services bequem entwickeln ohne Visual Studio .NET kaufen zu m&uuml;ssen ist damit Realit&auml;t.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20020617</ArticleId>
<title><![CDATA[Erstellen von HTML Help Dateien]]></title>
<author><![CDATA[Hubert Daubmeier]]></author>
<date><![CDATA[17.6.2002]]></date>
<description><![CDATA[Dieser Artikel beschreibt kompakt worum es sich dabei handelt, wo die Vor- und Nachteile liegen und wie Sie es nutzen k&ouml;nnen. Und er zeigt wie Sie im Schnellgang eine eigene kompilierte Windows HTML Hilfedatei erstellen k&ouml;nnen.]]></description>
<category><![CDATA[Dokumentation]]></category>
</article>
<article>
<ArticleId>20020507</ArticleId>
<title><![CDATA[Deutsche Personalausweisnummern verifizieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[7.5.2002]]></date>
<description><![CDATA[Im Internet findet man immer wieder interessante Ans&auml;tze, die Identit&auml;t bzw. das Alter der Surfer zu bestimmen. Einer davon ist die Personalausweisnummer vom Surfer eintippen zu lassen, da diese neben allgemeinen Angaben auch das Alter beinhaltet. Mit Hilfe von in der Personalausweisnummer eingebauten Pr&uuml;fziffern kann man kontrollieren, ob die Eingaben korrekt sind.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020506</ArticleId>
<title><![CDATA[Schreib&quot;kunst&quot; f&uuml;r Programmierer, Teil I]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[6.5.2002]]></date>
<description><![CDATA[Im ersten von zwei Artikeln &uuml;ber die Kunst des Schreibens besch&auml;ftigen wir uns mit den Grundlagen guten, klaren Schreibstils. Wieso, so fragst Du Dich jetzt, ist f&uuml;r mich als Programmierer guter Schreibstil wichtig? Ganz einfach: die Benutzer unserer Programme wollen - ebenso wie die Leser der Artikel hier auf ASPheute - m&ouml;glichst schnell Nutzen aus dem Gelesenen ziehen.]]></description>
<category><![CDATA[Dokumentation]]></category>
</article>
<article>
<ArticleId>20020503</ArticleId>
<title><![CDATA[Show me the source - Includes aufgel&ouml;st]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.5.2002]]></date>
<description><![CDATA[Includes sind sehr praktisch, wenn man Funktionalit&auml;t in ASP Projekten gezielt wiederverwertbar machen m&ouml;chte. Der damit erreichte Vorteil der Modularisierung hat einen "Nachteil" - m&ouml;chte man sich den gesamten Code einer ASP Seite ansehen, wie er von der ASP Engine nach dem Expandieren der Includes ausgef&uuml;hrt wird, dann gibt es zwei Wege..]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020502</ArticleId>
<title><![CDATA[Yet Another Forums Software]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.5.2002]]></date>
<description><![CDATA[Es geht weiter mit der Serie "Yet Another...", und zwar stelle ich heute die StP Forums Software vor. Diese implementiert ein auf ASP und Access Datenbank basierendes Forum, das man in seine Site gratis einbinden kann. Der heutige Artikel beleuchtet die Features und Administrationsm&ouml;glichkeiten dieser Forensoftware.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20020430</ArticleId>
<title><![CDATA[Gro&szlig;e Datenmengen in Formularfeldern erfolgreich auslesen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.4.2002]]></date>
<description><![CDATA[Wer lange genug mit ASP arbeitet, lernt die interessantesten Designentscheidungen des Active Server Pages Teams kennen. Eine davon ist, da&szlig; das Gr&ouml;&szlig;enlimit f&uuml;r ein mit ASP auslesbares Formularfeld genau
102,399 Bytes ist. Wer &uuml;ber dieses Limit kommt, den erwartet eine Fehlermeldung - der heutige Artikel zeigt, wie man sich diese ersparen kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020429</ArticleId>
<title><![CDATA[Benutzerverwaltung leicht gemacht: Teil 1]]></title>
<author><![CDATA[Simon Dotschuweit]]></author>
<date><![CDATA[29.4.2002]]></date>
<description><![CDATA[In diesem Artikel m&ouml;chte ich Ihnen einen relativ einfachen Weg zeigen, mit dem auch Sie eine gro&szlig;e Anzahl von Benutzern innerhalb Ihrer Internet-Applikation leicht verwalten und in Ihr System integrieren k&ouml;nnen. Schlie&szlig;lich kommt irgendwann einmal der Zeitpunkt, wo eine simple Pa&szlig;wortabfrage nicht mehr ausreicht.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20020417</ArticleId>
<title><![CDATA[Sortieren mit dem IComparer Interface]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[17.4.2002]]></date>
<description><![CDATA[In vielen F&auml;llen sind die Elemente in einer Collection nicht so angeordnet, wie man sie gerne h&auml;tte. Oft m&ouml;chte man auch zur Laufzeit eine Umsortierung erzwingen, zB die Elemente aufsteigend statt absteigend sortieren. Anhand der <i>Sort</i> Methode der <i>ArrayList</i> Klasse zeige ich, da&szlig; dies nicht weiter schwierig ist.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020416</ArticleId>
<title><![CDATA[Arbeiten mit dem SQL Server XML View Mapper]]></title>
<author><![CDATA[Uwe Hess]]></author>
<date><![CDATA[16.4.2002]]></date>
<description><![CDATA[Kennen Sie schon den SQL Server XML View Mapper von Microsoft? Wenn Sie sich mit XML besch&auml;ftigen, dann sollten Sie dieses Tool auf alle F&auml;lle kennenlernen! Der SQL Server XML View Mapper erm&ouml;glicht unter anderem das Erstellen von XPath-Abfragen gegen eine SQL Server Datenbank, sowie projektbezogenes Arbeiten, und stellt dem Benutzer eine visuelle Arbeitsoberfl&auml;che zur Verf&uuml;gung.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20020415</ArticleId>
<title><![CDATA[Programmieren mit den Google Web APIs Beta 2]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[15.4.2002]]></date>
<description><![CDATA[Langsam aber sicher tauchen die ersten interessanten Web Services am Internet auf. Einer davon sind die Google Web APIs, mit denen man auf Such-, Cache- und Spellingdienste dieser sehr beliebten Suchmaschine zugreifen kann. Heute sehen wir uns, wie man die APIs in seine .NET Anwendungen einbauen kann.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20020412</ArticleId>
<title><![CDATA[Der Microsoft Baseline Security Analyzer (MBSA) 1.0]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[12.4.2002]]></date>
<description><![CDATA[Die Hotfixes f&uuml;r Windows, SQL Server und IIS werden in ihrer Anzahl nahezu t&auml;glich mehr. Auch Security Guidelines zur korrekten sicheren Konfiguration des Betriebssystems und seiner Services sind &uuml;ber viele Best Practices Dokumente verstreut. Und wenn man alles beisammen hat, mu&szlig; man darauf achten, auch wirklich alle Maschinen entsprechend upzudaten und zu sichern.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20020411</ArticleId>
<title><![CDATA[Kopieren verboten - Lizenzsicherung bei ASP Scripts]]></title>
<author><![CDATA[Claudius Ceteras]]></author>
<date><![CDATA[11.4.2002]]></date>
<description><![CDATA[Textdateien im allgemeinen und ASP Skripte im speziellen lassen sich nicht wie konventionelle Software sichern. Dieser Artikel soll einen Weg aufzeigen, wie man, wenn auch nicht das eigentliche Kopieren verhindern, so doch Lizenzverst&ouml;&szlig;e nachvollziehen kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020410</ArticleId>
<title><![CDATA[Yet Another Access Database Administration Tool]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[10.4.2002]]></date>
<description><![CDATA[Mit dieser Anleihe bei der Tool-Reihe "Yet Another..." sehen wir uns heute den StP Database Administrator f&uuml;r MS Access Datenbanken an, der ein weiteres von mittlerweile vielen Tools zur Online Administration von Access Datenbanken ist. Der StP Database Administrator bietet eine Reihe von Features, die man schon fast zum Standard solcher Tools z&auml;hlen darf...]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20020409</ArticleId>
<title><![CDATA[Dateien umbenennen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[9.4.2002]]></date>
<description><![CDATA[Auf den ersten Blick denkt man sich, da&szlig; das so schwer nicht sein kann. Allerdings wenn man dann nicht wie erwartet eine <i>File.Rename</i> Methode findet, wird die Suche nach der L&ouml;sung f&uuml;r Nicht-Alte-Hasen der Windows Programmierung mehr oder weniger interessant.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020408</ArticleId>
<title><![CDATA[Klassenauflistungen mit dem Dictionary-Objekt]]></title>
<author><![CDATA[Marc Teufel]]></author>
<date><![CDATA[8.4.2002]]></date>
<description><![CDATA[Mit Klassenauflistungen hat jeder ernsthafte Visual Basic-Programmierer irgendwann einmal zu tun. Ob freiwillig oder unfreiwillig sei mal dahingestellt, klar ist aber, wer sie einmal kennen- und liebengelernt hat will nicht mehr ohne sie auskommen. Dieser Artikel zeigt einen kleinen Trick mit dem Klassenauflistungen sehr einfach aufgebaut und verwendet werden k&ouml;nnen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020401</ArticleId>
<title><![CDATA[Debugging in der Tiefe]]></title>
<author><![CDATA[Bernhard Spuida]]></author>
<date><![CDATA[1.4.2002]]></date>
<description><![CDATA[Im heutigen Artikel besch&auml;ftige ich mich mit Debugging von User Stacks. Debugging ist auch mit dem Debug Interface von C# nach wie vor eher eine Kunstform als eine exakte Wissenschaft. Besonders der Zugriff auf tiefliegende Komponenten eines Programmes ist schwierig, wenn man Seiteneffekte zur Laufzeit vermeiden will.]]></description>
<category><![CDATA[Aprilscherz]]></category>
</article>
<article>
<ArticleId>20020322</ArticleId>
<title><![CDATA[Query Express f&uuml;r MSDE]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[22.3.2002]]></date>
<description><![CDATA[Die Microsoft Data Engine (MSDE) ist die Desktop Version des SQL Servers. Obwohl die Performance auch f&uuml;r Webauftritte reicht, so fehlt doch eines: die Administrationstools. Zumindest den Query Analyzer kann man ab sofort gratis nachr&uuml;sten - mit der Applikation Query Express.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20020321</ArticleId>
<title><![CDATA[Flash Movies einbetten einfach gemacht]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[21.3.2002]]></date>
<description><![CDATA[Wer hat das nicht schon selbst erlebt: man bettet ein Flash Movie in eine Webseite ein, und macht sp&auml;ter eine kleine &Auml;nderung und vergisst, die &Auml;nderung sowohl im OBJECT als auch im EMBED Tag einzutragen. W&auml;re es nicht bequemer, die Eigenschaften f&uuml;r ein Flash Movie nur einmal zu setzen, und den clientseitigen Code automatisch erzeugen zu lassen? Die L&ouml;sung dazu ist eine serverseitige WebControl.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20020320</ArticleId>
<title><![CDATA[Flash Detection ohne Komponente]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[20.3.2002]]></date>
<description><![CDATA[Eine unter Webprogrammierern &auml;u&szlig;ert "beliebte" Aufgabe ist es, ein Flash-Movie einzubinden und zwar so, da&szlig; der Browser des Benutzers vorher abgefragt wird, ob denn Flash &uuml;berhaupt und in welcher Version installiert ist.
Das Problem kann mit der BrowserHawk Komponente gel&ouml;st werden, oder gratis mit dem moock fpi.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020319</ArticleId>
<title><![CDATA[Ein einfacher Eventkalender f&uuml;r Projektteams]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.3.2002]]></date>
<description><![CDATA[Ein wichtiger Teil beim Management eines Projektteams sind Termine f&uuml;r Meetings, Code Reviews, Feature Planung usw. Wenn man nicht gerade die Kombination Exchange/Outlook einsetzt, dann hei&szlig;t die L&ouml;sung entweder Email an alle oder ein Web-basierter Eventkalender. Den jedoch jedes Mal neu erfinden ist &uuml;berfl&uuml;ssige Arbeit.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20020318</ArticleId>
<title><![CDATA[Das using Schl&uuml;sselwort]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[18.3.2002]]></date>
<description><![CDATA[Wer mit C# arbeitet, dem ist das using Schl&uuml;sselwort sp&auml;testens seit dem obligatorischen Hello World Programm bekannt - als Statement zum Import von Namespaces. Da&szlig; using noch einiges mehr zu bieten hat, zeigt dieser 
Artikel, indem er die using Directive und das using Statement n&auml;her beleuchtet.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020305</ArticleId>
<title><![CDATA[Mitlauschen bei der Browser-Webserver Kommunikation]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.3.2002]]></date>
<description><![CDATA[Des &ouml;fteren k&ouml;nnen die Eigenheiten eines Browsers dem Programmierer mehr als nur Kopfschmerzen bereiten, vor allem dann, wenn es um das Debuggen von Cookies, speziellen Headern und Daten&uuml;bertragungsformaten geht. In diesem Fall ist es wichtig, genau herausfinden zu k&ouml;nnen, was der Browser dem Server schickt, und was vom Server an den Browser retourkommt.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20020304</ArticleId>
<title><![CDATA[Unerw&uuml;nschte Referer sperren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[4.3.2002]]></date>
<description><![CDATA[Vielen von uns ist es nur recht, wenn jemand zu unseren Sites beziehungsweise zu den Sites unserer Kunden linkt - es bringt ja Traffic. Andererseits gibt es aber Leute, die glauben f&uuml;r einen Link zu ihrer Site Geld kassieren zu k&ouml;nnen - mit dem Argument, da&szlig; man seine Site durch den Link zu ihrer
Site ja aufwertet. Nur wenn der Inhalt ihrer Site ach so wertvoll ist, dann ist es in ihrer Verantwortung den Inhalt vor unerw&uuml;nschten Referern zu sperren - und nicht nachtr&auml;glich von jederman zu kassieren (versuchen).]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20020301</ArticleId>
<title><![CDATA[Spruch des Tages]]></title>
<author><![CDATA[Herbert Hahn]]></author>
<date><![CDATA[1.3.2002]]></date>
<description><![CDATA[Die Idee zum heutigen Artikel entstammt aus dem echten (Beisl)Leben, n&auml;mlich dem k.u.k. Hofbeisl in Bad Ischl, das jeden Tag auf's neue einen Spruch des Tages auf einer Schautafel vor das Lokal stellt. Der Artikel "portiert" den Spruch des Tages in die Welt des Internets und ASP.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20020226</ArticleId>
<title><![CDATA[Ein Touch-Utility in C#]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[26.2.2002]]></date>
<description><![CDATA[Das Touch Utility war immer eines meiner Lieblingstools, weil man mit ihm das Datum auf einer Anzahl von Dateien vereinheitlichen kann - zB in einem Downloadarchiv oder bevor man eine Applikation ausliefert. Heute werden wir ein einfaches Touch Utility in C# schreiben, das jeder leicht an seine Pr&auml;ferenzen anpassen kann.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020225</ArticleId>
<title><![CDATA[Thumbnailgenerierung in .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.2.2002]]></date>
<description><![CDATA[Produktkataloge und Online-Bildergalerien haben (meist) eines gemeinsam: bevor man zum eigentlichen Detailbild gelangt, wird einem zuerst ein Vorschaubild, ein Thumbnail, pr&auml;sentiert. Solange die Bilder offline generiert werden, kann man auch die Thumbnails offline mitgenerieren - was aber, wenn die Bilder am Server gewartet/erstellt werden, und man die Thumbnails dynamisch on the fly generieren soll?]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20020207</ArticleId>
<title><![CDATA[Unions in C#]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[7.2.2002]]></date>
<description><![CDATA[Wer aus der C/C++ Welt kommt, kennt die Unions und ihr Funktionsprinzip bereits: diese erlauben es, an einer Speicheradresse unterschiedliche Datentypen zu speichern. Mit erstaunlich geringem Aufwand lassen sich Unions auch in C# nachbilden, und zwar mit Hilfe der Attribute <i>StructLayout</i> und <i>FieldOffset</i>.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020206</ArticleId>
<title><![CDATA[Der ODBC .NET Data Provider]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[6.2.2002]]></date>
<description><![CDATA[Obwohl es einen speziellen Managed Provider für SQL Server gibt, sowie einen Wrapper für OLE DB Provider, kann es sein, daß man auf seine Datenbank nicht zugreifen kann, weil es für die Datenbank nur einen ODBC Provider gibt. Um auch solche in .NET verwendbar zu machen, stellt Microsoft den ODBC.NET Data Provider als separaten Download zur Verfügung.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20020205</ArticleId>
<title><![CDATA[Der Object Construct String]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.2.2002]]></date>
<description><![CDATA[Im Artikel <i>In VB Komponenten auf ASP Objekte zugreifen (Variante 2)</i>
habe ich gezeigt, wie man mit Hilfe der COM+ Services sehr einfach an die ASP-internen Objekte wie zB Response oder Request herankommen kann. Heute stelle ich ein weiteres sehr n&uuml;tzliches Feature f&uuml;r Komponenten vor, die
COM+ Services verwenden: den Object Construct String.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20020201</ArticleId>
<title><![CDATA[Dateityp-Ermittlung in Managed C++]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[1.2.2002]]></date>
<description><![CDATA[Im gestrigen Artikel <i>Vorsicht Falle: Dateien, die keine sind</i> habe ich gezeigt, wie man mit Hilfe einer in C++ geschriebenen COM+ Komponente herausfinden kann, ob es sich bei der Datei die man verwenden m&ouml;chte um eine "echte" oder "nur" um Devices und Named Pipes handelt. Heute sehen wir uns die Thematik in .NET an, und machen gleich ein paar Aufw&auml;rm&uuml;bungen in Managed C++.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020131</ArticleId>
<title><![CDATA[Vorsicht Falle: Dateien, die keine sind]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[31.1.2002]]></date>
<description><![CDATA[Eigentlich d&uuml;rfte jedem das <i>FileSystemObject</i> ein Begriff sein - mit diesem kann man Dateien auslesen und schreiben, sowie einige wichtige Operationen (l&ouml;schen zB) auf Dateien und Verzeichnissen ausf&uuml;hren. Allerdings ist kaum bekannt, was Windows (NT/2000) so alles unter Dateien versteht - n&auml;mlich keineswegs nur Dateien die auf der Festplatte liegen.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20020130</ArticleId>
<title><![CDATA[Eigene Tags - User Input einfach und sicher]]></title>
<author><![CDATA[Frederic Ganner]]></author>
<date><![CDATA[30.1.2002]]></date>
<description><![CDATA[Am Beispiel eines Event-Kalenders wird in diesem Artikel erkl&auml;rt wie man mit einfachen Mitteln die Eingabe von Inhalten f&uuml;r Menschen, die zu wenig von HTML verstehen erleichtern kann, und wie man sich vor denen sch&uuml;tzt, die zu viel davon verstehen. Ein Feature, das sich aus der Anwendung ergibt, ist das Einsetzen von kleinen Grafiken (z.B. Smilies), mittels einfacher Tags, wie es oft bei Forensystemen verwendet wird.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020129</ArticleId>
<title><![CDATA[Komponentenverwendung einschr&auml;nken]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[29.1.2002]]></date>
<description><![CDATA[Wer mehr als eine Site pro Server betreibt - und nicht nur ISP's sind davon betroffen - kommt m&ouml;glicherweise irgendwann einmal in die Situation, da&szlig; eine am Server installierte Komponente nur bestimmten Websites zur Verf&uuml;gung stehen soll. Entweder ist der Grund, da&szlig; nur der zahlende Kunde diese verwenden k&ouml;nnen soll (und keine andere zuf&auml;llig am gleichen Server laufende Site), oder da&szlig; bestimmte Komponenten sicherheitssensitiv sind (Businesslogikkomponenten zum Beispiel).]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20020128</ArticleId>
<title><![CDATA[Serverdaten clientseitig in Exceltemplates importieren]]></title>
<author><![CDATA[Herbert Hahn]]></author>
<date><![CDATA[28.1.2002]]></date>
<description><![CDATA[Was soll der Anwendungsfall sein, ein Exceltemplate vom Server downzuloaden und dann am Client mit Daten die am Server generiert wurden zu bef&uuml;llen?. Nun, ganz einfach: es ist wahrscheinlicher, da&szlig; am Client Excel installiert ist als am Server! Dies ist besonders bei Providern der Fall, und so umgeht man das Problem ganz elegant mit einem clientseitigen Script, das dann auch noch die ganze Arbeit &uuml;bernimmt und den Server selbst nicht belastet (mit Excel-Prozessen).]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020125</ArticleId>
<title><![CDATA[Variable Parameterlisten in Funktionen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.1.2002]]></date>
<description><![CDATA[In den meisten aller F&auml;lle wei&szlig; man im vorhinein, wieviele Parameter an eine Funktion &uuml;bergeben werden sollen. Was aber, wenn bestimmte Parameter optional sein sollen, oder die Funktion ihre Arbeit an 1 bis n gleichartigen Parametern durchf&uuml;hren soll? In diesem Fall stellt uns C# das <i>params</i> Schl&uuml;sselwort zur Verf&uuml;gung.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020124</ArticleId>
<title><![CDATA[Arrays mit Index und Schl&uuml;ssel]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[24.1.2002]]></date>
<description><![CDATA[Arrays sind ein tolle Erfindung - man greift per Index bequem auf die Elemente zu. Will man nicht per Index auf ein Element zugreifen sondern per Schl&uuml;ssel, dann verwendet man die Hashtable Klasse. Doch was wenn man sowohl per Index als auch Schl&uuml;ssel auf Elemente zugreifen will? Auch dann wird man von .NET
nicht alleine gelassen, denn es gibt die <i>SortedList</i> Klasse, eine Mischung aus Array und Hashtable.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20020123</ArticleId>
<title><![CDATA[Impersonation mit ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.1.2002]]></date>
<description><![CDATA[Gesch&uuml;tzte Bereiche auf einer Website kann man auf viele Arten implementieren. Will man aber da&szlig; Seiten im gesch&uuml;tzen Bereich unter dem Account des eingeloggten Benutzers laufen (Impersonation), dann helfen nur noch Windows Accounts. Anwendungen der Impersonation gibt es unz&auml;hlige, aber sie wird immer dort notwendig, wo der normale Account des Webservers nicht mehr genug Rechte hat: zB anlegen von Usern im Active Directory, managen von DNS Servern via WMI, oder auch so einfache Dinge wie das Auslesen von mit NTFS Rechten gesch&uuml;tzten Dateien.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20020122</ArticleId>
<title><![CDATA[Wordfiles richtig &ouml;ffnen!]]></title>
<author><![CDATA[Herbert Hahn]]></author>
<date><![CDATA[22.1.2002]]></date>
<description><![CDATA[Wer hat es noch nicht erlebt: Man hat auf einer Intranetseite einen Link auf eine Worddatei (*.doc oder *.dot). Wenn man diesen Link anklickt, dann wird Word direkt im Browserfenster ge&ouml;ffnet. Da hilft es auch nicht, das target als "_blank" vorzugeben, da dies dann den gleichen Effekt im neuen Browserfenster hat. Ein Weg, wie man ganz gem&uuml;tlich Word 2000 als eigenst&auml;ndiges Programm &ouml;ffnet und dann auch noch die Datei richtig &ouml;ffnet ist &uuml;ber ein kleines clientseitiges Script (mit serverseitiger Hilfe, ist ja klar).]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020121</ArticleId>
<title><![CDATA[Besucherverfolgung f&uuml;r Fortgeschrittene]]></title>
<author><![CDATA[Stefan Mayer]]></author>
<date><![CDATA[21.1.2002]]></date>
<description><![CDATA[In meinem <i>Artikel Benutzerverfolgung in ASP</i> habe ich eine recht einfache Methode beschrieben, wie man ein aussagekr&auml;ftiges Logfile erstellen kann. In meinem heutigen Artikel m&ouml;chte ich eine Anleitung geben, wie auf Basis des vorangegangenen die Besuche noch besser verfolgt werden k&ouml;nnen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20020117</ArticleId>
<title><![CDATA[Last but not least - .NET 1.0 ist da!]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[17.1.2002]]></date>
<description><![CDATA[Lange hat es gedauert - aber seit Mittwoch fr&uuml;h  (US Zeit) ist .NET 1.0 zum Download verf&uuml;gbar. Neben den Links zu den Downloads (SDK und ASP.NET Releases) finden sich in diesem Artikel auch Links zu Sites rund um die verschiedenen in .NET enthaltenen Technologien, als auch zu Diskussionsforen, in denen man sich mit anderen Programmierern austauschen kann.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20020116</ArticleId>
<title><![CDATA[XML-Daten verarbeiten mit XSLT]]></title>
<author><![CDATA[Frederic Ganner]]></author>
<date><![CDATA[16.1.2002]]></date>
<description><![CDATA[Bei der Datenspeicherung und besonders beim Datenaustausch r&uuml;ckt XML immer mehr in den Vordergrund. Damit die Anwendung (oder der Mensch) mit der wir Daten austauschen diese auch aufnehmen kann, m&uuml;ssen diese meist aufbereitet werden - in ein Zielformat "transformiert" werden. Hierzu gibt es die eXtended Stylesheet Language (XSL). Und da&szlig; diese weit mehr kann (und f&uuml;r weit mehr gedacht ist) als ein XML-File in HTML zu verwandeln, m&ouml;chte ich heute vermitteln.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20020115</ArticleId>
<title><![CDATA[CAPICOM One]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[15.1.2002]]></date>
<description><![CDATA[Relativ unbemerkt hat Microsoft im Vorjahr CAPICOM - einen COM Client f&uuml;r das CryptoAPI - im "Windschatten" von Windows XP released. Dabei handelt sich um ein Set sehr n&uuml;tzlicher kryptographischer Komponenten, die in jeder Programmiersprache mit Automation Unterst&uuml;tzung verwendet werden k&ouml;nnen - von Visual Basic bis hin zur kleinen Verwandtschaft in ASP, VBScript.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20020114</ArticleId>
<title><![CDATA[Automatisches Aktualisieren einer Site per Mail]]></title>
<author><![CDATA[Jörg Neumann]]></author>
<date><![CDATA[14.1.2002]]></date>
<description><![CDATA[Wenn man die Aufgabe hat eine Web-Site t&auml;glich oder sogar st&uuml;ndlich mit neuem Inhalt zu f&uuml;llen, ist man meist an seinen Arbeitsplatz gebunden, auf dem man den aktuellen Inhalt erstellt und dann per FTP auf den Server &uuml;bertr&auml;gt. Sch&ouml;n w&auml;re es doch, wenn man von unterwegs mal eben per Mail den aktuellen Stand auf die Site bringen k&ouml;nnte.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20011207</ArticleId>
<title><![CDATA[On Demand Zugriffsrechte f&uuml;r Web Sites vergeben]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[7.12.2001]]></date>
<description><![CDATA[Sicher haben Sie auf Ihrer Web Site Content, der nicht von jedem 08/15 User eingesehen werden soll, zum Beispiel eine &quot;Members Only Area&quot;. IIS beziehungsweise Windows 2000 bieten hierf&uuml;r auch gen&uuml;gend (ausreichend sichere) M&ouml;glichkeiten, um gewisse Bereiche einer Web Site zu sperren. Wie w&auml;re es aber, solche Aufgaben on-demand, also im laufenden Betrieb des Web Servers zu erledigen - ohne NTFS Berechtigungen setzen zu m&uuml;ssen. Das gratis downloadbare AccessControl Tool bietet eine einfache L&ouml;sung mittels ISAPI Filter und ASP.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20011206</ArticleId>
<title><![CDATA[Performancemessungen in .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[6.12.2001]]></date>
<description><![CDATA[Heute besch&auml;ftigen wir uns mit einem altbekannten Thema, der Messung der (Ausf&uuml;hrungs-)Geschwindigkeit einer bestimmten Implementierung. Dazu sehen wir uns vier verschiedene ADO.NET Implementierungen f&uuml;r ein und dasselbe Problem an, an denen ich auch wieder zeigen werde, da&szlig; so manches Mal der Schein tr&uuml;gen kann - Code kann auch langsam aussehen, obwohl er es nicht ist.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20011204</ArticleId>
<title><![CDATA[IIS, was machst du gerade?]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[4.12.2001]]></date>
<description><![CDATA[Sicher wollten Sie schon immer wissen, was so auf Ihrem Web Server l&auml;uft - und zwar genau jetzt. Zwar liefern IIS Tools ein wenig Information, aber so richtig ins Detail können Sie erst mit IIS Tracer gehen. Sie erhalten wichtige Informationen &uuml;ber Ihre Web Site(s), wie z.B. den State einer Web Site, aktive Client IP Adressen, die Anzahl der Requests und mehr. Der IIS Tracer installiert sich als ISAPI Filter und kann bequemst &uuml;ber ein uuml;bersichtliches Html Interface konfiguriert werden.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20011203</ArticleId>
<title><![CDATA[Verhinderung von SQL Injection Marke .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.12.2001]]></date>
<description><![CDATA[Was <i>SQL Injection</i> ist, hat der erste Artikel dieser Serie ausf&uuml;hrlich erkl&auml;rt und auch demonstriert. In <i>Gegengifte f&uuml;r SQL Injection</i>, ging es dann um Wege mittels Inputvalidierung SQL Injection zu verhindern, und auch mittels ADO eine Art letzte Bastion zu errichten. Heute wechseln wir von ASP nach ASP.NET, und von ADO zu ADO.NET - und sehen uns die dortigen Abwehrmethoden an.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20011123</ArticleId>
<title><![CDATA[MS Script Encoder dekodiert]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.11.2001]]></date>
<description><![CDATA[Im Artikel <i>ASP Scripts verschl&uuml;sseln</i> habe ich beschrieben, wie
man ASP Scripts mittels MS Script Encoder unlesbar machen kann. Ich habe darauf hingewiesen, da&szlig; dies nur f&uuml;r den durchschnittlichen Benutzer als Abwehrmittel taugt, nicht aber gegen den, der wirklich den Sourcecode will. Um dieser Warnung Nachdruck zu verleihen, stelle ich heute ein Tool zur Umkehrung der
Verschl&uuml;sselung vor.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20011122</ArticleId>
<title><![CDATA[Einstellungssache - Applikationsdaten in web.config]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[22.11.2001]]></date>
<description><![CDATA[In der XML-basierten web.config Datei lassen sich auf einfache und strukturierte Weise Informationen f&uuml;r Web Applikationen oder Web Services speichern. Dieser Artikel beschreibt zwei M&ouml;glichkeiten, wie man f&uuml;r einen Web Service diverse Einstellungen speichern kann, und auch wie man  das Standardset der ASP.NET Configuration Settings mit eigenen Tags erweitern kann.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20011121</ArticleId>
<title><![CDATA[Active Directory Zugriff per .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[21.11.2001]]></date>
<description><![CDATA[Active Directory ist das zentrale Element einer Windows 2000 Domain Infrastruktur. Es gibt viele Zugriffsmethoden (ADSI oder LDAP, um zwei sehr bekannte zu w&auml;hlen), die mehr oder minder komplex sind. Mit dem .NET Framework ist Microsoft angetreten, es leichter zu machen. Heute werden wir uns das anhand des Zugriffs als auch der Suche nach Elementen ansehen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20011120</ArticleId>
<title><![CDATA[Ein Popup-Kalender im Einsatz]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[20.11.2001]]></date>
<description><![CDATA[Online-Buchungssysteme sind weit verbreitet, allerdings bereitet die Datumseingabe immer wieder Probleme. Vor allem bei Hotelzimmer- oder Flugticketreservierungen ist es notwendig, da&szlig; das Datum korrekt eingegeben wird - bei all den verschiedenen internationalen Formaten, die man antreffen k&ouml;nnte. Um das
Problem elegant zu umschiffen bietet es sich an, dem User einen Kalender in die Hand zu geben, aus dem er bequem das Datum w&auml;hlen kann: einen Popup-Kalender.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20011119</ArticleId>
<title><![CDATA[Schritt-f&uuml;r-Schritt Debuggen von Sicherheitsproblemen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.11.2001]]></date>
<description><![CDATA[Eines der l&auml;stigsten Probleme beim Entwicklen und Administrieren von Web Sites ist das Troubleshooten von Sicherheitsproblemen. Die absolute #1 ist hierbei Access Denied - Zugriff verweigert. Effizient herauszufinden warum man einen solchen Fehler erh&auml;lt ist Ziel des heutigen Artikels. Und wenn man den Grund kennt, ist die L&ouml;sung auch nicht mehr weit.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20011116</ArticleId>
<title><![CDATA[Erstellen von XML-Dateien mit dem DOM]]></title>
<author><![CDATA[Frederic Ganner]]></author>
<date><![CDATA[16.11.2001]]></date>
<description><![CDATA[Zur Bearbeitung von XML-Dateien bietet das Document Object Model (DOM) ein vielseitiges und praktisches Repertoire an. Nach dem vorangegangenen Artikel "Auslesen von XML Dateien mit dem DOM" befasst sich dieser mit der Erstellung von XML Dokumenten, beschr&auml;nkt sich dabei aber nicht auf die Arbeit mit dem DOM, sondern zeigt auch einfachere Wege zum Ziel. &Uuml;ber die Erkl&auml;rung der einzelnen M&ouml;glichkeiten des DOMs hinaus wird die Anwendung am Beispiel einer Sendung von Bestelldaten gezeigt.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20011115</ArticleId>
<title><![CDATA[Eine Klasse f&uuml;r sich - die .NET Zip Library]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[15.11.2001]]></date>
<description><![CDATA[Das .NET Framework umfasst hunderte Klassen, doch etwas fehlt: es gibt keinerlei Klassen zur Komprimierung und Dekomprimierung von Zip Archiven. Diesem Fehlen kann aber mit der .NET Zip Library (SharpZipLib) abgeholfen werden - diese unterst&uuml;tzt sowohl das Zip als auch das GZip Format, ist gratis, und kommt
mit C# Code inklusive.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20011114</ArticleId>
<title><![CDATA[.NET auf Warp 9 beschleunigen: Ngen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[14.11.2001]]></date>
<description><![CDATA[Das Ngen (Native Image Generator) Tool, welches dem .NET Framework SDK beiliegt, erstellt ein Abbild Ihrer Assembly in Maschinensprache im Global Assembly Cache (C#/VB.NET kompilieren zu IL, nicht Maschinensprache) . Dies beschleunigt
die Ausf&uuml;hrung gewaltig, da beim Erstaufruf der Assembly diese bereits in Maschinensprache vorliegt und nicht mehr durch den JIT Compiler dynamisch generiert werden mu&szlig;.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20011113</ArticleId>
<title><![CDATA[Sonderzeichen korrekt grabben mit XmlHttp]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[13.11.2001]]></date>
<description><![CDATA[Manches Mal kommt man sich als Entwickler f&uuml;r nicht-englische Sites leicht verlassen vor, da viel Software nur auf Englisch als Sprache ausgerichtet zu sein scheint. Und darunter f&auml;llt auch, da&szlig; in vielen F&auml;llen die von uns Deutschsprachigen so geliebten Sonderzeichen (Umlaute und dergleichen) des &ouml;fteren scheint's "verschluckt" werden - wie zum Beispiel beim Seitengrabbing mit der XmlHttp Komponente des MSXML Parsers.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20011112</ArticleId>
<title><![CDATA[Strukturierter Aufbau in der ASP-Programmierung]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[12.11.2001]]></date>
<description><![CDATA[Im heutigen Artikel m&ouml;chte ich Ihnen zeigen, da&szlig; es sinnvoll sein kann, seinen ASP-Dateien mehr "Struktur" zu verleihen. Der Artikel wird Ihnen zeigen, wie Sie selbst bei &uuml;berm&auml;&szlig;ig vielen Programmzeilen immer noch den &Uuml;berblick behalten.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20011031</ArticleId>
<title><![CDATA[Gegengifte f&uuml;r SQL Injection]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[31.10.2001]]></date>
<description><![CDATA[Im Artikel SQL Injection habe ich demonstriert, was darunter zu verstehen ist, und wie es funktioniert. Heute wollen wir uns die diversen Gegenstrategien ansehen, um SQL Injection in Zukunft zu verhindern. Darunter f&auml;llt wie schon im gestrigen Artikel erw&auml;hnt validieren, validieren, validieren und ein Umstellen des Codes auf nicht anf&auml;llige
Konstrukte.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20011030</ArticleId>
<title><![CDATA[SQL Injection]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.10.2001]]></date>
<description><![CDATA[Ein wie immer brillanter Michael Howard (Program Manager, Secure Windows Initiative, Microsoft Corporation) hat auf der Professional Developers Conference (PDC) 2001 in Los Angeles zwei Vortr&auml;ge &uuml;ber Sicherheit gehalten - 
einen &uuml;ber Windows-, den anderen &uuml;ber Websicherheit. Der letztere hat mich davon &uuml;berzeugt, wie wichtig es ist, Programmierer verst&auml;rkt &uuml;ber das Sicherheitsrisiko #1 f&uuml;r ASP Datenbankapplikationen zu informieren: SQL Injection.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20011029</ArticleId>
<title><![CDATA[.NET My Services Sneak Peek]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[29.10.2001]]></date>
<description><![CDATA[Auf der PDC 2001 in Los Angeles wurde das erste Mal offiziell eine Testversion der .NET My Services vorgestellt. Die .NET MyServices sind XML-basierende Web Services, die in (naher) Zukunft f&uuml;r Enduser zur Verf&uuml;gung gestellt werden. Mit diesen soll das Informationsmanagement einer Person (oder Gruppe von Personen) vereinfacht werden, und die Produktivit&auml;t gesteigert werden. Dieser Informationspool soll f&uuml;r alle berechtigten User auf jedem Clientger&auml;t &uuml;berall verf&uuml;gbar sein. Was die .NET My Services f&uuml;r Enduser bzw. Entwickler bedeuten, soll dieser Artikel &uuml;berblicksm&auml;&szlig;ig vorstellen.]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20011017</ArticleId>
<title><![CDATA[T-SQL Clauses: GROUP BY und HAVING]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[17.10.2001]]></date>
<description><![CDATA[Die beiden T-SQL Clauses GROUP BY und HAVING, ob in Kombination verwendet oder nicht, dienen allgemein zum Gruppieren von Datenspalten. Dies geschieht in Verbindung mit dem SELECT Statement. Diese Gruppierung ist vor allem bei gr&ouml;&szlig;eren ("rohen") Datenmengen von Vorteil, da hierbei die Daten schnell und &uuml;bersichtlich in einzelne Gruppen gegliedert werden.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20011016</ArticleId>
<title><![CDATA[Verzeichnisb&auml;ume rekursiv generieren]]></title>
<author><![CDATA[Christian Mairoll]]></author>
<date><![CDATA[16.10.2001]]></date>
<description><![CDATA[Ob im Intranet oder zur vereinfachten Fernwartung eines ASP Web Servers, Ordnerauflistungen k&ouml;nnen von vielerlei Nutzen sein. Um einen Ordner samt seinen Unterordnern in gewohnter Weise darstellen zu k&ouml;nnen, ben&ouml;tigt man rekursive Aufrufe. Heute wollen wir uns einen Verzeichnisbaum eines definierten Ordners erstellen, der die selben M&ouml;glichkeiten bietet, wie der Windows-Explorer Baum.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20011015</ArticleId>
<title><![CDATA[Der SQL UNION Operator]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[15.10.2001]]></date>
<description><![CDATA[Dieser Artikel stellt Ihnen den T-SQL UNION Operator in Anwendung und Funktion vor. Im Gegensatz zur Verwendung von JOIN werden hier die Ergebnisse von zwei oder mehreren Queries (Abfragen) kombiniert angezeigt. Der UNION Operator findet also Anwendung z.B. wo die WHERE Clause in Verbindung mit den logischen Operatoren keine Ergebnisse liefern kann oder wenn Views erstellt werden sollen, die sich auf mehrere Datenbanken oder SQL-Server Instanzen beziehen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20011010</ArticleId>
<title><![CDATA[Sprachenintegration in .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[10.10.2001]]></date>
<description><![CDATA[Unter .NET sticht ein Feature besonders heraus - die Programmiersprachen setzen auf einem gemeinsamen Substrat auf, der Common Language Runtime (CLR). Dadurch wird eine Sprachintegration m&ouml;glich, die es zuvor nicht gab: Klassen,
die in Programmiersprache A entwickelt wurden, k&ouml;nnen in Programmiersprache B verwendet werden - und es kommt sogar besser: man kann &uuml;ber Sprachgrenzen Klassen voneinander ableiten!]]></description>
<category><![CDATA[.NET Allgemein]]></category>
</article>
<article>
<ArticleId>20011009</ArticleId>
<title><![CDATA[Page Fragment Caching 101]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[9.10.2001]]></date>
<description><![CDATA[Eine dynamische Seite zu cachen ist bei vielen gleichzeitigen Userzugriffen ganz praktisch und spart vor allem Web Server Resourcen. Bei komplexeren dynamischen Seiten kann es aber vorkommen, da&szlig; der dynamische Content unterschiedliche "Verfallsdaten" haben kann. Mit ASP.NET haben Sie nun die M&ouml;glichkeit einzelne Regionen einer Seite mit Hilfe von ASP.NET User Controls die Content Expiration individuell an den dynamisch generierten Content anzupassen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20011008</ArticleId>
<title><![CDATA[Output Caching 101]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[8.10.2001]]></date>
<description><![CDATA[An sich ist das Cachen von Web Seiten ja nichts Neues. Caching ist dann sinnvoll, wenn Daten mit (zeit)aufwendigen Tasks generiert werden m&uuml;ssen, und eigentlich f&uuml;r mehrere User &uuml;ber einen l&auml;ngeren Zeitraum unver&auml;ndert bleiben. Mit ASP.NET haben Sie nun neue M&ouml;glichkeiten Caching gezielt und einfach in Ihren Web Seiten zu implementieren.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20011002</ArticleId>
<title><![CDATA[XTune Revisited]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.10.2001]]></date>
<description><![CDATA[Mit XTune wird das Einstellen von Performance-relevanten Parametern des Webserver und einzelner Websites erheblich erleichtert. Vor mehr als einem Jahr haben wir uns auf AspHeute bereits einmal mit dem XTune Tool besch&auml;ftigt, im Artikel <i>Webserver-Tuning mit XTune</i>. Damals war es die Version 1.0, heute werden wir uns die neu herausgegebene Version 2.0 ansehen.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20011001</ArticleId>
<title><![CDATA[Bannerzwang]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[1.10.2001]]></date>
<description><![CDATA[Viele User die im Netz surfen verwenden sogenannte Banner-Blocker, mit denen Werbebanner abgeblockt werden - ein bekanntes Tool aus dieser Kategorie w&auml;re der WebWasher. Allerdings gibt es am Internet viele Websites, die ihre Inhalte zu einem guten Teil &uuml;ber Bannerwerbung auf ihren Seiten finanzieren. F&uuml;r diese Websites sind Tools wie der WebWasher wahrlich eine "Killerapplikation", da diese die Einnahmequelle effektiv herausfiltern.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010928</ArticleId>
<title><![CDATA[Schlu&szlig; mit lustig Teil 3 - das Hfnetchk Tool]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[28.9.2001]]></date>
<description><![CDATA[Im dritten Teil dieser "Wie sichere ich meinen Web Server gegen 'Se Evil Folks' ab" Serie stelle ich Ihnen das Hfnetchk Tool oder ausgeschrieben das Microsoft Network Security Hotfix Checker Tool vor. Die Vorg&auml;ngerversion, das "IIS 5.0 Hotfix Checking Tool", hatte den Nachteil da&szlig; "nur" der IIS auf das Vorhandensein von Hotfixes hin uuml;berpr&uuml;ft wurde. Das Hfnetchk Tool hingegen kann nun einiges mehr. Dies und wie man eine &Uuml;berpr&uuml;fung automatisert bzw. per Email versenden kann, lesen Sie in diesem Artikel.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010927</ArticleId>
<title><![CDATA[Schlu&szlig; mit lustig Teil 2 - das URLScan Tool]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[27.9.2001]]></date>
<description><![CDATA[Um Administratoren die Arbeit zu erleichtern hat Microsoft ein weiteres Sicherheitstool bereitgestellt - das URLScan Tool. Dieses analysiert die Requests auf den IIS Web Server und je nach Konfiguration werden die Requests akzeptiert oder
oder verweigert. Dieser Artikel zeigt Ihnen wie man das Tool je nach Firmen-Webseitencontent anpa&szlig;t und wie es auf potentielle Attacken reagiert.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010926</ArticleId>
<title><![CDATA[Schlu&szlig; mit lustig - das IIS Lockdown Tool]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[26.9.2001]]></date>
<description><![CDATA[Das Leben eines Administators ist von st&auml;ndigen Herausforderungen und gro&szlig;er Verantwortung gepr&auml;gt. Besonders wenn dieser neben der Wartung des Firmennetzwerkes (und den damit verbundenen Problemen) zus&auml;tzlich f&uuml;r die Wartung der Firmen-Webserver verantwortlich ist.  Im Moment ist der Nimda Virus aktuell, der den Administratoren wieder einiges an Arbeit beschert, damit diese einen eventuellen Schaden gering halten. Dieser Artikel soll u.a. die Risken und Nebenwirkungen des von Microsoft downloadbaren "IIS Lockdown Tool" besprechen.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010925</ArticleId>
<title><![CDATA[Verwendung von XML-Schemas (XSD)]]></title>
<author><![CDATA[Frederic Ganner]]></author>
<date><![CDATA[25.9.2001]]></date>
<description><![CDATA[Dieser Artikel wird sich anhand eines praktischen Beispiels mit der Verwendung von XML-Schemas besch&auml;ftigen. Eine der wichtigsten Neuerungen in XSD ist die umfangreiche Unterst&uuml;tzung von Datentypen. Durch sie k&ouml;nnen beim Austausch von XML-Daten die Datentypen bewahrt werden...]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20010924</ArticleId>
<title><![CDATA[Unknackbare Verschl&uuml;sselung mit Onetime Pads]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[24.9.2001]]></date>
<description><![CDATA[Im Zuge der Terrorangriffe auf das World Trade Center ist - wieder einmal - eine Debatte zur Rolle von Verschl&uuml;sselungstechnologien in der Kommunikation von Terroristen ins Laufen gekommen. Hauptaugenmerk wird in solchen Debatten immer auf sogenannte Hintert&uuml;ren (Backdoors) f&uuml;r die Regierungsbeh&ouml;rden in Verschl&uuml;sselungsalgorithmen gelegt. Allerdings entbehrt die gesamte Diskussion nicht einer gewissen L&auml;cherlichkeit: es gibt n&auml;mlich einen unknackbaren Verschl&uuml;sselungsalgorithmus]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010921</ArticleId>
<title><![CDATA[Erstellung eines Intranets in ASP (Teil 5) - Application Day]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[21.9.2001]]></date>
<description><![CDATA[Zum letzten Teil der Artikelserie zur Erstellung eines Intranets mit ASP hei&szlig;e ich Sie herzlich willkommen. Nachdem wir in den bisherigen Artikel unser Hauptaugenmerk auf theoretische Aspekte und grundlegende Programmierung des Intranets gelegt hatten, werden wir heute fast ausschlie&szlig;lich die Programmierung von Anwendungen f&uuml;r das Intranet fokusieren.]]></description>
<category><![CDATA[ASPIntranet.de]]></category>
</article>
<article>
<ArticleId>20010920</ArticleId>
<title><![CDATA[Erstellung eines Intranets in ASP (Teil 4) - Mitarbeiter]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[20.9.2001]]></date>
<description><![CDATA[Auch heute hei&szlig;e ich Sie wieder herzlich willkommen - und zwar zum vierten Teil der Artikelserie zur Erstellung eines Intranets mit ASP. Heute werden wir den bereits aus dem zweiten Teil bekannten Setup-Assistenten in abgewandelter Form als Mitarbeiterassitenten bereitstellen. Au&szlig;erdem werden wir eine Treeview zur Mitarbeiterverwaltung entwickeln. Zur Navigation innerhalb des Intranets werden wir eine Navigationsleiste programmieren.]]></description>
<category><![CDATA[ASPIntranet.de]]></category>
</article>
<article>
<ArticleId>20010919</ArticleId>
<title><![CDATA[Erstellung eines Intranets in ASP (Teil 3) - Navigation]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[19.9.2001]]></date>
<description><![CDATA[Hiermit begr&uuml;&szlig;e ich Sie zum dritten Teil der Artikelserie zur Erstellung eines Intranets mit Active Server Pages. Wir werden heute eine Outlook-&auml;hnliche Leiste sowie die dazugeh&ouml;rige Administration programmieren, die die Navigation f&uuml;r unser Intranet darstellt.]]></description>
<category><![CDATA[ASPIntranet.de]]></category>
</article>
<article>
<ArticleId>20010918</ArticleId>
<title><![CDATA[Erstellung eines Intranets in ASP (Teil 2) - Setup]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[18.9.2001]]></date>
<description><![CDATA[Herzlich willkommen zum zweiten Teil der Artikelserie zur Erstellung eines Intranets in ASP. Nachdem wir uns gestern im ersten Teil die Grundlagen und erste Code-Snippets erarbeitet haben, wollen wir heute das Setup via ASP in Angriff nehmen. Selbst wenn Sie nicht das gesamte Intranet einsetzen, denke ich, da&szlig; der erste Screenshot Ihr Interesse an dieser Setupapplikation wecken wird!]]></description>
<category><![CDATA[ASPIntranet.de]]></category>
</article>
<article>
<ArticleId>20010917</ArticleId>
<title><![CDATA[Erstellung eines Intranets in ASP - Grundlagen]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[17.9.2001]]></date>
<description><![CDATA[Herzlich willkommen zum ersten Teil einer mehrteiligen Artikelserie zur Erstellung eines Intranets in ASP am Beispiel von ASPIntranet.de. In diesem Teil werden wir auf die Anforderungen und Grundlagen unseres Intranets eingehen. Au&szlig;erdem werden wir unseren Server konfigurieren, die Tabellenstruktur erarbeiten und einige grundlegende Prozeduren und Funktionen erstellen.]]></description>
<category><![CDATA[ASPIntranet.de]]></category>
</article>
<article>
<ArticleId>20010914</ArticleId>
<title><![CDATA[PDF Dokumente suchbar machen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[14.9.2001]]></date>
<description><![CDATA[Auf Firmenwebsites finden sich sehr oft Dokumente im Adobe Acrobat PDF (Portable Document Format) Format, da sich mit ihnen das Layout &uuml;ber verschiedenste Plattformen hinweg bewahren l&auml;&szlig;t, womit sie ideal f&uuml;r
Produktbeschreibungen oder Handb&uuml;cher sind. Wie aber schafft man es, dem Besucher der Website die Inhalte dieser Dokumente in einem Suchformular zur Verf&uuml;gung zu stellen?]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010913</ArticleId>
<title><![CDATA[Wetterbericht per SMS versenden]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[13.9.2001]]></date>
<description><![CDATA[Den gescrapten Content einer Website kann man vielseitig weiterverwerten. Wenn es sich bei der Website  um eine Wetterprognoseseite handelt kann man z.B, abgelegt in einer Datenbank, eine statistische Auswertung erstellen. Oder wie in diesem Artikel gezeigt, per SMS (Short Message Service) Nachricht die Informationen zum Handy eines Segelkollegen schicken. Diese Aufgabe wird mittels C# und dem .NET Framework gel&ouml;st.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010912</ArticleId>
<title><![CDATA[SMS versenden in .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[12.9.2001]]></date>
<description><![CDATA[Ein &auml;u&szlig;erst beliebtes Handyfeature ist heutzutage die SMS, oder in der Langform das Short Message System. Es gibt viele Websites am Netz, von wo aus man seine SMS gratis abschicken kann - meist Werbung mitinkludiert. Heute m&ouml;chte ich vorstellen, wie man SMS selbst versenden kann, und zwar mit Hilfe verschiedener Framework Klassen.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010911</ArticleId>
<title><![CDATA[Webseiten automatisiert scrapen, Teil 2]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[11.9.2001]]></date>
<description><![CDATA[Im letzten Artikel haben wir die Webseite "as is" in die Datenbank geschrieben, heute parsen wir den Content einer Wetterberichtsseite auf, d.h. wir befreien den gescrapten Content der Webseite von den Html Tags und schreiben die Informationen sortiert nach Themengebieten wieder in eine SQL Datenbank. Die in C# geschriebene Konsolenanwendung l&auml;&szlig;t sich dann wiederum als Scheduled Task automatisch nach einer vordefinierten Zeit ausf&uuml;hren.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010910</ArticleId>
<title><![CDATA[Webseiten automatisiert scrapen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[10.9.2001]]></date>
<description><![CDATA[Viele Webseiten bieten einen aktuellen Wetterbericht an. Um diesen f&uuml;r eigene Zwecke verwerten zu k&ouml;nnen, mu&szlig; man die Webseite scrapen, aufparsen, und dann in das eigene Layout einbinden (rechtliche Probleme einmal dahingestellt). Allerdings ist es nicht klug, auf jeder eigenen Seite f&uuml;r jeden User neu zu scrapen - es reicht, dies automatisiert alle x Minuten oder Stunden zu machen, und den gescrapten Content in eine Datenbank zu schreiben.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010803</ArticleId>
<title><![CDATA[Meta Tags von fremden Seiten parsen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.8.2001]]></date>
<description><![CDATA[Mit diesem Artikel greife ich eine Frage aus der aspDEcoffeehouse Liste von AspGerman auf - wie kann man, wenn man eine Seite einer fremden Website als String vor sich hat, die Meta Tags daraus extrahieren, und dann mit den Namen/Werten weiterarbeiten? Wie bei den AspGerman Listen so &uuml;blich, gab es eine L&ouml;sung.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010802</ArticleId>
<title><![CDATA[Web.Config 101]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[2.8.2001]]></date>
<description><![CDATA[Die web.config Datei ist eine auf XML basierende, hierarchisch aufgebaute Textdatei die eine Vielzahl von Einstellungsm&ouml;glichkeiten f&uuml;r Ihre ASP.NET Applikationen erlaubt. Angefangen von Applikationseinstellungen, &uuml;ber DSN bis hin zu Optionen f&uuml;r Web Services. Der hierachische Aufbau erlaubt eine &uuml;bersichtliche Gliederung und somit wird die Anpassung der web.config zum Kinderspiel. Da&szlig; dies nicht nur ein Marketingschlagwort ist, soll dieser 
Einf&uuml;hrungsartikel zeigen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20010801</ArticleId>
<title><![CDATA[Smart Tags auf die Finger geschaut]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[1.8.2001]]></date>
<description><![CDATA[Das Smart Tags Feature des Internet Explorer 6 lie&szlig; die Wogen hoch gehen, vor allem, da dadurch "hinterr&uuml;cks" am Content einer Web Site herumgebastelt werden kann. Da nun einige Zeit seit dieser Debatte ins Land gegangen ist, sehen wir uns nun einmal genauer an, was Smart Tags sind, wie man sie verwendet, wie man sie abschaltet, und wie man eigene programmieren kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010731</ArticleId>
<title><![CDATA[Datenimport von Access nach MySQL]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[31.7.2001]]></date>
<description><![CDATA[Wer z.B. von MS Access auf MySQL umsteigen m&ouml;chte, der fragt sich nicht zuletzt, wie denn seine Daten von Access nach MySQL &uuml;bertragen werden k&ouml;nnen. Mit der Installation von MySQL werden einige Tools mit ausgeliefert, die diese Arbeit &uuml;bernehmen. Auch gibt es im Internet diverse  Zusatzprogramme, die entsprechende Import/Exportfunktionen integriert haben.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010730</ArticleId>
<title><![CDATA[Administration von MySQL unter Windows 2000]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[30.7.2001]]></date>
<description><![CDATA[Wer den MySQL-Datenbankserver erfolgreich installiert hat, sucht mehr oder weniger verzweifelt eine entsprechende graphische Oberfl&auml;che - wie man sie von Access oder dem MS-SQL-Server her kennt. Leider findet man hierzu nur den "SQLManager", der in seiner Bedienung und von der Oberfl&auml;che her alles andere als komfortabel ist.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010703</ArticleId>
<title><![CDATA[Web Services einfach konsumieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[3.7.2001]]></date>
<description><![CDATA[Web Services sind dazu da um konsumiert zu werden! Die Erstellung eines Web Services mit klassischen Entwicklungstools wie Visual Basic 6 und Active Server Pages ist ja Dank des Microsoft SOAP Toolkits relativ einfach. Nach der Erstellung des Web Service soll der Client aber auch die Dienste benutzen, d.h. konsumieren k&ouml;nnen. Dieser Artikel zeigt Ihnen anhand eines einfachen Beispiels, wie das mit Hilfe des SOAP Toolkits geht.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20010702</ArticleId>
<title><![CDATA[Asynchrone Programmierung mit Message Queues]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.7.2001]]></date>
<description><![CDATA[Ein Problem sowohl f&uuml;r Web Sites als auch "normale" Anwendungen sind externe "Komponenten", die entweder &uuml;ber eine langsame Verbindung angesprochen werden m&uuml;ssen, oder (sehr) lange zur Abarbeitung brauchen. Ist man nicht gezwungen auf das Resultat zu warten, kann man die Performance seiner Applikation enorm steigern: mit Message Queueing.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010629</ArticleId>
<title><![CDATA[Web Services mit dem SOAP Toolkit erstellen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[29.6.2001]]></date>
<description><![CDATA[Web Services sind keine Exklusivveranstaltung von ASP.NET. Man kann auch mit "klassischen" Entwicklungstools wie Visual Basic 6 und Active Server Pages einen &uuml;ber SOAP (Simple Object Access Protocol) kommunizierenden Web Service 
erstellen. Zur Erleichterung der Entwicklung stellt Microsoft das SOAP Toolkit gratis zur Verf&uuml;gung. Dieser Artikel stellt Ihnen dieses anhand eines einfachen Web Services vor.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20010628</ArticleId>
<title><![CDATA[Onlinestatus des Users &uuml;ber RemoteScripting ermitteln]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[28.6.2001]]></date>
<description><![CDATA[Eine der interessantesten Fragen ist doch immer wieder, wieviele User jetzt gerade in unserem Webangebot "online" sind. Hier gibt es sicherlich verschiedene Ansatzpunkte, um diese Frage zu beantworten. Einerseits k&ouml;nnte man &uuml;ber Sessionvariablen verschiedene Events ausl&ouml;sen. Ich m&ouml;chte Ihnen heute eine weitere Variante vorstellen, die die Vorz&uuml;ge des RemoteScripting entsprechend nutzt.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010627</ArticleId>
<title><![CDATA[Session State in ASP.NET Web Services]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[27.6.2001]]></date>
<description><![CDATA[Wenn man Web Services in ASP.NET programmiert, dann bekommt man ein bequemes Feature frei Haus geliefert - man kann Session State verwenden, und zwar v&ouml;llig gleich zu normalen ASP.NET Seiten. Nur ein einziges Attribut mu&szlig; gesetzt werden, und schon kann man zB ein einfaches Loginsystem
f&uuml;r Web Services basteln.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20010626</ArticleId>
<title><![CDATA[Stored Procedures 101 in ADO.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[26.6.2001]]></date>
<description><![CDATA[Manche (in grauer Vorzeit implementierte) Sachen funktionieren so gut, da&szlig; man sie auch weiterhin verwendet. So auch Stored Procedures. Auf diese mu&szlig; n&auml;mlich in ADO.NET nicht verzichtet werden. Bis auf die 
Anpassungen f&uuml;r den ADO.NET Code hat sich eigentlich nichts ver&auml;ndert. Und diese &Auml;nderungen stellen das heutige Artikelthema dar.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20010625</ArticleId>
<title><![CDATA[Html Emails mit Dundas Mailer verschicken]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.6.2001]]></date>
<description><![CDATA[Emailkomponenten gibt es wie Sand am Meer - allerdings unterst&uuml;tzen nicht alle das Versenden von Html Emails, und wenn, dann kosten sie Geld, oder h&auml;ngen Werbung an jede Email an. Heute stelle ich Ihnen Dundas Mailer vor, das vollst&auml;ndig gratis ist, Html Emails mit eingebetteten Images verschicken kann, und keine Restriktionen in der Funktionalit&auml;t mit sich bringt.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010622</ArticleId>
<title><![CDATA[Web Services in Anwendungen konsumieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[22.6.2001]]></date>
<description><![CDATA[Im Artikel "Web Services 101 in ASP.NET" habe ich gezeigt, wie einfach es ist, einen Web Service zu programmieren. Heute begeben wir uns auf die andere Seite der Front, n&auml;mlich auf die Kundenseite: wir wollen lernen, wie man einen Web Service anspricht und seine Funktionen aufruft - ihn "konsumiert".]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20010621</ArticleId>
<title><![CDATA[Web Services 101 in ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[21.6.2001]]></date>
<description><![CDATA[Das Simple Object Access Protocol (SOAP) ist als Protokoll f&uuml;r Web Services schon seit langer Zeit in aller Munde, allerdings fehlte bis jetzt unter IIS eine einfache Entwicklungsplattform, um Web Services zu programmieren. Diese haben
wir nun mit ASP.NET in der Hand, und ich werde Ihnen heute zeigen, wie leicht man Web Services in C# als auch VB.NET entwickeln kann.]]></description>
<category><![CDATA[Web Services]]></category>
</article>
<article>
<ArticleId>20010620</ArticleId>
<title><![CDATA[Intelligente Meta-Tags]]></title>
<author><![CDATA[Dario Nuevo]]></author>
<date><![CDATA[20.6.2001]]></date>
<description><![CDATA[Wir alle wissen, da&szlig; Meta-Tags f&uuml;r eine gute Indexierung in den Suchmaschinen wichtig sind. Doch leider ist es so, da&szlig; man beim Erstellen einer Homepage nicht immer Zeit findet, bei jedem Dokument die Meta-Tags 
dementsprechend anzupassen. Aus diesem Grund m&ouml;chte ich Ihnen mit diesem Artikel eine bequeme Art und Weise vorstellen, wie wirklich jedes Dokument in Ihrem Projekt die passenden Meta-Tags bekommt.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010619</ArticleId>
<title><![CDATA[Transaktionen in C# Business Tier Komponenten]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.6.2001]]></date>
<description><![CDATA[Im Laufe der Zeit hat man sich ja sozusagen die COM+ Applikationen (aka MTS Packages) angew&ouml;hnt, und zwar einerseits als Object Broker, und andererseits als Provider von Transaktionen &uuml;ber Komponentengrenzen
hinweg. Heute werde ich zeigen, da&szlig; das erworbene Wissen auch in .NET verwendbar ist - und die Anwendung sogar deutlich leichter geworden ist!]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010618</ArticleId>
<title><![CDATA[Installation und Konfiguration von MySQL unter Windows 2000 Professional]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[18.6.2001]]></date>
<description><![CDATA[Access (Jet) Datenbanken sind klare Grenzen gesetzt sind - in der Anzahl der gleichzeitigen Benutzer, und speziell in der Performance. Dieses Problem zu l&ouml;sen bedeutet meistens den Wechsel der Datenbank, hin zu einem dezidierten Datenbank(server)system wie zum Beispiel SQL Server, Oracle, Sybase oder auch MySQL. Aus Kostengr&uuml;nden f&auml;llt dabei die Wahl immer &ouml;fter auf MySQL, das auch f&uuml;r kommerzielle Verwendung v&ouml;llig gratis verwendbar ist. Im heutigen Artikel m&ouml;chte ich insbesondere auf die Installation von MySQL unter dem Betriebssystem Windows 2000 Professional eingehen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010608</ArticleId>
<title><![CDATA[Formular-basierte Basic Authentication]]></title>
<author><![CDATA[Anonymisiert]]></author>
<date><![CDATA[8.6.2001]]></date>
<description><![CDATA[Basic Authentication ist an und f&uuml;r sich eine sehr praktische und einfache M&ouml;glichkeit ganze Verzeichnisse (und deren Inhalt - unabh&auml;ngig welchen Dateiformats) zu sch&uuml;tzen. Die im nachfolgenden gezeigte Methode soll nun zwei entscheidende Nachteile von Basic Authentication beheben: die unsch&ouml;ne Login-Dialogbox und die Verzeichnisauswahl via URL.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010607</ArticleId>
<title><![CDATA[Daten aus CSV-Dateien in MDBs importieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[7.6.2001]]></date>
<description><![CDATA[Manchmal stellt sich einem die Aufgabe, Datenbanksysteme aus irgendwelchen Gr&uuml;nden zu wechseln. Die Daten m&uuml;ssen transferiert werden - und als kleinster gemeinsamer Nenner zwischen den Systemen bleibt meist nur das CSV Format. Dieser Artikel zeigt einen von vielen Wegen um eine CSV-Datei in eine Access Datenbank zu konvertieren - und das, ohne da&szlig; Access installiert sein mu&szlig;.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010606</ArticleId>
<title><![CDATA[RemoteScripting - Einf&uuml;hrung, Tips und Tricks]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[6.6.2001]]></date>
<description><![CDATA[Mit der RemoteScripting (RS) - Technologie hat Microsoft dem ASP-Programmierer wieder eine M&ouml;glichkeit an die Hand gegeben, seine Webseiten aus der Sicht des Clients attraktiver zu gestalten. Um durch vom Client  ausgel&ouml;ste Aktionen auszuwerten, mu&szlig; die entsprechende ASP-Seite nicht neu geladen werden.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010605</ArticleId>
<title><![CDATA[CSVs aus MDBs leicht gemacht]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[5.6.2001]]></date>
<description><![CDATA[CSV (Comma Separated Value) Dateien bieten eine einfache Schnittstelle zwischen unterschiedlichen Datenbanksystem, um Daten untereinander auszutauschen. Dies ist vor allem dann von Interesse, wenn es auf dem Zielsystem keine passende Konvertierungsm&ouml;glichkeit gibt. Der heutige Artikel zeigt ein Beispiel, das eine Access Datenbank in das CSV Format konvertiert.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010601</ArticleId>
<title><![CDATA[Sicherheitsaspekte bei der Gestaltung von ASP Sites ohne Cookies]]></title>
<author><![CDATA[Rene Drescher-Hackel]]></author>
<date><![CDATA[1.6.2001]]></date>
<description><![CDATA[Jeder, der sich mit der Erstellung komplexer ASP-Anwendungen besch&auml;ftigt, hat sich die Frage beantworten m&uuml;ssen, ob er denn nun Cookies einsetzt oder nicht. Denn h&auml;ufig besteht das Problem, wie sich die ASP-Anwendung z.B. den Anmeldestatus eines Besuchers der  Website merkt. Eine L&ouml;sung sind die Session-Variablen. Doch da w&auml;ren wir wieder beim (tempor&auml;ren) Cookie.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010531</ArticleId>
<title><![CDATA[Keine gefakten Bestellungen mehr!]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[31.5.2001]]></date>
<description><![CDATA[Wenn man Kunden die M&ouml;glichkeit bietet, Produkte online zu bestellen, sollte man auf jeden Fall die eingegebenen Daten (Name, Emailadresse, Kreditkarteninformationen, etc.) &uuml;berpr&uuml;fen, bevor der Kunde 
die Bestellung abschicken kann. Dies erspart unn&ouml;tigen &Auml;rger &uuml;ber falsche Angaben die eine Bestellung wertlos machen k&ouml;nnen.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010530</ArticleId>
<title><![CDATA[Redirects mit Frame-Targets]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.5.2001]]></date>
<description><![CDATA[Eine der h&auml;ufigeren Fragen in den ASP Listen ist ob und wie man dem Befehl <i>Response.Redirect</i> ein Frame Target angeben kann. Die Antwort darauf ist nein, denn Frames sind ein clientseitiges Konzept, von dem ASP nichts wei&szlig;. Aber - was hindert uns, dem Client clientseitigen Code zu schicken, die gew&uuml;nschte Seite in einem anderen Frame zu laden?]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010529</ArticleId>
<title><![CDATA[Wieviele User sind online?]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[29.5.2001]]></date>
<description><![CDATA[Oftmals ist es bei einer Website interessant zu wissen, wieviele Benutzer gerade "gleichzeitig" auf der Site aktiv sind. Dies l&auml;&szlig;t sich unter Verwendung von Bordmitteln leicht und ohne gro&szlig;en Aufwand realisieren. Dieser Artikel zeigt Ihnen anhand eines einfachen Beispiels einen L&ouml;sungsansatz.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010528</ArticleId>
<title><![CDATA[Aber bitte mit Rijndael]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.5.2001]]></date>
<description><![CDATA[DES ist mittlerweile sehr in die Jahre gekommen, und die j&auml;hrlichen Challenges beweisen, da&szlig; die (Verschl&uuml;sselungs-)St&auml;rke von DES den heutigen Anforderungen an Sicherheit nicht mehr gewachsen ist. Daher wurde vom NIST eine Ausschreibung f&uuml;r den Nachfolger AES (Advanced Encryption Standard) gestartet, den der Algorithmus Rijndael gewann.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010523</ArticleId>
<title><![CDATA[ReportMagic f&uuml;r Analog]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.5.2001]]></date>
<description><![CDATA[Ich habe bereits im letzten Artikel gezeigt, da&szlig; Analog ein hervorragendes Tool zum Auswerten von Logfiles ist. Aber bei der visuellen Aufbereitung hapert es etwas. Dem kann aber abgeholfen werden - mit ReportMagic f&uuml;r Analog.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010522</ArticleId>
<title><![CDATA[Die SQL2Table Komponente]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[22.5.2001]]></date>
<description><![CDATA[Daten aus einer Datenbank &uuml;bersichtlich anzuzeigen bzw. Daten webbasierend hinzuzuf&uuml;gen oder zu editieren ben&ouml;tigt in ASP einige Zeilen Code. Die SQL2Table Komponente schafft hier eine angenehme Abhilfe. Diese
stellt einige Funktionen zur Verf&uuml;gung, die dem Programmierer einiges an Arbeit abnehmen.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010521</ArticleId>
<title><![CDATA[ASP-basierte Basic Authentication]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[21.5.2001]]></date>
<description><![CDATA[Die verschiedenen Authentifizierungsmethoden des IIS sollten zumindest grob bekannt sein: Integrated, Digest und Basic Authentication, absteigend gelistet nach ihrer sicherheitstechnischen Integration mit Windows NT. Alle haben eines gemeinsam - sie greifen f&uuml;r die Validierung der Benutzeraccounts auf NT Accounts durch. Heute wollen wir Basic Authentication dazu &uuml;berreden, unsere von NT unabh&auml;ngigen Accounts zu validieren.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010518</ArticleId>
<title><![CDATA[Broken Links mit Link Sleuth erfassen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[18.5.2001]]></date>
<description><![CDATA[URLs auf eigenen oder fremden Sites k&ouml;nnen mit der Zeit durch Content&auml;nderung oder Restrukturierung der Site ung&uuml;ltig werden. Da&szlig; das &Uuml;berpr&uuml;fen der einzelnen Links bei umfangreichen Websites eine unn&ouml;tige Tortur ist, brauche ich Ihnen nicht zu beweisen. Daf&uuml;r gibt es spider&auml;hnliche Software, die solche Aufgaben per Konpfdruck und ohne viel m&uuml;hsames Zutun erledigen. Eine solche Applikation ist Xenu's Link Sleuth - und diese ist kostenlos.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010517</ArticleId>
<title><![CDATA[Gratis Loganalyse mit Analog]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[17.5.2001]]></date>
<description><![CDATA[Das Auswerten von Logdateien erf&uuml;llt meist mehrerlei Zwecke: technisch, um die Site zu verbessern, sicherheitstechnisch, um Hack-Attacken zu finden, oder beancounter-m&auml;&szlig;ig, um dem Management zu vermitteln, wer auf die Website zugreift - und was er sich dabei ansieht, und so weiter. Es gibt viele Tools, allerdings kosten die meisten davon viel (oder sehr viel). Heute werden wir uns die Grundlagen eines Tools erarbeiten, das gratis ist: Analog.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010516</ArticleId>
<title><![CDATA[Kommandozeilen-Programme aufrufen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[16.5.2001]]></date>
<description><![CDATA[Wie (hoffentlich) allgemein bekannt ist, kann man u.a. mit dem Windows Scripting Host Programme ausf&uuml;hren lassen. In diesem Artikel wollen wir uns aber nur mit der Ausf&uuml;hrung von Konsolenanwendungen besch&auml;ftigen, diese aber mittels WSH von ASP aus aufrufen. Wir ordnen der Anwendung eine f&uuml;r jeden Benutzer separate Output-Pipe zu, die den von der Anwendung produzierten Output in eine Datei schreibt. Diesen Inhalt wollen wir dann einfach in ein Browserfenster dumpen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010515</ArticleId>
<title><![CDATA[Universal Data Links mit ASP verwenden]]></title>
<author><![CDATA[Thomas Rüger]]></author>
<date><![CDATA[15.5.2001]]></date>
<description><![CDATA[Mit ASP gibt es viele M&ouml;glichkeiten um auf eine Datenbank zuzugreifen.
Neben ODBC und direkter Codierung gibt es auch noch die Verwendung von Universal Data Links (UDL). Dieser Artikel gibt Ihnen einen Walkthrough durch die Erstellung von Universal Data Link Dateien (Erweiterung *.udl) und erl&auml;utert auch die Vorteile die sich durch ihre Verwendung ergeben.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010514</ArticleId>
<title><![CDATA[Was sind XML Schemas?]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[14.5.2001]]></date>
<description><![CDATA[Dieser Artikel soll Ihnen Antworten auf die wichtigsten Fragen zum Thema XML Schemas (XSD) geben - wozu dienen eigentlich XML Schemas, welche Vorteile haben sie und warum sind diese den DTDs vorzuziehen.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20010511</ArticleId>
<title><![CDATA[Tabellenexistenz in Datenbanken &uuml;berpr&uuml;fen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[11.5.2001]]></date>
<description><![CDATA[Im Normalfall wei&szlig; man, wenn man mit einer Datenbank arbeitet, welche Tabellen in ihr enthalten sind. Andererseits gibt es aber Anwendungsf&auml;lle, wo man erst zur Laufzeit auf eine Datenbank connected, und dann dynamisch herausfinden mu&szlig;, welche Tabellen es gibt, oder &uuml;berpr&uuml;fen mu&szlig;, ob eine spezielle Tabelle existiert.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010510</ArticleId>
<title><![CDATA[Beliebige Anzahl von Dateien uploaden]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[10.5.2001]]></date>
<description><![CDATA[Dieser Artikel bietet ein Beispiel, das dem Benutzer die M&ouml;glichkeit gibt mittels einer kostenlosen ASP Komponente eine von ihm frei w&auml;hlbare Anzahl von Dateien auf einen Webserver upzuloaden. Der Artikel erkl&auml;rt zun&auml;chst die f&uuml;r die Einrichtung der ASP Komponente n&ouml;tigen Installationsschritte und dann wird die L&ouml;sung mittels ASP programmiert.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010509</ArticleId>
<title><![CDATA[Neue Inhalte einer Web Site f&uuml;r den Benutzer hervorheben]]></title>
<author><![CDATA[Frederic Ganner]]></author>
<date><![CDATA[9.5.2001]]></date>
<description><![CDATA[Es gibt bestimmte Web Sites, auf die wir regelm&auml;&szlig;ig zugreifen. Gerade hier ist es von Vorteil auf den ersten Blick zu sehen, welche Beitr&auml;ge neu und welche schon bekannt sind. Am einfachsten ist das mit Hilfe hervorhebender Grafiken zu erreichen  - vor allem farbliche Unterschiede erh&ouml;hen die Aufnahmegeschwindigkeit dieser relevanten Informationen um ein Vielfaches.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010508</ArticleId>
<title><![CDATA[Dateizugriff auf Netzlaufwerken]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[8.5.2001]]></date>
<description><![CDATA[Ein beliebtes Sorgenkind unter ASP Programmierern ist der Zugriff auf Dateien, die sich auf Netzlaufwerken (Shares) befinden. Der Grund der Probleme ist die NT Sicherheit, und heute werde ich Ans&auml;tze vorstellen, um den Zugriff auf Netzlaufwerke (a) zu erm&ouml;glichen, und (b) m&ouml;glichst sicher zu bewerkstelligen.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010507</ArticleId>
<title><![CDATA[Web-basiertes Dateimanagement mit dem ASP FileMan]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[7.5.2001]]></date>
<description><![CDATA[Die ASP FileMan(ager) Applikation bietet umfassende Dateimanagementoptionen f&uuml;r eine Webseite in Verbindung mit dem IIS. Sie k&ouml;nnen basierend auf Benutzerrichtlinien (NT Authentifizierung) Dateien up- bzw. downloaden, oder Dateien manipulieren - und sogar Komprimierungsm&ouml;glichkeiten sind enthalten. Sie k&ouml;nnen also bequem &uuml;ber ASP (Ihre) Dateien verwalten. Dieser Artikel bietet Ihnen eine kurze Anleitung zur Installation und Konfiguration dieser kostenlosen ASP Applikation.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010504</ArticleId>
<title><![CDATA[Script-basierte IIS Administration]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[4.5.2001]]></date>
<description><![CDATA[Da&szlig; man den IIS mit dem Internet Services Manager administrieren kann, d&uuml;rfte jedem bekannt sein. Da&szlig; man allerdings die Administration auch mit Hilfe von ASP oder WSH Scripts bewerkstelligen kann - ohne funktionale Abstriche machen zu m&uuml;ssen - das wissen nur wenige.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010503</ArticleId>
<title><![CDATA[Eine einfache Newsletter Applikation]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[3.5.2001]]></date>
<description><![CDATA[Um Besucher bzw. Kunden immer am neuesten Stand Ihres Website-Inhaltes oder z.B &uuml;ber neue Produkte zu informieren, k&ouml;nnen Sie dies mit Hilfe eines Email-basierenden Newsletters erreichen. Bei mehreren Besuchern lohnt es sich aber schon auf sogenannte Newsletter Applikationen zur&uuml;ckzugreifen, die die Administration und den Vorgang des Aussendens der (vielen) Emails erleichtern. Dieser Artikel stellt Ihnen eine einfache und kostenlose L&ouml;sung vor.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010502</ArticleId>
<title><![CDATA[Logfiles mit Access auswerten]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.5.2001]]></date>
<description><![CDATA[Das Auswerten von Logdateien ist eine wichtige Angelegenheit - man erf&auml;hrt nicht nur, woran die Kunden am meisten interessiert sind, sondern auch, wo sich Fehler in einer Website eingeschlichen haben als auch ob jemand versucht hat, die Website zu cracken. Es gibt sehr viel hervorragende Reportingsoftware, die aber die ad hoc Abfragem&ouml;glichkeit einer Datenbank vermissen lassen.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010426</ArticleId>
<title><![CDATA[Seitenzugriffscounter f&uuml;r HTML Dokumente in ASP realisieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[26.4.2001]]></date>
<description><![CDATA[Zugriffsz&auml;hler gibt es im Internet viele - aber warum sollte man sich einen solchen nicht selbst implementieren? Solange man immer nur mit ASP-Seiten zu tun hat, ist dies auch nicht weiter schwer - sollen aber aktuelle Zugriffszahlen in statische HTML Seiten eingef&uuml;gt werden, mu&szlig; man schon etwas tiefer in die Trickkiste greifen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010425</ArticleId>
<title><![CDATA[ASP-basierte resumable Downloads]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.4.2001]]></date>
<description><![CDATA[Ein Feature des Internet Information Servers, das irgendwie eine "vergessene Perle" zu sein scheint ist das der resumable Downloads - einen Download an der Stelle weiterzumachen, an der er zuletzt abgebrochen hat/wurde. Zwar gilt dieses IIS Feature nur f&uuml;r statische Dateien, allerdings kann man auch ASP
resumable Downloads beibringen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010424</ArticleId>
<title><![CDATA[Ein Baummen&uuml; mit XTree Server erstellen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[24.4.2001]]></date>
<description><![CDATA[Mit XTree k&ouml;nnen Sie entweder eine &uuml;bersichtliche Dokumenten- oder Sitenavigation erstellen. Die Treeeintr&auml;ge werden in der "Server" Version in einer MS Access Datenbank verwaltet und  &uuml;ber ein XSLT als Html gerendert. Die Konfiguration ist nicht besonders aufwendig und XTree ist noch dazu kostenlos downloadbar.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20010423</ArticleId>
<title><![CDATA[Tracing in ASP]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.4.2001]]></date>
<description><![CDATA[Die M&ouml;glichkeiten f&uuml;r ein vern&uuml;nftiges Tracing unter ASP sind eingeschr&auml;nkt, da man sich mit Response.Write Statements entweder das Layout zerst&ouml;rt, oder im Falle von notwendigen Redirects &uuml;berhaupt gro&szlig;e Probleme bekommt. Man k&ouml;nnte also glauben, da&szlig; es keine coole L&ouml;sung gibt - aber schlie&szlig;lich hei&szlig;t glauben nicht wissen!]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010420</ArticleId>
<title><![CDATA[Ein einfacher Query Analyzer]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[20.4.2001]]></date>
<description><![CDATA[Der heutige Artikel befa&szlig;t sich mit einem altbekannten Thema - SQL Statements. Hierbei wird aber nicht auf die einzelnen SQL Statements eingegangen, sondern wie man sich ein ASP Formular codet, in dem man bequem Statements
eingeben kann, und dann eine dementsprechende Ausgabe erh&auml;lt.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010419</ArticleId>
<title><![CDATA[Site&uuml;berwachung mit Scheduled Tasks]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.4.2001]]></date>
<description><![CDATA[Eine Website, die auch nur f&uuml;r kurze Zeit offline ist, kann in der heutigen Zeit
zu einem der gr&ouml;&szlig;ten Probleme f&uuml;r eine Firma werden. Deshalb sollte man seine Site &uuml;berwachen, und zwar m&ouml;glichst automatisch. Es gibt zwar viele Dienste, die Site&uuml;berwachung anbieten - aber warum nicht selber machen?]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20010418</ArticleId>
<title><![CDATA[Das TableEditor Datenbank Administrationstool]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[18.4.2001]]></date>
<description><![CDATA[Eine Datenbank mittels ASP zu administiereren ist sehr aufwendig und erfordert einiges an Programmierarbeit. Als eine Abhilfem&ouml;glichkeit hierf&uuml;r stellt Ihnen der heutige Artikel das TableEditor Administrationstool vor. Mit diesem k&ouml;nnen Sie Datenbankbenutzer verwalten, vorhandene Tabellen, Abfragen, Stored Procedures einer Datenbank einsehen und Datenbankoperationen t&auml;tigen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010417</ArticleId>
<title><![CDATA[Eine Umfrage in ASP erstellen]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[17.4.2001]]></date>
<description><![CDATA[Umfragen sind ein einfaches aber hilfreiches Tool, wenn es darum geht, etwas &uuml;ber die W&uuml;nsche und Verhaltensweisen von Besuchern auf einer Webseite zu erfahren. Die m&ouml;glichen Einsatzgebiete sind vielf&auml;ltig. Wir wollen uns heute mit der Programmierung einer Umfrage besch&auml;ftigen, die uns die f&uuml;nf am h&auml;ufigsten besuchten Webseiten liefert.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010406</ArticleId>
<title><![CDATA[Die Xtensible Shopping Bag Komponente in Aktion]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[6.4.2001]]></date>
<description><![CDATA[Sie wollen Ihre Produkte &uuml;ber das Internet vertreiben, wissen aber nicht wie und vor allem welche Shop-L&ouml;sung Sie verwenden wollen? Warum keinen eigenen bauen? Vor allem, wenn fast alles an Funktionalit&auml;t in der leicht konfigurierbaren Xtensible Shopping Bag Komponente von AlphaSierraPapa vorhanden ist - einer ASP Komponente, die kostenlos zum Download zur Verf&uuml;gung steht.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010405</ArticleId>
<title><![CDATA[Komponente Y - welche Version bist Du?]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.4.2001]]></date>
<description><![CDATA[Als ASP Programmierer verwendet man Komponenten - ein Administrator installiert sie (&uuml;blicherweise). Meist geschieht der Aufruf der Komponente &uuml;ber ihre ProgID, die sehr selten Auskunft &uuml;ber die Version gibt. Noch viel seltener
erf&auml;hrt man, wo die Komponente gespeichert ist - was beim Aufsetzen oder Fehlersuchen hin und wieder hilfreich sein soll.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010404</ArticleId>
<title><![CDATA[Sonderzeichen f&uuml;r Forms decodieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[4.4.2001]]></date>
<description><![CDATA[Bei Datenbankabfragen oder Webseitennavigation &uuml;ber Querystrings enthalten diese Strings meist URL-encodierte Zeichen, mit denen client-seitige Forms nichts anfangen k&ouml;nnen. Wenn Sie also die im Querystring abgelegten Informationen in Forms weiterverarbeiten m&ouml;chten, m&uuml;ssen Sie diese Zeichen &quot;decodieren&quot;. Dieser Artikel zeigt Ihnen eine server-seitige L&ouml;sung wie Sie dieses Problem angehen k&ouml;nnen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010403</ArticleId>
<title><![CDATA[Objektbasierte Index Server Suche]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.4.2001]]></date>
<description><![CDATA[Das Abfragen von Index Server Katalogen mit den ber&uuml;hmt-ber&uuml;chtigten IDQ und HTX Dateien ist nicht unbedingt jedermann's Sache. Im heutigen Artikel stelle ich die Index Server Search Objects (IXSSO) vor, mit denen man bequem von ASP aus die Suche starten, und die Resultate als Recordsets geliefert bekommen kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010402</ArticleId>
<title><![CDATA[NT Account Management via ASP]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[2.4.2001]]></date>
<description><![CDATA[Suchen Sie nach einer einfachen M&ouml;glichkeit Windows NT/2000 Benutzerkonten mittels ASP zu verwalten? Wenn ja, dann zeigt dieser Artikel genau das, wonach Sie suchen. Die heute vorgestellte AspUser Komponente bietet die M&ouml;glichkeit Benutzerkonten zu managen. Der heutige Artikel beschreibt die grundlegendsten Funktionen der Komponente - also das Anlegen und Konfigurieren eines Benutzerkontos, sowie dessen L&ouml;schung.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010330</ArticleId>
<title><![CDATA[Passw&ouml;rter mit SHA1 absichern]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.3.2001]]></date>
<description><![CDATA[Da&szlig; man bestimmte Teile einer Website nur f&uuml;r authentifizierte Benutzer zug&auml;nglich macht, ist mittlerweile bereits ein &uuml;blicher Vorgang. Das Einloggen der Benutzer findet (meist) &uuml;ber ein ASP Formular statt, das nicht &uuml;ber SSL abgesichert ist - und dabei wird das Passwort im Klartext &uuml;ber das Netzwerk &uuml;bertragen - zur freien Entnahme sozusagen. Der heutige Artikel zeigt, wie man den potentiellen
Mitlesern die Arbeit erschweren kann.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20010329</ArticleId>
<title><![CDATA[Auto-Generierung von performantem Abfragecode]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[29.3.2001]]></date>
<description><![CDATA[Dieser Artikel zeigt Ihnen wie man mit Hilfe eines server-seitigen Code Generators eine Datenbankabfrage erstellt, die einiges an Performance bietet. Der Code Generator ist dabei unabh&auml;ngig von der Struktur der Datenbank. Den
generierten Code k&ouml;nnen Sie danach als ASP-Datei abspeichern - und er ist sofort einsatzbereit.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010328</ArticleId>
<title><![CDATA[Webpage-Grabbing mit dem XML Parser]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.3.2001]]></date>
<description><![CDATA[Das Grabben von Webinhalten von fremden Servern wird immer mehr zum Standardfeature einer Website - sei es um Wetterdaten einzubinden, Kreditkartendaten zu verifizieren, oder auch nur zur &Uuml;berwachung des eigenen Servers. Heute zeige ich eine M&ouml;glichkeit, wie man das Grabbing
gratis durchf&uuml;hren kann - mit dem Microsoft XML Parser.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010327</ArticleId>
<title><![CDATA[Code Generator f&uuml;r die AddNew Methode]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[27.3.2001]]></date>
<description><![CDATA[Datens&auml;tze mit der AddNew Methode einer Datenbank hinzuf&uuml;gen ist ja prinzipiell nicht schwer. Wenn die Datenbank aber viele Spalten hat ist der Schreibaufwand aber gro&szlig;. Auf jeden Fall so gro&szlig;, da&szlig; es um einiges bequemer ist, den hierf&uuml;r ben&ouml;tigen Code aus einem ASP-Script generieren zu lassen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010326</ArticleId>
<title><![CDATA[Records z&auml;hlen mit Stored Procedures]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[26.3.2001]]></date>
<description><![CDATA[Eine Frage, die immer wieder auftaucht, ist: &quot;Wie viele Datens&auml;tze sind in meiner Tabelle gespeichert?&quot;. Die &uuml;bliche (und richtige) Antwort f&uuml;r SQL Server ist COUNT(*), allerdings wird das wiederkehrende implementieren irgendwann l&auml;stig - Zeit, das Ganze in einer Stored Procedure zu verpacken!]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010323</ArticleId>
<title><![CDATA[Die LookUpTable Komponente]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[23.3.2001]]></date>
<description><![CDATA[Diese Komponente dient &auml;hnlich wie das Dictionary Objekt von VBScript dazu, anhand eines Keys (Schl&uuml;ssel) den dazugeh&ouml;rigen Wert schnell aufzufinden. Dieser Artikel erkl&auml;rt Ihnen, warum Sie der LookUpTable Komponente den Vorzug gegen&uuml;ber dem Dictionary Objekt geben sollten...]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010322</ArticleId>
<title><![CDATA[In VB Komponenten auf ASP Objekte zugreifen (Variante 2)]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[22.3.2001]]></date>
<description><![CDATA[Wie im letzten Artikel versprochen, kommen wir heute nun zur zweiten Variante des Zugriffs auf die ASP-internen Objekte innerhalb von VB Komponenten - dem ObjectContext von COM+ (oder Microsoft Transaction Server [MTS], wenn Sie noch Windows NT 4.0 verwenden).]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010321</ArticleId>
<title><![CDATA[MS Access Datenbanken kompaktieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[21.3.2001]]></date>
<description><![CDATA[Der heutige Artikel zeigt Ihnen wie man mit Hilfe der Jet and Replication Objects Microsoft Jet kompatible Datenbanken (z.B. MS Access Datenbanken) warten kann. F&uuml;r diesen Artikel habe ich die CompactDatabase Methode ausgew&auml;hlt, die wir gegen eine Datenbank am Server ausf&uuml;hren - um die gew&auml;hlte Datenbank (wieder) in eine brauchbare Gr&ouml;&szlig;e zu komprimieren.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010320</ArticleId>
<title><![CDATA[In VB Komponenten auf ASP Objekte zugreifen (Variante 1)]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[20.3.2001]]></date>
<description><![CDATA[Wie aus dem Titel ersichtlich ist, kann man aus Komponenten generell (und im heutigen Artikel Visual Basic im speziellen) auf mehrere Arten und Weisen auf die ASP Objekte wie Request oder Response zugreifen. Heute bespreche ich den Einsatz der Page-Level Event Methoden...]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010319</ArticleId>
<title><![CDATA[Mit ASP ein Word Dokument am Server generieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[19.3.2001]]></date>
<description><![CDATA[Mit dem Microsoft Word Object Modell lassen sich z.B. Word Dokumente auf einem Server generieren, die dann von einem Client weiter verwendet werden k&ouml;nnen. Dies kann sich bei der Generierung von Flyern, Intranetdokumenten
oder Produktdaten als sehr n&uuml;tzlich erweisen. Der Weg durch den Word Object &quot;Dschungel&quot; ist aber bei anspruchsvolleren Aufgaben oftmals steinig.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010309</ArticleId>
<title><![CDATA[Excel Diagramme als GIF's serven]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[9.3.2001]]></date>
<description><![CDATA[Dieser Artikel zeigt Ihnen wie Sie Grafiken aus einem serverseitig generierten Microsoft Excel Diagramm erstellen k&ouml;nnen. Die Grafiken werden dabei als GIF-Dateien im Server Pfad abgespeichert. Diese k&ouml;nnen dann von anderen Scripts weiterverwendet werden, oder einfach zum Client geschickt werden.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010308</ArticleId>
<title><![CDATA[Der ADO Command Code Generator]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[8.3.2001]]></date>
<description><![CDATA[Heute werden wir uns ein n&uuml;tzliches Tool f&uuml;r ASP in ASP selbst basteln - eine Page, die uns anhand eines Connection Strings und dem Namen einer Stored Procedure den notwendigen ADO/ASP VBScript Code zum Aufruf automatisch generiert - den man dann nur noch kopieren, und in die 
eigene Seite einbauen mu&szlig;.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010307</ArticleId>
<title><![CDATA[Ein Excel-Diagramm am Server generieren und zum Client schicken]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[7.3.2001]]></date>
<description><![CDATA[Diesmal wollen wir nicht nur ein MS-Excel Sheet am Server generieren, sondern einen Schritt weiter gehen und die Daten auch noch visualisieren - und das alles am Web Server. Der Client erh&auml;lt dann die Excel-Datei mit den aus der Datenbank geholten Datens&auml;tze samt dem erstellten Diagramm.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010306</ArticleId>
<title><![CDATA[Dynamische Stylesheets]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[6.3.2001]]></date>
<description><![CDATA[Cascaded Stylesheets (CSS) erfreuen sich immer gr&ouml;&szlig;erer Beliebtheit f&uuml;r das Websitedesign. In den meisten F&auml;llen handelt es sich dabei um eine extern eingelinkte Datei mit der Endung .css, die die Definitionen f&uuml;r die Styles enth&auml;lt. Wer verbietet uns eigentlich, diese Endung auf .asp zu &auml;ndern?]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010305</ArticleId>
<title><![CDATA[Ein Excel-Sheet am Server generieren und zum Client schicken]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[5.3.2001]]></date>
<description><![CDATA[Im heutigen Artikel erfahren Sie, wie man ein Microsoft Excel SpreadSheet auf einem Server programmatisch generiert, und dann bequem  - ohne es im Browser &ouml;ffnen zu m&uuml;ssen - zum Client schickt. Um das Beispiel etwas praxisn&auml;her zu gestalten, werden die Daten die das SpreadSheet sp&auml;ter enthalten soll, mit einer Datenbankabfrage geholt.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010223</ArticleId>
<title><![CDATA[Dateien zum Client schicken]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[23.2.2001]]></date>
<description><![CDATA[Sie m&ouml;chten dem Client eine Datei via ASP zum Browser schicken - ohne Redirect? Das ist ja prinzipiell nicht schwer. Dieser Artikel zeigt Ihnen anhand von Beispielen wie man einfach Text/HTML Dateien mit dem FileSystemObject zum Client schicken kann, und was passiert, wenn man das gleiche mit Dateien in bin&auml;rer Form z.B. gezippten Dateien probiert.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010222</ArticleId>
<title><![CDATA[Farbauswahl in HTML Formularen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[22.2.2001]]></date>
<description><![CDATA[Die Basism&ouml;glichkeiten von HTML Formularen - Eingabefelder, Listboxen, usw. - erm&ouml;glichen zwar nette Formulare, aber bei einigen Tasks wird das schnell unintuitiv. Ein Beispiel ist die Auswahl von Farben: weder das Eintippen von Farbnamen oder Farbwerten, noch das Ausw&auml;hlen derselben in DropDown Boxen kann das "Point and Click" Erlebnis eines Farbselektors ersetzen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010221</ArticleId>
<title><![CDATA[Dateien auslesen mit VB.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[21.2.2001]]></date>
<description><![CDATA[Heute erfahren Sie wie man mit VB.NET Dateien ausliest, und den Stream zum Browser des Client schickt. Nat&uuml;rlich sollen es nicht nur einfache Textdateien sein, nein, es werden heute auch anspruchsvollere Beispiele gezeigt.]]></description>
<category><![CDATA[VB.NET]]></category>
</article>
<article>
<ArticleId>20010220</ArticleId>
<title><![CDATA[Applikationen aus ASP.NET ausf&uuml;hren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[20.2.2001]]></date>
<description><![CDATA[Irgendwo gibt es immer eine kleine Kommandozeilenapplikation, die etwas kann, was keine Komponente kann. Und dann taucht die Frage auf, wie man dieses Programm aus ASP.NET heraus starten, und den Output dann weiterverwenden kann.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20010219</ArticleId>
<title><![CDATA[Emails versenden mit ASPEmail]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[19.2.2001]]></date>
<description><![CDATA[Die Email Komponente AspEmail 4.5 von Persits Software bietet eine einfache M&ouml;glichkeit via ASP Emails zu versenden. Dieser Artikel zeigt Ihnen, wie man mit Hilfe dieser Komponente Emails als normalen Text oder als HTML formatierten  Text versendet.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010216</ArticleId>
<title><![CDATA[XML NodeType Enumeration]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[16.2.2001]]></date>
<description><![CDATA[Der heutige Artikel befa&szlig;t sich mit der XMLNodeType Enumeration. Sie erfahren, was sich hinter diesem Namen verbirgt, und wie man programmatisch den Typ eines XML Nodes mittels ASP.NET auslesen kann.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20010215</ArticleId>
<title><![CDATA[Enums lesbar machen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[15.2.2001]]></date>
<description><![CDATA[Der heutige Artikel widmet sich einem Thema aus C#, das gerade bei der Entwicklung gr&ouml;&szlig;erer Projekte interessant werden k&ouml;nnte - dem Konvertieren von Enum Werten in "lesbare" Strings. Da das Ganze jetzt sehr abstrakt klingt, hier ein Beispiel..]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010214</ArticleId>
<title><![CDATA[Eine Supportdatenbank in ASP erstellen - Teil 2]]></title>
<author><![CDATA[Klaus Aschenbrenner]]></author>
<date><![CDATA[14.2.2001]]></date>
<description><![CDATA[Im heutigen 2. Teil m&ouml;chte ich Ihnen nun zeigen, wie zB. ein Supportmitarbeiter eine Supportanfrage, die ein Besucher der Website gepostet hat, beantworten kann. Diese Antwort wird in der Datenbank gespeichert und per Email an den Anfragenden gesendet.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010213</ArticleId>
<title><![CDATA[Update und UpdateBatch zum Einf&uuml;gen von Datens&auml;tzen in Datenbanken]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[13.2.2001]]></date>
<description><![CDATA[Das Einf&uuml;gen von Daten in Datenbanktabellen ist eine Basisoperation von 
Webapplikationen mit Datenbankanbindung. In einem ASP Skript hat man die folgenden M&ouml;glichkeiten um einen Datensatz in eine Datenbank zu schreiben...]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010212</ArticleId>
<title><![CDATA[Thumbnails mit ASP generieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[12.2.2001]]></date>
<description><![CDATA[Wenn man auf einer Webseite Bilder darstellt, z.B. f&uuml;r die Pr&auml;sentation von Produkten, wird man bei steigender Bilderanzahl, nicht alle Bilder 1:1 darstellen, weil sonst die Download-Performance der Seite stark darunter leiden w&uuml;rde. Deshalb erstellt man kleinere, als Vorschau gedachte Bilder - eben Thumbnails.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010209</ArticleId>
<title><![CDATA[Erstellung eines Newstickers in ASP - Teil 2]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[9.2.2001]]></date>
<description><![CDATA[Willkommen zum zweiten und letzten Teil der Erstellung eines Newstickers mit ASP. 
Wir besch&auml;ftigen uns heute mit der Administration des Newstickers, das hei&szlig;t mit dem Anlegen, Modifizieren und L&ouml;schen von Eintr&auml;gen sowie &Auml;nderungen an den Anzeigeparametern des Newstickers.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010208</ArticleId>
<title><![CDATA[Web Projekte mit SharpDevelop erstellen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[8.2.2001]]></date>
<description><![CDATA[Dieser Artikel zeigt Ihnen, da&szlig; kleinere Web Projekte nicht nur mit Jumbo Programmen, die PC-Resourcen wie ein V8 Motor Benzin verbrauchen, zu bew&auml;ltigen sind. Ich habe f&uuml;r die L&ouml;sung der heutigen Aufgabe - eine C# Komponente und die dazugeh&ouml;rige ASP.NET Seite - das Open-Source Tool SharpDevelop verwendet.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010207</ArticleId>
<title><![CDATA[ASPForums 2.1 installieren und anpassen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[7.2.2001]]></date>
<description><![CDATA[Die besten Dinge im Leben sind gratis - das stimmt zwar nicht, aber zumindest einige gute Software ist tats&auml;chlich gratis. So zum Beispiel ASPForums, das eine einfache, extrem konfigurierbare (Stichwort "Extremkonfiguriering") Forensoftware auf Basis von ASP darstellt.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010206</ArticleId>
<title><![CDATA[Dynamische Seiten indizierbar machen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[6.2.2001]]></date>
<description><![CDATA[Heutzutage ist eine Firmenwebsite meist g&auml;nzlich dynamisch aufgebaut, und umfasst im umfangreichen Falle mehrere tausend Seiten. Obwohl solche Sites enormen Content anzubieten haben, und sicher in alle Suchmaschinen
submitted wurden, ist die Trefferquote bei Suchen nicht gerade ber&uuml;hmt - warum?]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010205</ArticleId>
<title><![CDATA[GET oder POST, das ist hier die Frage]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[5.2.2001]]></date>
<description><![CDATA[Es ist zwar keine Gem&uuml;tsfrage, aber sehr wohl eine Frage des korrekten Programmierens, vor allem in Zeiten von Proxyservern. Heute widme ich mich den Unterschieden zwischen GET und POST, wann welche Spielart des HTTP Transfers zum Einsatz kommen sollte, und wie man zwischen diesen beiden unterscheiden kann.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010202</ArticleId>
<title><![CDATA[Dateiupload mit ASP und WSC]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[2.2.2001]]></date>
<description><![CDATA[Sie m&ouml;chten eine Dateiupload Komponente auf Ihrer Web Site bzw. in ein Web Form einbinden, wollen diese aber im Zusammenhang mit ASP verwenden. Zus&auml;tzlich lassen Sie Ihre Web Site bei einer anderen Firma hosten, und k&ouml;nnen daher keine Komponenten am Web Server selbst registrieren 
bzw. die Hostingfirma l&auml;&szlig;t die Registrierung von Komponenten nicht zu. Dieser Artikel zeigt Ihnen die Verwendung einer Windows Script Component (WSC), mit der Sie ohne die Komponente am Web Server registieren zu m&uuml;ssen Dateien auf den Web Server kopieren k&ouml;nnen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010201</ArticleId>
<title><![CDATA[Einrichten des Snitz Forums]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[1.2.2001]]></date>
<description><![CDATA[Ein Forum kann man auf einer Community Website als "einfaches" Diskussionsforum, oder auf einer Firmenhomepage als Supportforum anbieten (nat&uuml;rlich sind das nur 2 willk&uuml;rlich gew&auml;hlte Anwendungsf&auml;lle). In diesem Artikel stelle ich Ihnen das &quot;Snitz Forum&quot; in der aktuellen Version vor, das als besondere Vorteile zwei hat: es benutzt keine Komponenten (au&szlig;er Email), und es ist gratis.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010131</ArticleId>
<title><![CDATA[Seiten weiterempfehlen leicht gemacht]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[31.1.2001]]></date>
<description><![CDATA[Heute besch&auml;ftigen wir uns mit einem Website-Feature, das man vor allem auf
Community Websites findet - das Weiterempfehlen von Seiten, im Englischen
unter dem Begriff "Tell-a-friend" gef&uuml;hrt. Dieser Artikel zeigt, wie's in ASP
leicht und dennoch wirksam implementiert werden kann.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010130</ArticleId>
<title><![CDATA[Datens&auml;tze zuf&auml;llig sortieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.1.2001]]></date>
<description><![CDATA[Klingt komisch, ist es aber nicht. Oftmals m&ouml;chte man Datens&auml;tze einer Tabelle bei jedem Zugriff in unterschiedlicher Reihenfolge auslesen, um damit eine gewisse "Zuf&auml;lligkeit" in die Anordnung der Datens&auml;tze zu bekommen. Da es keine ORDER Clause "ORDER BY RAND" gibt, mu&szlig; man sich die L&ouml;sung selbst basteln.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20010129</ArticleId>
<title><![CDATA[HTML zu ASP konvertieren]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[29.1.2001]]></date>
<description><![CDATA[In diesem Artikel zeige ich Ihnen eine einfache Methode HTML-formatierten Text ASP tauglich zu machen. Das Script, welches ich Ihnen pr&auml;sentieren werde besteht aus einem Online Interface, in dem Sie den HTML Code einf&uuml;gen, und ihn dann mit einem Mausklick konvertieren k&ouml;nnen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20010126</ArticleId>
<title><![CDATA[Am Server installierte Schriftarten auslesen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[26.1.2001]]></date>
<description><![CDATA[Im heutigen Artikel besch&auml;ftigen wir uns mit einem eher etwas "eigenartigem" Thema, n&auml;mlich dem Auslesen der am Web Server installierten Schriftarten. Dies ist n&auml;mlich ein gutes Thema um die N&uuml;tzlichkeit von C++ Kenntnissen zur Komponentenerstellung zu illustrieren.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20010125</ArticleId>
<title><![CDATA[Remote Scripting (I)]]></title>
<author><![CDATA[Christian Strauch]]></author>
<date><![CDATA[25.1.2001]]></date>
<description><![CDATA[In diesem Artikel behandelt der Autor die Grundlagen von Remote Scripting, und erkl&auml;rt, wie man serverseitige ASP-Funktionen innerhalb einer ausgelagerten ASP Seite vom Client aus ausf&uuml;hren, und die R&uuml;ckgabewerte ohne erneutes Laden der Seite clientseitig per JavaScript benutzen kann. Dies ist der erste Artikel einer Serie &uuml;ber Remote Scripting.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20010124</ArticleId>
<title><![CDATA[Dateiupload mit ASP.NET und VB.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[24.1.2001]]></date>
<description><![CDATA[Mit ASP war und ist es nicht m&ouml;glich ohne eine zus&auml;tzlichen Dritthersteller-Komponente vern&uuml;nftig Dateien auf einen Webserver upzuloaden. Mit ASP.NET steht eine solche Uploadkomponente von Haus aus
zur Verf&uuml;gung - gratis, und wie dieser Artikel zeigt, einfach in der Anwendung.]]></description>
<category><![CDATA[VB.NET]]></category>
</article>
<article>
<ArticleId>20010123</ArticleId>
<title><![CDATA[Eine Eurokonvertierungskomponente in C# erstellen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.1.2001]]></date>
<description><![CDATA[Die Einf&uuml;hrung des "angreifbaren" Eurogeldes r&uuml;ckt immer n&auml;her, und die doppelte Preisauszeichnung ist mittlerweile auch schon &uuml;berall zu sehen. Letztes Jahr haben wir uns bereits mit diesem Thema besch&auml;ftigt, allerdings haben wir damals eine bereits existierende Komponente verwendet. Heute werden wir diese Komponente mit C# nachprogrammieren - und zwar weil eine native .NET Komponente viel performanter ist als wenn man die existierende COM Komponente mit Interop in ASP.NET einbindet.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20010122</ArticleId>
<title><![CDATA[Emails mit ASP.NET und VB.NET versenden]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[22.1.2001]]></date>
<description><![CDATA[Etwas, das sich heutzutage auf jeder Website findet, ist ein Email-Anfrageformular. Das wird sich wahrscheinlich auch nicht so schnell &auml;ndern, deswegen werde ich heute vorstellen, wie man Emails in ASP.NET verschickt: von ganz einfach bis hin zu HTML Mails und Attachments.]]></description>
<category><![CDATA[VB.NET]]></category>
</article>
<article>
<ArticleId>20001207</ArticleId>
<title><![CDATA[SA ExcelWriter in Action]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[7.12.2000]]></date>
<description><![CDATA[Nach der kurzen Vorstellung der Software Artisans ExcelWriter Komponete im Artikel  Die SA Excel Writer Komponente, kann die Komponente nun zeigen was sie kann. Anhand eines Beispiels wird gezeigt wie Werte in Zellen programmatisch eingef&uuml;gt werden und eine Formatierung angewandt wird. Um das Beispiel etwas interessanter zu machen, lesen wir Datens&auml;tze einer MS Access Datenbank ein und wenden zudem auch noch eine kleine Berechnungsformel an.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001206</ArticleId>
<title><![CDATA[Benutzerverfolgung in ASP]]></title>
<author><![CDATA[Stefan Mayer]]></author>
<date><![CDATA[6.12.2000]]></date>
<description><![CDATA[Der Microsoft Internet Information Server protokolliert jeden Besucher und jede Datei, die abgerufen wurde im Logfile mit. Oft ist das Logfile jedoch so umfangreich, da&szlig; die gew&uuml;nschte Analyse und Auswertung nur mit teuren Programmen m&ouml;glich ist (WebTrends, etc). Abgesehen davon hat man nicht immer Zugriff auf das Original-Logfile, was besonders bei Free-Providern h&auml;ufig der Fall ist.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001205</ArticleId>
<title><![CDATA[Erstellung eines Newstickers in ASP]]></title>
<author><![CDATA[Alexander Zeitler]]></author>
<date><![CDATA[5.12.2000]]></date>
<description><![CDATA[Willkommen zum 1. Teil einer 2-teiligen Artikelserie zur Erstellung eines Newstickers. In diesem Artikel zeige ich Ihnen, welche grundlegenden Strukturen notwendig sind und wie Sie den Newsticker anzeigen lassen. Im zweiten Teil werden Sie dann erfahren, wie Sie eine Administrations-Seite f&uuml;r den Newsticker erstellen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001204</ArticleId>
<title><![CDATA[Die SA Excel Writer Komponente]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[4.12.2000]]></date>
<description><![CDATA[Mit der Software Artisans ExcelWriter Komponente k&ouml;nnen Sie Microsoft Excel kompatible Spreadsheets erstellen. Dabei mu&szlig; am Webserver Excel nicht installiert sein. Dieser Artikel soll als Teaser dienen, d.h. der Artikel beinhaltet eine Kurzbeschreibung der Features der Komponente. Zus&auml;tzlich beinhaltet er die Installation der kostenlosen Demoversion der Komponente auf einem Webserver.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001201</ArticleId>
<title><![CDATA[Die SQL ORDER BY Clause]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[1.12.2000]]></date>
<description><![CDATA[In manchen F&auml;llen ist es nicht nur wichtig die Daten einer Datenbank zu filtern, sondern auch nach bestimmten Kriterien zu sortieren. Bei Verwendung einer ASP Seite und ADO, geschieht dies am einfachsten und schnellsten mit der SQL ORDER BY Clause. Anhand von einfachen Beispielen zeigt dieser Artikel die programmatische Durchf&uuml;hrung.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001130</ArticleId>
<title><![CDATA[Bildinformationen selbst ermitteln]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.11.2000]]></date>
<description><![CDATA[Ein h&auml;ufiges Problem beim Upload von Bilddateien ist, da&szlig; die Gr&ouml;&szlig;e (Breite, H&ouml;he) nicht bekannt ist, und man sie selbst ermitteln mu&szlig;. Unter ASP kann man sich mit der Gratiskomponente
ImageSize von ServerObjects behelfen, die allerdings auf wenige (wichtige) Formate beschr&auml;nkt ist.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20001129</ArticleId>
<title><![CDATA[INI-Dateien als Konfigurationsdateien f&uuml;r ASP-Anwendungen verwenden]]></title>
<author><![CDATA[Steffen Kangowski]]></author>
<date><![CDATA[29.11.2000]]></date>
<description><![CDATA[Wie schon im Artikel "Lesen von Textdateien" von Christian Koller angeschnitten, 
bieten sich Textdateien an, um Konfigurationsdaten f&uuml;r eine ASP-Anwendung abzulegen und bei Bedarf auszulesen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001128</ArticleId>
<title><![CDATA[Datenbank zur Weiterbearbeitung in Excel bereitstellen]]></title>
<author><![CDATA[Hubert Daubmeier]]></author>
<date><![CDATA[28.11.2000]]></date>
<description><![CDATA[Hier nun wie versprochen der Folgeartikel zu Excel Dateien ohne Excel anzeigen, der beschreibt, wie Sie eine vorhandene Daten[bank]ausgabe in eine Exceldatei ausgeben, soda&szlig; der Besucher Ihrer Seiten die Daten weiterverarbeiten kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001127</ArticleId>
<title><![CDATA[Datens&auml;tze mit dem DELETE Statement l&ouml;schen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[27.11.2000]]></date>
<description><![CDATA[Im heutigen Artikel besch&auml;ftigen wir uns mit einem weiteren SQL Statement - dem DELETE Kommando. Mit diesem kann man einfach, schnell und bequem Datens&auml;tze aus einer Tabelle l&ouml;schen - und man &uuml;berl&auml;sst dabei die gesamte Arbeit der Datenbank.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001124</ArticleId>
<title><![CDATA[Aktualisieren von Daten mit dem UPDATE Statement]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[24.11.2000]]></date>
<description><![CDATA[Daten in einer Datenbank kann man mit ADO auf zweierlei Arten ver&auml;ndern - einerseits durch Verwendung eines Recordsets mit der Update Methode, als auch mit dem UPDATE Statement und dem Execute Befehl des Connection Objekts. Meist ist UPDATE die schnellere Wahl, und was noch hinzukommt, die flexiblere
L&ouml;sung.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001123</ArticleId>
<title><![CDATA[DropDown Listen bef&uuml;llen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[23.11.2000]]></date>
<description><![CDATA[Dieser Artikel beschreibt zwei unterschiedliche Methoden wie man die DropDownList WebControl mit Daten bef&uuml;llen kann. Zuerst mit Hilfe der ArrayList, und danach wie man die Listeneintr&auml;ge aus einer SQL-Datenbank bezieht.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20001121</ArticleId>
<title><![CDATA[AutoCompletion f&uuml;r Web Formulare]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[21.11.2000]]></date>
<description><![CDATA[Heute habe ich mir erlaubt, ein Nicht-ASP Thema auszuw&auml;hlen, das jedoch sehr viel mit ASP Programmierung zu tun hat: das automatische Ausf&uuml;llen von Web Formularen mit Hilfe des AutoComplete Features von Internet Explorer 5.x.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20001117</ArticleId>
<title><![CDATA[Einfaches XML-Auslesen in .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[17.11.2000]]></date>
<description><![CDATA[Im heutigen Artikel m&ouml;chte ich Ihnen zeigen, wie einfach es in .NET geworden ist, mit XML zu arbeiten. Um einen Vergleich zu erhalten, habe ich mir zum Ziel gesetzt, den Code des Artikels "Auslesen von XML Dateien mit dem DOM" nachzubauen.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20001116</ArticleId>
<title><![CDATA[Das DataTable Objekt in ADO.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[16.11.2000]]></date>
<description><![CDATA[Dieser Artikel soll Ihnen eine kurze Einf&uuml;hrung &uuml;ber das DataTable Objekt in ADO.NET geben. Zuerst werden Sie die Eigenschaften dieses Objektes kennenlernen, und danach an Hand von Beispielen das notwendige Grundr&uuml;stzeug in komprimierter Form f&uuml;r die Instanzierung des Objektes bzw. das Arbeiten mit dem Objekt erhalten.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20001115</ArticleId>
<title><![CDATA[HTTP Komprimierung in IIS5]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[15.11.2000]]></date>
<description><![CDATA[Heute besch&auml;ftigen wir uns mit einem Feature des IIS 5, das wahrscheinlich kaum jemand kennt - HTTP Komprimierung. Dabei komprimiert IIS alle ausgehenden Dateien mit dem GZIP oder Deflate Algorithmus, was speziell f&uuml;r Bandbreiten-beengte Server mit viel statischem Inhalt einen enormen Geschwindigkeitsgewinn bringt (eine HTML Seite kann sehr gut komprimiert werden).]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20001114</ArticleId>
<title><![CDATA[ASP.NET User Controls im Einsatz]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[14.11.2000]]></date>
<description><![CDATA[User Controls (vormals Pagelets) sind ja ganz praktisch - man schreibt sich kleine Code Snippets die man immer wieder in seinen ASP.NET Web Projekten ben&ouml;tigt. Wenn sie dann zum Einsatz kommen sollen - einfach in dem ASP.NET File registrieren und aufrufen. Da&szlig; man aber auch mehr als ein simples Email-Standard-Formular mit den ASP.NET User Controls erstellen kann, soll dieser Artikel zeigen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20001113</ArticleId>
<title><![CDATA[Eine simple UNZIP-Komponente programmieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[13.11.2000]]></date>
<description><![CDATA[Im heutigen Artikel werden wir uns eine einfache Unzip Komponente selbst programmieren - mit Hilfe von frei erh&auml;ltlichen Klassen-Bibliotheken und Visual C++. Selbst wenn man nicht daran interessiert ist, die vorgestellte Komponente zu erweitern - der Download enth&auml;lt die fertige Komponente, die man nur noch am eigenen Server registrieren mu&szlig;!]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20001110</ArticleId>
<title><![CDATA[Excel Dateien ohne Excel anzeigen]]></title>
<author><![CDATA[Hubert Daubmeier]]></author>
<date><![CDATA[10.11.2000]]></date>
<description><![CDATA[Excel wird gerne zum Verwalten von Listen aller Art verwendet. Es ist einfacher zu handhaben und verlangt weniger - eigentlich keine - Struktur bei der Anlage, wie das etwa eine Datenbank erfordern w&uuml;rde. Nun w&auml;re es doch naheliegend so eine Excel-Datei auch im Web oder Intranet anzubieten. Wie man eine Excel-Datei auf den Server stellt und verlinkt wissen Sie sicher. Aber wie man sie schnell und einfach dem Benutzer anbietet, ohne daß sich Excel 
&ouml;ffnet zeigt dieser Artikel.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001109</ArticleId>
<title><![CDATA[Verzeichnissicherheit mit NTFS und IIS Authentifizierung]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[9.11.2000]]></date>
<description><![CDATA[Ger&uuml;chteweise habe ich geh&ouml;rt, da&szlig; Firmen hin und wieder den Zugang zu bestimmten Bereichen Ihrer Website absichern m&ouml;chten. Um dies umzusetzen, bietet der Internet Information Server zusammen mit Windows NT/2000 einiges an Verzeichnissicherheit. Und diese Unterst&uuml;tzung ist dergestalt, da&szlig; man als ASP Programmierer mitbekommt, wer gerade berechtigterma&szlig;en auf der Seite "surft".]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20001108</ArticleId>
<title><![CDATA[SQL Server Objekte scripten]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[8.11.2000]]></date>
<description><![CDATA[Im heutigen Artikel besch&auml;ftigen wir uns damit, wie man von existierenden Objekten in SQL Server Datenbanken ein Script erstellen kann, das man dann auf einem anderen Server verwenden kann, um idente Objekte zu erstellen (Schema, nicht Daten). Dazu werde ich zwei Wege beschreiben - der interaktive Weg &uuml;ber den Enterprise Manager, als auch wie man es programmatisch erledigen kann.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001107</ArticleId>
<title><![CDATA[Einf&uuml;gen eines Datensatzes mit dem INSERT Statement]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[7.11.2000]]></date>
<description><![CDATA[Um einen Datensatz in eine Datenbank einzuf&uuml;gen, hat man von ASP aus zwei 
grunds&auml;tzlich verschiedene M&ouml;glichkeiten:  entweder mit einem SQL INSERT Statement oder Mittels Recordset.AddNew und Recordset.Update (bzw. Recordset.UpdateBatch). Dieser Artikel zeigt wie man das SQL INSERT Statement verwendet um einen Datensatz mittels ADO in eine Datenbank &uuml;bertr&auml;gt.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001106</ArticleId>
<title><![CDATA[Datenaufbereitung in ADO.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[6.11.2000]]></date>
<description><![CDATA[In diesem Artikel lernen Sie wie man in ADO.NET Daten einer Datenbank für den Client strukturiert und optisch ansprechend darstellt. Sie werden zwei Möglichkeiten kennen lernen - nämlich den ADODataReader sowie die Verwendung von DataBind und die Visualisierung der Daten mit der DataGrid Web Control. Mit diesen zwei Möglichkeiten können Sie die zurückgegebenen Daten aus einer Datenbank einfachst aufbereitet im Webbrowser darstellen. Anhand von Beispielen werden wir den Syntax besprechen und die Vor- und Nachteile in der Anwendung dieser
kennenlernen.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20001103</ArticleId>
<title><![CDATA[Generieren von Zeichnungen in PDF-Dokumenten]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[3.11.2000]]></date>
<description><![CDATA[In diesem Artikel m&ouml;chte ich Ihnen zeigen, wie man in einer ASP Seite ein 
PDF-Dokument mit Grafiken erzeugt. Das PDF Dokument wurde mit ActivePDF (activePDF Server und activePDF Printer) in einer ASP Seite generiert.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001102</ArticleId>
<title><![CDATA[Datenbankzugriff mittels ADO.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[2.11.2000]]></date>
<description><![CDATA[Dieser Artikel beschreibt die grundlegenste Funktion von ADO.NET - den Zugriff auf eine Datenbank sowie das Bef&uuml;llen eines sogenannten DataSets. 
Zuerst werden wir eine Verbindung zu einer Datenbank mit Hilfe des OleDbConnection Objektes erstellen, und danach mit einem SQL-Statement eine Datenbankabfrage durchf&uuml;hren. Das Ergebnis der Abfrage wird in das DataSet geschrieben.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20001031</ArticleId>
<title><![CDATA[Was ist neu in ADO.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[31.10.2000]]></date>
<description><![CDATA[Dieser Artikel gibt Ihnen einen &Uuml;berblick &uuml;ber die wesentlichen Neuerungen in ADO.NET um einen raschen Umstieg zu erm&ouml;glichen. ADO.NET ist nicht &quot;nur&quot; eine neue Version von ADO , sondern bietet ernstzunehmende Vorteile in der Programmierung, Wartung, Performance und dem Datenaustausch zwischen einzelnen Komponenten, der auf dem universellen XML Standard basiert.]]></description>
<category><![CDATA[ADO.NET]]></category>
</article>
<article>
<ArticleId>20001030</ArticleId>
<title><![CDATA[Uploaden einer beliebigen Datei in eine Datenbank]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[30.10.2000]]></date>
<description><![CDATA[Auf Anregung einer Frage in der AspGerman Liste m&ouml;chte ich in diesem Artikel demonstrieren, wie man eine beliebige Datei (zum Beispiel ein Bild) vom Client (Browser) auf den Server uploaded und in einer Datenbank speichert.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20001027</ArticleId>
<title><![CDATA[Eigene History]]></title>
<author><![CDATA[Rainer Völschow]]></author>
<date><![CDATA[27.10.2000]]></date>
<description><![CDATA[Wenn man beim Browser eine Seite besucht hat und mit Javascript () oder dem Back-Button eine oder mehrere Seiten zur&uuml;ckspringt, so kann man mittels des Forward-Buttons zu dieser Seite zur&uuml;ckkehren. Dies erm&ouml;glicht so einem User, Daten zweimal einzugeben. Wie man dies verhindert, soll dieser 
Artikel zeigen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001025</ArticleId>
<title><![CDATA[Die Performancefalle ReDim Preserve]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.10.2000]]></date>
<description><![CDATA[Wer mit Arrays in VB arbeitet, dem wird auch das ReDim Statement zum Ver&auml;ndern der Gr&ouml;&szlig;e eines Arrays nicht unbekannt sein. Heute werde ich Ihnen ausf&uuml;hrlich darlegen, warum Sie dieses Statement in Zukunft besser nicht mehr, oder nur noch sehr, sehr selten einsetzen sollten.]]></description>
<category><![CDATA[VB.NET]]></category>
</article>
<article>
<ArticleId>20001024</ArticleId>
<title><![CDATA[Exception Handling in Visual Basic.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[24.10.2000]]></date>
<description><![CDATA[Auch bei der Webseiten-Programmierung ist die Fehlerbehandlung ein wichtiges Thema. Diese erspart dem Client frustrierende Browsermeldungen sowie Scriptabst&uuml;rze. Das Problem bei ASP Seiten war und ist, da&szlig; VBScript eine Fehlerbehandlung bietet, die jenseits von Gut und B&ouml;se liegt.]]></description>
<category><![CDATA[VB.NET]]></category>
</article>
<article>
<ArticleId>20001023</ArticleId>
<title><![CDATA[Das SQL Join Statement]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[23.10.2000]]></date>
<description><![CDATA[Dieser Artikel soll Ihnen die Grundlagen des SQL <i>Join</i> Statements vermitteln. Zuerst besprechen wir die Funktion von <i>Join</i> und die M&ouml;glichkeiten die das Statement bietet. Mit ein paar einfachen Beispielen wird
Ihnen die Verwendung rasch in Fleisch und Blut &uuml;bergehen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001020</ArticleId>
<title><![CDATA[Stringoperationen, die Zweite]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[20.10.2000]]></date>
<description><![CDATA[Sie haben einen String in dem eine bestimmte Zeichenfolge immer wieder vorkommt, diese aber in einem neuen Dokument nicht mehr erscheinen darf - was machen wir da? Nat&uuml;rlich ausschneiden oder durch z.B.: ein Leerzeichen ("") ersetzen. In diesem Artikel stellt der Autor wiederum Stringfunktionen anhand praktischer Beispiele vor.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20001019</ArticleId>
<title><![CDATA[Sichere Konvertierungen von Referenztypen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.10.2000]]></date>
<description><![CDATA[Ein Thema, das sich immer wieder als problematisch f&uuml;r Einsteiger herausstellt, ist das Konvertieren ("Casten") von Referenztypen (aka Objekten). Unter C++ konnte man damit sehr viel Unheil anstellen, was einem zum Gl&uuml;ck mit C# nicht passieren kann. Trotz oder gerade wegen der Typsicherheit der Sprache sollte man sich mit den verschiedenen Techniken vertraut machen.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20001018</ArticleId>
<title><![CDATA[Global.asa: Verwendung, Events und Probleme]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[18.10.2000]]></date>
<description><![CDATA[Die Global.asa ist eine praktische Funktionalit&auml;t des IIS 4.0 und IIS 5.0.
Alle ASP Seiten einer virtuellen Website unter IIS laufen 
(f&uuml;r gew&ouml;hnlich) in einem gemeinsamen Proze&szlig;, der <b>Server Application</b>.  Wie wichtig diese Application zur Ausf&uuml;hrung von ASP Seiten ist, merkt man sp&auml;testens dann, wenn man die Application entfernt.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20001017</ArticleId>
<title><![CDATA[Generieren von PDF-Dokumenten]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[17.10.2000]]></date>
<description><![CDATA[Sollten Sie einmal in die Verlegenheit kommen, unter ASP dynamisch
PDF Dokumente erzeugen zu m&uuml;ssen, so k&ouml;nnten Sie f&uuml;r diese
Aufgabe die ActivePDF Komponenten der Firma activePDF, Inc. benutzen. Dieser Artikel beschreibt die Einrichtung der Komponente am Web Server und die Generierung von PDF-Dateien mit Hilfe von ASP.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001016</ArticleId>
<title><![CDATA[Manipulieren von ZIP Archiven am Server]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[16.10.2000]]></date>
<description><![CDATA[In einem meiner letzen Artikel habe ich mich mit dem Entzippen von ZIP Archiven
auf dem Webserver besch&auml;ftigt. Dieser Artikel geht einen Schritt weiter
und erkl&auml;rt verschiedene M&ouml;glichkeiten im Zugriff und in der Manipulation von ZIP Archiven in ASP Seiten.
Ich habe f&uuml;r diesen Artikel die <i>ActiveFile</i> Komponente herangezogen,
da sie keine W&uuml;nsche im Bereich der ZIP-Archive offen l&auml;sst.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001013</ArticleId>
<title><![CDATA[Highspeed-Abfragen einer SQL Server Datenbank]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[13.10.2000]]></date>
<description><![CDATA[Heute geht es ans Eingemachte: High-Speed Abfragen aus einer SQL Server 7.0 Datenbank steht am Programm. Das ist nichts f&uuml;r Leute, die kleine ASP Sites erstellen, sonderen mehr etwas f&uuml;r den Hardcore-Datenbankfreak. Aber auch f&uuml;r ASP-Programmierer, die in Performance-Tuning von Datenbankabfragen
Einblick gewinnen m&ouml;chten, oder Leute deren t&auml;gliches Brot das Erstellen von ASP-Websites mit Datenbankunterst&uuml;tzung f&uuml;r tausende Zugriffen pro Tag ist, werden in diesem Artikel einige interessante Anregungen finden.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20001012</ArticleId>
<title><![CDATA[Einf&uuml;hrung: C#-Klassen in ASP.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[12.10.2000]]></date>
<description><![CDATA[Will man Interaktionen mit dem Webserver, wie Formulare auswerten oder Datenbank-Records auslesen, in eine Webseite integrieren, so gen&uuml;gt reines HTML nicht mehr. F&uuml;r einen ASP Programmierer ist dies nichts neues,
denn es gibt schon seit geraumer Zeit die M&ouml;glichkeite server-side Skripts mit ASP zu schreiben. Die f&uuml;r ASP am h&auml;ufigsten verwendeten Sprachen sind VBScript und JScript. Mit dem Erscheinen der .NET Platform und ASP.NET vollzieht sich allerdings ein Quantensprung in der Programmierbarkeit von Webseiten. In ASP.NET k&ouml;nnen Sie komplexe Anwendungen einfach implementieren,
und mit C# (C Sharp) haben sie eine vollst&auml;ndige, objektorientierte Programmiersprache zur Verf&uuml;gung.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20001011</ArticleId>
<title><![CDATA[Fehlerbehandlung richtig eingesetzt]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[11.10.2000]]></date>
<description><![CDATA[Fehlerbehandlung in ASP Seiten ist ein Thema, das viel zu oft vernachl&auml;ssigt wird. ASP Seiten werden von Entwicklern geschrieben und getestet. Gedanken an
das m&ouml;gliche Auftreten von Fehlern werden ignoriert, Fehlerbehandlung findet nicht statt.
Wozu dient Fehlerbehandlung, wie funktioniert sie in ASP, und worauf mu&szlig; man achten? Diese Fragen m&ouml;chte der vorliegende Artikel anschneiden und beantworten.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001010</ArticleId>
<title><![CDATA[Fern&ouml;stliche Formulare / Unicode die Zweite]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[10.10.2000]]></date>
<description><![CDATA[Nur die wenigsten Programmierer werden in die Verlegenheit kommen eine 
japanische oder gar chinesische Website zu programmieren. Trotzdem erhielt ich
vor kurzem eine Email, in der ich um Rat gefragt wurde. Involviert war eine chinesische Website, genauer gesagt, ein Webformular, das in ASP auszuwerten war.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001009</ArticleId>
<title><![CDATA[Das Versenden von Emails selbst programmieren]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[9.10.2000]]></date>
<description><![CDATA[Emailkomponenten gibt es (beinahe) soviele wie Sand am Meer, und viele davon sind sogar gratis. Verwendet hat sie bestimmt schon (beinahe) jeder, sei es jetzt AspMail, CDONTS, SA-SmtpMail oder eine der vielen anderen. Etwas, das aber bestimmt (beinahe) keiner bis jetzt gemacht hat, ist sich eine Emailkomponente selbst zu programmieren.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20001006</ArticleId>
<title><![CDATA[Tracing in ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[6.10.2000]]></date>
<description><![CDATA[Wer hat nicht schon einmal zu Debuggingzwecken das Response.Write Statement verwendet, um sich SQL Strings, Servervariablen, Variablenwerte und Rechenergebnisse auszugeben? Meistens hat man sich dadurch das Layout (kurzfristig) zerst&ouml;rt, und man mu&szlig;te die Statements sp&auml;ter wieder l&ouml;schen oder auskommentieren. Mit der Tracing Funktionalit&auml;t von ASP.NET kann man Debugmeldungen ausgeben oder die Zeit eines Scripts timen - und das, ohne zwischen Test- und Releaseversion einer ASP.NET Seite Unterschiede machen zu m&uuml;ssen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20001005</ArticleId>
<title><![CDATA[Zippen und entzippen von Dateien]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[5.10.2000]]></date>
<description><![CDATA[Das &Uuml;bertragen von gro&szlig;en Datenmengen im Internet ist oftmals eine Frage der Geduld - oder der Planung. Hat man zum Beispiel jeden Tag eine komplette Website auf den Webserver zu kopieren, so ist dies sp&auml;testens bei 1 MB und 100 Dateien ein langwieriges Unterfangen. Um nun die Datenmenge und die Ladezeit zu minimieren, kann man Tools zum Komprimieren von 
Dateien verwenden und ein einfaches ASP Script zur Handhabung dieser auf dem Webserver ben&uuml;tzen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001004</ArticleId>
<title><![CDATA[Sprache des Benutzers erkennen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[4.10.2000]]></date>
<description><![CDATA[Das Internet ist ein wunderbares Medium - Man hat auf seiner Internetsite 
Besucher aus aller Welt. Die Schattenseite dabei ist, nicht jeder spricht Englisch
oder Deutsch. In vielen internationalen Sites findet man daher Links oder Buttons
zu Versionen der Site in anderen Sprachen vor. M&ouml;chte man es dem Besucher ein wenig bequemer machen, so kann man in einer ASP Seite durchaus herausfinden, welche Sprache der Besucher denn gerne auf Webseiten lesen w&uuml;rde, und die dementsprechende Version der Seite anzeigen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20001003</ArticleId>
<title><![CDATA[Einf&uuml;hrung in Stringoperationen]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[3.10.2000]]></date>
<description><![CDATA[Jede Website muß mit Strings arbeiten, und sei es "nur", um Daten vom Benutzer einzulesen und zu validieren.
Um eine erfolgreiche Validierung durchzuführen, können Sie auf die vielen Stringbehandlungs-Funktionen in VBScript 
zurückgreifen. Unter anderem sollten Sie besonders auf die Gro&szlig;- und Kleinschreibung der Dateinamen achten.
Sie verwenden zum Beispiel ein Formular in Ihrer Webseite und wollen die dort eingegebenen Daten nutzen, sei es 
f&uuml;r Ihre Statistiken oder nur zum Speichern dieser Daten in einer Datenbank. Dann sollten Sie eventuell 
vorhandene Leerzeichen am Anfang und am Ende jedes Datensatzes entfernen. Oder wie oft haben Sie schon 
verschiedenste Zeichenketten miteinander vergleichen m&uuml;ssen?]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20001002</ArticleId>
<title><![CDATA[Arrayfunktionen]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[2.10.2000]]></date>
<description><![CDATA[In diesem Artikel werden Sie die wichtigsten Array-Funktionen, wie z.B. Split() und Join(), kennen- und verwenden lernen. VBScript bietet Ihnen eine relativ gro&szlig;e Zahl an Array-Funktionen, welche Ihnen die Arbeit mit Arrays 
erheblich erleichtern k&ouml;nnen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000929</ArticleId>
<title><![CDATA[Dateien lesen in ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[29.9.2000]]></date>
<description><![CDATA[Im Artikel "Directory Browsing a la .NET" haben wir uns bereits das erste Mal mit dem System.IO Namespace vertraut gemacht. Heute werden wir uns mit den Inhalten der Dateien besch&auml;ftigen, und zwar wie man Dateien ausliest. Und das sowohl f&uuml;r Textdateien als auch Bin&auml;rdateien.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000928</ArticleId>
<title><![CDATA[Nachrichten an Newsserver (NNTP) mittels CDOSYS senden]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[28.9.2000]]></date>
<description><![CDATA[Die ben&ouml;tigte Funktionalit&auml;t um eine Nachricht an eine beliebige 
Newsgroup zu senden, wird vollst&auml;ndig von der CDOSYS Komponente zur Verf&uuml;gung gestellt. Da CDOSYS Teil des Windows 2000 Server Betriebsystems ist, kann es von jeder ASP Seite aus, die auf einem IIS 5.0 gehostet wird, aufgerufen und benutzt werden.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000927</ArticleId>
<title><![CDATA[Das Array, unendliche Weiten?]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[27.9.2000]]></date>
<description><![CDATA[In diesem Artikel werden Sie lernen wie man ein-, zwei- und mehrdimensionale Arrays deklariert und mit ihnen umgeht. Ich werde in diesem Array-Grundlagenartikel auch noch darauf eingehen, wie man diese einsetzen kann.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000926</ArticleId>
<title><![CDATA[Collections einmal anders: Stacks und Queues]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[26.9.2000]]></date>
<description><![CDATA[Unter ASP wurden wir mit Collections ziemlich kurz gehalten - es gab nur das Scripting.Dictionary. Die Zeiten haben sich allerdings ge&auml;ndert, und ASP.NET bietet uns Implementationen f&uuml;r first in, first out Collections als auch first in, last out Collections: Queues (FIFO) und Stacks.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000925</ArticleId>
<title><![CDATA[Services &uuml;ber das Web managen]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.9.2000]]></date>
<description><![CDATA[Im heutigen Artikel besch&auml;ftigen wir uns mit den Grundlagen des Arbeitens mit Windows Services - etwas, das definitiv wert ist, administriert zu werden. Dazu verwenden wir wieder einmal ASP.NET und das .NET Framework SDK. Apropos: ausnahmsweise g&auml;be es auch f&uuml;r ASP einen Weg, um an einer
eigenen Komponente vorbeizukommen: WMI, Windows Management Instrumentation.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000922</ArticleId>
<title><![CDATA[Eventbehandlung bei ASP.NET WebForms]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[22.9.2000]]></date>
<description><![CDATA[In diesem Artikel erlernen Sie das Grundr&uuml;stzeug zur Eventbehandlung in ASP.NET. Beginnend mit dem einfachsten Fall des Page_Load Events einer ASP.NET Seite, &uuml;ber die sehr n&uuml;tzliche IsPostBack Eigenschaft, bis zur Triggerung von Events bei ASP.NET WebForms.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000921</ArticleId>
<title><![CDATA[Ver- und entschl&uuml;sseln von Texten mit PGP]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[21.9.2000]]></date>
<description><![CDATA[Man kann in ASP Seiten mit Hilfe einer Komponente Texte mittels PGP ver- und 
entschl&uuml;sseln. Leider ist mir keine ActiveX-Komponente bekannt, die diese
Funktionalit&auml;t direkt integriert hat.
Jedoch kann man die Funktionalit&auml;t der NSDPGP Komponente dazu benutzen, 
um beliebige PGP-verschl&uuml;sselte Texte zu entschl&uuml;sseln,
oder Texte mittels PGP zu verschl&uuml;sseln.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000920</ArticleId>
<title><![CDATA[PGP-Verschl&uuml;sselung bei Dateien]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[20.9.2000]]></date>
<description><![CDATA[PGP ist ein Verschl&uuml;sselungssystem, mit dessen Hilfe man 
vertrauliche Daten Ver- und Entschl&uuml;sseln kann. Dies ist besonders hilfreich, wenn man Nachrichten in Emails oder Attachments verschl&uuml;sseln will. Ein anderes Anwendungsgebiet w&auml;re, Dateien am Webserver zu verschl&uuml;sseln, um diese gefahrlos zum Download zur Verf&uuml;gung zu stellen.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000919</ArticleId>
<title><![CDATA[Emails mittels CDOSYS versenden]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[19.9.2000]]></date>
<description><![CDATA[Mit dem Erscheinen von Windows 2000 und IIS 5.0 steht dem ASP Programmierer eine neue M&ouml;glichkeit offen um Emails zu versenden. Mit dem Betriebssystem Windows 2000 Server wird die "Collaboration Data Objects" (CDO) Library (CDOSYS.DLL) ausgeliefert, die Nachrichten &uuml;ber SMTP oder NNTP versenden kann.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000918</ArticleId>
<title><![CDATA[Emails mit ASP.NET versenden]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[18.9.2000]]></date>
<description><![CDATA[Etwas, das sich heutzutage auf jeder Website findet, ist ein Email-Anfrageformular. Das wird sich wahrscheinlich auch nicht so schnell &auml;ndern, deswegen werde ich heute vorstellen, wie man Emails in ASP.NET verschickt: von ganz einfach bis hin zu HTML Mails und Attachments.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000915</ArticleId>
<title><![CDATA[Eine Supportdatenbank in ASP erstellen (1/3)]]></title>
<author><![CDATA[Klaus Aschenbrenner]]></author>
<date><![CDATA[15.9.2000]]></date>
<description><![CDATA[In diesem Artikel m&ouml;chte ich Ihnen zeigen, wie ein Besucher einer Website eine Supportanfrage mittels Formular in eine Datenbank posten kann. Im 2. Teil dieser Serie werde ich Ihnen dann n&auml;herbringen, wie ein Supportmitarbeiter diese Anfrage bearbeiten und beantworten kann. Schlu&szlig;endlich werden Sie im 3. Teil dann sehen, wie aus diesen Supportanfragen und Supportantworten eine FAQ aufgebaut werden kann.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000914</ArticleId>
<title><![CDATA[Hotfix Check Tool f&uuml;r IIS 5.0]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[14.9.2000]]></date>
<description><![CDATA[Speziell f&uuml;r Internet Information Services 5.0 unter Windows 2000 hat Microsoft ein Tool herausgebracht, das dem Webmaster einige Sorgen bez&uuml;glich Webserver-Sicherheit abnimmt: das Hotfix Check Tool erlaubt es, die Webserver Konfiguration auf Hotfixes zu untersuchen.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000913</ArticleId>
<title><![CDATA[Einf&uuml;hrung in ASP.NET Validation Controls (Teil 2)]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[13.9.2000]]></date>
<description><![CDATA[Im 2. Teil der Artikelserie ASP.NET Validation Controls m&ouml;chte ich einige sehr interessante Aspekte aufgreifen. Zun&auml;chst besprechen wir die M&ouml;glichkeiten der Mehrfach-Validierung und die Verwendung der ValidationSummary Control bzw. der Page IsValid Eigenschaft.
Dieser Artikel besch&auml;ftigt sich auch mit der Wiederverwertbarkeit von
ASP.NET Code und die Integration von ASP.NET in vorhandene Webseiten.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000912</ArticleId>
<title><![CDATA[Mit PGP verschl&uuml;sselte e-Mails senden]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[12.9.2000]]></date>
<description><![CDATA[Kenner der computergest&uuml;tzten Kryptographie wissen, was PGP ist und wie man damit arbeitet. Nichtsdestotrotz gebe ich hier einen kleinen Einf&uuml;hrungskurs: PGP steht f&uuml;r Pretty Good Privacy, was auf Deutsch soviel wie &quot;ziemlich gute Geheimhaltung&quot; hei&szlig;t. Um nun von ASP aus  PGP verschl&uuml;sselte e-Mails versenden zu k&ouml;nnen, m&uuml;ssen Sie auf Ihrem Webserver einige Vorkehrungen treffen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000911</ArticleId>
<title><![CDATA[Einf&uuml;hrung in ASP.NET Validation Controls (Teil 1)]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[11.9.2000]]></date>
<description><![CDATA[Es gibt heutzutage kaum mehr Webseiten, die auf Pr&uuml;fung der Benutzereingaben verzichten k&ouml;nnen. Beginnend bei den einfachsten Szenarien, wie die &Uuml;berpr&uuml;fung einer e-Mail Adresse bei einem
Kontaktformular, oder Datums&uuml;berpr&uuml;fung bei Kreditkarten in einem Web Shop  - alles das ist m&ouml;glich mit den ASP.NET Validation Controls.
Dieser erste Teil der Artikelserie gibt Ihnen eine Einf&uuml;hrung in die Validation Controls in ASP.NET.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000908</ArticleId>
<title><![CDATA[Cookies in Flash mittels ASP manipulieren]]></title>
<author><![CDATA[Günter Hoffellner]]></author>
<date><![CDATA[8.9.2000]]></date>
<description><![CDATA[Das Setzen oder Auslesen von Cookies in Flash kann n&ouml;tig sein, um zum Beispiel die Personalisierung einer Website auch auf die Flash Datei ausdehnen zu k&ouml;nnen. Flash unterst&uuml;tzt leider kein direktes Setzen oder Lesen von Cookies. Daher mu&szlig; man entweder den vielfach beschriebenen Umweg &uuml;ber JavaScript gehen, oder man benutzt einfach ASP Skripts, um Cookies zu
setzen und zu lesen. Dies hat unter anderem den Vorteil, da&szlig; Flash auf Cookies auch bei ausgeschaltetem JavaScript zugreifen kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000907</ArticleId>
<title><![CDATA[Einfacher Test, ob der Browser Cookies annimmt]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[7.9.2000]]></date>
<description><![CDATA[Das Problem ist vielen Programmieren bekannt: Man benutzt Session Variablen
und kann sich nie sicher sein, da&szlig; der Browser des Benutzers auch den 
zugeh&ouml;rigen Sessioncookie annimmt. Akzeptiert der Browser den Cookie nicht,
so kann man f&uuml;r den Benutzer keine Werte in Session Variablen speichern.
Ohne Session Variablen zu benutzen ist zum Beispiel die Implementation eines 
abgesicherten Bereiches einer Website nur mit sehr viel Aufwand m&ouml;glich.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000906</ArticleId>
<title><![CDATA[Sortieren von Arrays in VBScript]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[6.9.2000]]></date>
<description><![CDATA[In diesem Artikel werden Sie lernen Elemente in einem eindimensionalen Array zu sortieren, da dies hin und wieder von gro&szlig;en Nutzem ist. Da VBScript keine passende Funktion und auch keine Sortierbefehle zur Verf&uuml;gung stellt, m&uuml;ssen wir auf das gute alte Selberprogrammieren zur&uuml;ckgreifen. 
Ich werde Ihnen zwei bekannte Sortieralgorithmen vorstellen. Wir werden Beispiele 
mit dem sehr weit verbreiteten Bubble-Sort-Algorithmus und einem &auml;lteren, aber dennoch sehr schnellen Algorithmus, dem Quick-Sort-Algorithmus ausprogrammieren und besprechen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000905</ArticleId>
<title><![CDATA[Beteiligte Komponenten bei SET Transaktionen (Teil&nbsp;2)]]></title>
<author><![CDATA[Christian Weissengruber]]></author>
<date><![CDATA[5.9.2000]]></date>
<description><![CDATA[Im letzten Artikel, Beteiligte Komponenten bei SET Transaktionen (Teil 1), haben wir das Gateway und das Wallet kennengelernt. Jetzt kommen wir zum "Zentrum" der gesamten SET-Trilogie, dem Point Of  Sale, kurz POS genannt.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000904</ArticleId>
<title><![CDATA[Beteiligte Komponenten bei SET Transaktionen (Teil&nbsp;1)]]></title>
<author><![CDATA[Christian Weissengruber]]></author>
<date><![CDATA[4.9.2000]]></date>
<description><![CDATA[Nachdem der ersten Teil dieser Artikelserie sich mit der SET-Technologie im Allgemeinen besch&auml;ftigt hat, so geht dieser Artikel auf die einzelnen SET-Komponenten, wie das Payment Gateway und das Wallet genauer ein.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000901</ArticleId>
<title><![CDATA[Sichere Zahlungen im Internet mit SET]]></title>
<author><![CDATA[Christian Weissengruber]]></author>
<date><![CDATA[1.9.2000]]></date>
<description><![CDATA[Die Abwicklung gesch&auml;ftlicher Transaktionen im Internet funktioniert nur, wenn auch der Zahlungsverkehr f&uuml;r den Kunden wie f&uuml;r den H&auml;ndler sichergestellt ist und er darauf vertrauen kann, da&szlig; Mi&szlig;brauch ausgeschlossen ist. Niemand wirft gerne seine Kreditkartendaten in ein schwarzes Loch.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000831</ArticleId>
<title><![CDATA[Unicode und ASP (Einf&uuml;hrung)]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[31.8.2000]]></date>
<description><![CDATA[Unicode ist ein weltweiter Zeichensatz-Standard, der die g&auml;ngigsten 
Buchstaben und Zeichen enth&auml;lt, die weltweit in der  Gesch&auml;ftswelt Verwendung finden. Der Unicode Standard ist die Basis f&uuml;r weitere Standards wie XML, JavaScript oder WML. ASP auf IIS 4.0 oder IIS 5.0 arbeitet intern mit Unicode um Zeichen zu speichern und zu verarbeiten - und damit kommt man als Programmierer mehr als einmal in Ber&uuml;hrung.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000830</ArticleId>
<title><![CDATA[Session State bei parallelen Browser-Frames und Fenstern]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[30.8.2000]]></date>
<description><![CDATA[Das Session Objekt und der Session State in ASP sind vielf&auml;ltig einsetzbar. Wie manch einer schon mit Bedauern feststellen mu&szlig;te, funktioniert
eine Session nur dann sehr gut, wenn der User von einer einfachen Seite zur
n&auml;chsten Seite geht. Arbeitet man jedoch mit Framesets, so taucht
ein Problem auf.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000829</ArticleId>
<title><![CDATA[Regul&auml;re Ausdr&uuml;cke / Regular Expressions]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[29.8.2000]]></date>
<description><![CDATA[Ob man pr&uuml;fen will, ob eine Zeichenkette ihrer Form nach wirklich eine Email Adresse sein kann, oder ob man bestimmte Zeichenfolgen in einer langen Zeichenkette suchen oder gar ersetzen will - Regul&auml;re Ausdr&uuml;cke sind ein effizienter und intelligenter Weg um in einem ASP Skript diese Zeichenkettenoperationen durchf&uuml;hren zu lassen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000828</ArticleId>
<title><![CDATA[Verwenden von COM Komponenten in ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.8.2000]]></date>
<description><![CDATA[Im heutigen Artikel besch&auml;ftige ich mich mit einem Thema, das sehr viele ASP.NET Umsteiger interessieren wird: wie kann ich meine gekauften oder selbst erstellten COM Komponenten in der ASP.NET Umgebung einsetzen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000825</ArticleId>
<title><![CDATA[WHOIS Abfragen a la .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.8.2000]]></date>
<description><![CDATA[Des &ouml;fteren m&ouml;chte man wissen, wem eine Domain geh&ouml;rt. Um an diese Informationen zu kommen, geht man zur entsprechenden Registry (DENIC, Network Solutions, etc), und macht dort eine sogenannte WHOIS Abfrage (Lookup). Der Haken an der Sache ist halt der, da&szlig; man wissen mu&szlig;, welche Registry f&uuml;r welche TLD's (Top Level Domain) zust&auml;ndig ist.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000824</ArticleId>
<title><![CDATA[Scrapen von Webseiten]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[24.8.2000]]></date>
<description><![CDATA[In Webanwendungen ist es mittlerweile immer &ouml;fter n&ouml;tig, w&auml;hrend der Abarbeitung einer Seite auf Informationen von anderen Sites zuzugreifen: zum Beispiel f&uuml;r Kreditkartenautorisierung, aktuelle Wetterwerte abholen (und in das eigene Seitendesign einbauen), und vieles mehr.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000823</ArticleId>
<title><![CDATA[Die Hashtable Klasse]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[23.8.2000]]></date>
<description><![CDATA[Neben Arrays f&uuml;r Elementzugriff via Index konnte man in VBScript mit Hilfe der Dictionary Komponente den Elementzugriff mittels Schl&uuml;ssels (Key) bewerkstelligen. Mit ASP.NET und dem .NET Framework kommen etliche neue Collection Klassen. Unter anderem mit dabei ist die Hashtable Klasse, die einige neue (hilfreiche) Funktionen mitbringt.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000822</ArticleId>
<title><![CDATA[Mailadressen-&uuml;berpr&uuml;fen f&uuml;r Fortgeschrittene]]></title>
<author><![CDATA[Stephan Troxler]]></author>
<date><![CDATA[22.8.2000]]></date>
<description><![CDATA[Man kennt die Problematik - eine Mailadresse die via Webformular entgegengenommen wird, kann man von der Syntax her auf Richtigkeit pr&uuml;fen wie man will, sie kann immer noch ung&uuml;ltig (nicht existent) sein. Ob sie funktioniert kommt dann erst beim effektiven Gebrauch auf.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000821</ArticleId>
<title><![CDATA[Streams in NTFS Dateien]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[21.8.2000]]></date>
<description><![CDATA[Im heutigen Artikel m&ouml;chte ich etwas in die Untiefen von NTFS (NT File System) abtauchen, und ein interessantes Feature besprechen: Streams. Zuerst werde ich mich mit den Grundlagen besch&auml;ftigen, und dann Beispiele bringen, wie man in Streams schreibt, und Daten aus Streams ausliest.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000818</ArticleId>
<title><![CDATA[Debuggen von ASP Skripts - Teil 1]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[18.8.2000]]></date>
<description><![CDATA[Es wird Ihnen schon aufgefallen sein, da&szlig; in Ihren ASP-Scripts kleinere oder gr&ouml;&szlig;ere Fehler auftauchen, nach denen Sie oft lange suchen m&uuml;ssen. Auch wenn Ihre Scripts schon einmal dem Anschein nach fehlerfrei gelaufen sind, ist es die Pflicht eines jeden verantwortungsvollen Programmieres, jede Zeile seines Codes auf Fehler zu pr&uuml;fen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000817</ArticleId>
<title><![CDATA[Serverseitiges Caching mit XCache]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[17.8.2000]]></date>
<description><![CDATA[Etwas, das man am Client vermeiden m&ouml;chte ist das Cachen von Seiten. Am Server allerdings w&auml;re es eine tolle Sache, wenn Seiten, die f&uuml;r alle User gleich sind - aber dynamisch generiert werden - f&uuml;r eine bestimmte Zeitspanne gecacht werden k&ouml;nnten. Und noch besser w&auml;re es, bestimmte Teile der Seite zu cachen, allerdings andere per User zu generieren.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20000816</ArticleId>
<title><![CDATA[Die Kalender-Komponente in ASP.NET]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[16.8.2000]]></date>
<description><![CDATA[Momentan trifft man Kalender auf Webseiten eher selten an, vielleicht weil sie in HTML oder ASP sehr aufwendig zu implementieren waren und sind. Das &auml;ndert sich nun mit der Calendar Komponente von ASP.NET. Mit ein paar Handgriffen zaubern Sie einen Kalender der nicht nur h&uuml;bsch ausschaut, sondern auch funktionell ist - das ist Rapid Development!]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000814</ArticleId>
<title><![CDATA[Webserver-Tuning mit XTune]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[14.8.2000]]></date>
<description><![CDATA[Um die verschiedenen Einstellungsm&ouml;glichkeiten eines Internet Information Servers (IIS 4.0 und IIS 5.0) zum Tuning wirklich n&uuml;tzen zu k&ouml;nnen bedarf es normalerweise eines sehr fundierten Wissens &uuml;ber den Aufbau des IIS. Die Tuningm&ouml;glichkeiten sind vielf&auml;ltig, und das Einstellen wird durch das XTune Tool erheblich erleichert.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20000811</ArticleId>
<title><![CDATA[Ausgabe der Event Log Eintr&auml;ge a la ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[11.8.2000]]></date>
<description><![CDATA[Das Event Log unter Windows 2000 ist so ziemlich die wichtigste Informationsquelle
f&uuml;r einen Administrator - weil dort s&auml;mtliche vorgefallenen Ereignisse vom Erfolg bis zum katastrophalen Mi&szlig;erfolg vermerkt sind. Und da es so wichtig, was liegt n&auml;her als diese Informationen &uuml;ber das Web anzeigbar zu machen?]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000810</ArticleId>
<title><![CDATA[Auslesen von Emails aus einem POP3 Account]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[10.8.2000]]></date>
<description><![CDATA[Obwohl es auf den ersten Anschein komisch anmutet Emails via ASP auszulesen, so
kann es f&uuml;r gewisse automatisierte Vorg&auml;nge doch sehr n&uuml;tzlich werden. Allerdings - um Emails auslesen zu k&ouml;nnen, braucht man eine Komponente, die das von den meisten Emailservern gesprochene POP3 Protokoll versteht.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000809</ArticleId>
<title><![CDATA[Performance Monitoring a la .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[9.8.2000]]></date>
<description><![CDATA[Im heutigen Artikel werde ich Ihnen zeigen, um wieviel einfacher es in ASP.NET unter Zuhilfenahme des .NET Frameworks ist, Performance Counter auszulesen und auszuwerten. Man kann sogar Teile des NT Performance Monitors nachbauen, ohne wirklich viel Zeit daf&uuml;r aufwenden zu m&uuml;ssen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000808</ArticleId>
<title><![CDATA[Einf&uuml;hrung in ASP.NET Web Forms]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[8.8.2000]]></date>
<description><![CDATA[Wenn Sie mit ASP und Formularen gearbeitet haben, dann h&auml;tten Sie sicher gerne ein einheitliches serverseitiges Controlmodell zur Verf&uuml;gung gehabt, das Ihnen das Arbeiten mit Werbformularen wie mit Visual Basic Formularen erlaubt. Mit ASP.NET haben Sie genau diese Funktionalit&auml;t - jedes Element eines Formulars ist auch am Server in ASP.NET als echtes Objekt (Control) ansprechbar.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000807</ArticleId>
<title><![CDATA[Windows 2000 Internet Server Security Configuration Tool]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[7.8.2000]]></date>
<description><![CDATA[Sicherheit ist ein Thema, das man nie aus den Augen lassen sollte.  Sp&auml;testens bei einem gro&szlig;en E-Commerce Project auf einem 
Webserver unter IIS 5.0 sollte man sich ernsthaft Gedanken &uuml;ber die Absicherung des Webservers machen. Auch in einem Intranet, das Informationen &uuml;ber den IIS 5.0 zur Verf&uuml;gung stellt, ist es ratsam, den Webserver abzusichern.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000804</ArticleId>
<title><![CDATA[Directory Browsing a la .NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[4.8.2000]]></date>
<description><![CDATA[Mit den .NET Framework Klassen im System.IO Namespace erf&uuml;llen sich alle W&uuml;nsche, die man an das FileSystemObject Objekt so gehabt h&auml;tte. In diesem ersten Artikel &uuml;ber Dateibearbeitung besch&auml;ftige ich mich mit dem Task des Auflisten von Dateien und Ordnern.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000803</ArticleId>
<title><![CDATA[Die String Klasse in C#]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[3.8.2000]]></date>
<description><![CDATA[Diesmal besch&auml;ftigen wir uns mit dem Funktionsumfang der String Klasse in C#. Ausgehend von einfachen Beispielen werde ich M&ouml;glichkeiten wie das Splitten von Strings, Finden von Zeichen und Zeichenketten, das Trimmen von Strings und vieles mehr besprechen.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000802</ArticleId>
<title><![CDATA[Dateiupload mit ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.8.2000]]></date>
<description><![CDATA[Etwas das unter ASP ohne Fremdkomponente nicht vern&uuml;nftig m&ouml;glich war ist das Uploaden von Dateien auf einen Webserver, obwohl die Verwendungsm&ouml;glichkeiten dieses Features vielf&auml;ltigst sind. ASP.NET bietet diese Funktionalit&auml;t mit einer HTML Control names HtmlInputFile, die dem Programmierer ein leistungsf&auml;higes aber einfaches Programmieren erm&ouml;glicht.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000801</ArticleId>
<title><![CDATA[Eine IP Adresse f&uuml;r mehrere Websites]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[1.8.2000]]></date>
<description><![CDATA[IP Adressen sind - zumindest f&uuml;r IPv4 - eine zur Neige gehende Resource. Dadurch ist man auch am Webserver manchmal gezwungen, mehrere Websites &uuml;ber eine einzige IP Adresse zu bedienen. Ein anderer Grund f&uuml;r mehrere Websites per IP Adresse w&auml;re, da&szlig; man einen Account bei einem ISP mit mehreren Sites besser auslasten m&ouml;chte.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20000731</ArticleId>
<title><![CDATA[Verwendung von Arrays in C#]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[31.7.2000]]></date>
<description><![CDATA[Heute m&ouml;chte ich Ihnen die Verwendung von Arrays (engl. f&uuml;r Feld) in C# pr&auml;sentieren. Dabei pr&auml;sentiere ich Arrays deren Gr&ouml;&szlig;e zur Compilezeit bestimmt ist, als auch solche, die zur Laufzeit mit variabler Gr&ouml;&szlig;e erzeugt werden k&ouml;nnen.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000728</ArticleId>
<title><![CDATA[On-the-fly Generierung von Graphiken]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.7.2000]]></date>
<description><![CDATA[Etwas, das f&uuml;r ASP Programmierer ohne Unterst&uuml;tzung einer Komponente nicht machbar ist, ist das dynamische Erstellen von Graphiken - und sei es nur ein einfacher graphischer Counter. Dem ist unter ASP.NET gl&uuml;cklicherweise nicht mehr so - mit einfachsten Bordmitteln kann man dynamisch Graphiken erstellen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000727</ArticleId>
<title><![CDATA[Berechnen von beliebigen mathematischen Formeln]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[27.7.2000]]></date>
<description><![CDATA[Vielleicht ist Ihnen das Problem bekannt: Sie wollen eine Berechnung
in einer ASP Seite durchf&uuml;hren, aber die mathematische Formel 
f&uuml;r diese Operation steht nicht von vorne herein fest. Wie kann man
diese Problemstellung l&ouml;sen, ohne einen Mathematikparser zu kaufen?]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000726</ArticleId>
<title><![CDATA[Datentypen in C#]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[26.7.2000]]></date>
<description><![CDATA[In diesem Artikel m&ouml;chte ich Ihnen die Datentypen von C# (sprich "C sharp") erkl&auml;ren. Dies ist zugegebenerma&szlig;en eines der trocken Kapitel aus der C#-Programmierung...]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000725</ArticleId>
<title><![CDATA[Schreiben einer Textdatei auf den Server]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[25.7.2000]]></date>
<description><![CDATA[Mit Hilfe des FileSystemObject Objektes kann man nicht nur Dateien und Dateiattribute lesen, sondern auch Text in eine Datei schreiben oder an eine Datei anh&auml;ngen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000724</ArticleId>
<title><![CDATA[Exception Handling in C#]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[24.7.2000]]></date>
<description><![CDATA[Ich nehme an, da&szlig; jeder VBScript Programmierer schon mindestens einmal die sehr eingeschr&auml;nkten M&ouml;glichkeiten der Fehlerbehandlung in das Land des Pfeffers gewunschen hat - ein einfaches On Error Resume Next ist nun wirklich nicht gerade das, was man unter zeitgem&auml;&szlig;er Fehlerbehandlung
verstehen sollte.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000721</ArticleId>
<title><![CDATA[Seitenzugriffe mit der PageCounter Komponente erfassen]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[21.7.2000]]></date>
<description><![CDATA[Um die Popularit&auml;t Ihrer Website zu &uuml;berpr&uuml;fen, k&ouml;nnen Sie auf den Seiten Ihrer Site einen Page Counter (Z&auml;hler) einsetzen, der die Clientzugriffe mitloggt. "Zuf&auml;lligerweise" wird mit IIS die PageCounter Komponente mitinstalliert]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000720</ArticleId>
<title><![CDATA[Das foreach Statement]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[20.7.2000]]></date>
<description><![CDATA[F&uuml;r VBScript Programmierer ist das foreach Statement ein alter Bekannter, unter einen anderen Namen: For...Each. In diesem Artikel betrachten wir die Unterschiede (VBScript vs C#), vor allem bei der Abarbeitung der ServerVariables und QueryString Collections.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000719</ArticleId>
<title><![CDATA[Datenaustausch zwischen Macromedia Flash und ASP]]></title>
<author><![CDATA[Günter Hoffellner]]></author>
<date><![CDATA[19.7.2000]]></date>
<description><![CDATA[Wenn man Flash in komplexe Aufgabenstellungen integriert, so mu&szlig; 
Flash als programmierbares Frontend mit serverseitigen Programmen 
wie ASP-Seiten zusammenarbeiten. Dies bedeutet in erster Linie, da&szlig; man Daten zwischen Flash und ASP austauscht, und zwar sowohl von Flash zu ASP, als auch von ASP zu Flash.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000718</ArticleId>
<title><![CDATA[Die Content Rotator Komponente]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[18.7.2000]]></date>
<description><![CDATA[Wenn Sie auf Ihrer Homepage ein wenig Abwechslung z.B. im Design w&uuml;nschen und dies mit wenig Aufwand bewerkstelligen wollen ist die Content Rotator Komponente die L&ouml;sung. Sie erm&ouml;glicht es Ihnen dynamische, informationsreiche Internet-Sites zu erstellen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000717</ArticleId>
<title><![CDATA[Schleifenbefehle in C#]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[17.7.2000]]></date>
<description><![CDATA[Im heutigen Artikel befassen wir uns mit den Schleifenbefehlen von C#: for, while und do. Wie im letzten C# Artikel  werde ich die Unterschiede zu VBScript herausarbeiten.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000714</ArticleId>
<title><![CDATA[Kontrollstatements in C#]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[14.7.2000]]></date>
<description><![CDATA[In diesem Artikel m&ouml;chte ich die beiden C# Kontrollstatements if und switch vorstellen, und zwar mit besonderem Fokus darauf, was man als VBScript Programmierer beachten mu&szlig;, um nicht in Fallen zu tappen.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000713</ArticleId>
<title><![CDATA[A Brief History of C#]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[13.7.2000]]></date>
<description><![CDATA[Ein wichtiger Bestandteil des Microsoft .NET Frameworks ist die Programmiersprache C# (sprich "C Sharp"). Diese Programmiersprache wurde von Grund auf f&uuml;r die Common Language Runtime designed, und kommt von der Windows Anwendungsentwicklung bis hin zur ASP.NET Programmierung zum Einsatz.]]></description>
<category><![CDATA[C#]]></category>
</article>
<article>
<ArticleId>20000712</ArticleId>
<title><![CDATA[Was ist neu in ASP.NET]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[12.7.2000]]></date>
<description><![CDATA[Willkommen zu einem Kurzbericht von der High-Tech Front - was gibt es Neues in ASP.NET? In diesem Artikel erfahren Sie in komprimierter Form, was Sie von ASP.NET erwarten k&ouml;nnen.]]></description>
<category><![CDATA[ASP.NET]]></category>
</article>
<article>
<ArticleId>20000711</ArticleId>
<title><![CDATA[Bannerwerbung mit ASP]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[11.7.2000]]></date>
<description><![CDATA[Viele Websites verwenden rotierende Werbung auf ihren Seiten. Warum nicht auch Ihre Site? - Mit der Ad Rotator Komponente, welche in ASP implementiert ist, bietet sich eine einfache und schnelle M&ouml;glichkeit an, dies zu realisieren.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000710</ArticleId>
<title><![CDATA[Cachen von Dynamischen Includes]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[10.7.2000]]></date>
<description><![CDATA[Im letzten Artikel haben wir uns mit dynamischen Includes im Generellen besch&auml;ftigt - diesmal werden wir die Ausf&uuml;hrung duch Caching deutlich beschleunigen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000707</ArticleId>
<title><![CDATA[Die Einbindung von WBMP-Graphiken in WML]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[7.7.2000]]></date>
<description><![CDATA[Prinzipiell ist die Einbindung von Grafiken in WML der Kodierung in HTML &auml;hnlich. Jedoch sind einige Unterschiede zu HTML zu beachten, die ich in diesem Artikel anhand eines ASP Beispiels besprechen werde.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000706</ArticleId>
<title><![CDATA[Dynamische Includes in ASP]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[6.7.2000]]></date>
<description><![CDATA[Der Nachteil der #Include Direktive ist, da&szlig; man dan Namen der inkludierten Datei fix in den Sourcecode der ASP-Seite (oder des ASP-Skripts) schreiben mu&szlig;. Man kann also nicht zur Laufzeit des Skripts w&auml;hlen, welche Datei man includiert und ausgef&uuml;hrt haben m&ouml;chte.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000705</ArticleId>
<title><![CDATA[Navigation durch Webseiten mit Hilfe der Content Linking Komponente]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[5.7.2000]]></date>
<description><![CDATA[Eine Website mit einigen Unterseiten sollte immer eine Navigationsm&ouml;glichkeit bieten. Eine einfache M&ouml;glichkeit hierzu bietet die Verwendung der Content Linking Komponente. Diese erm&ouml;glicht es, Ihre Site wie ein Buch zu 
pr&auml;sentieren bzw. zu organisieren. Auch wenn weitere Seiten hinzukommen, ist der Aufwand gering, diese nachtr&auml;glich einzubinden.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000704</ArticleId>
<title><![CDATA[Erstellen von Balkendiagrammen in ASP]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[4.7.2000]]></date>
<description><![CDATA[Wenn man Diagramme h&ouml;rt, denkt man sofort, da&szlig; man daf&uuml;r eine zus&auml;tzliche Komponente ben&ouml;tigt. Dem ist aber nicht so - bereits mit der normalen HTML Funktionalit&auml;t ist es m&ouml;glich eine einfache Balkengrafik zu erzeugen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000703</ArticleId>
<title><![CDATA[SQL Server 2000 Volltextsuche]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.7.2000]]></date>
<description><![CDATA[Wer kennt das Problem nicht - man soll in einer Tabelle suchen, und zwar nach Textfragmenten. Solange es nur eine Spalte ist, &uuml;ber die gesucht werden soll, kann man sich ja noch mehr oder minder elegant mit LIKE und dem Prozentzeichen &uuml;ber die Runden retten...]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000630</ArticleId>
<title><![CDATA[Verwendung von SSL Test-Certificates]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.6.2000]]></date>
<description><![CDATA[Sie entwickeln gerade eine eCommerce Site f&uuml;r einen Kunden, und der Shop soll nat&uuml;rlich mit SSL (Secure Socket Layer) abgesichert werden. Dieser Artikel zeigt alle Schritte - von der Generierung des Certificate Antrags, Abholen des Certificates und anschlie&szlig;endem Installieren.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000629</ArticleId>
<title><![CDATA[Automatisation mit SQL Server]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[29.6.2000]]></date>
<description><![CDATA[In vorangegangenen Artikeln haben wir bereits gesehen, wie man mit Hilfe verschiedener Werkzeuge ASP Seiten automatisch ablaufen lassen kann. Dabei haben wir bis jetzt eine sehr m&auml;chtige Job-Engine nicht betrachtet - den SQL Server Agent.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20000628</ArticleId>
<title><![CDATA[Kreditkarten&uuml;berpr&uuml;fung mit ASP]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.6.2000]]></date>
<description><![CDATA[Eines der wichtigsten Dinge, die man f&uuml;r eine eCommerce Site ben&ouml;tigt ist die Validierung der eingegebenen Kreditkartennummern. Das Sch&ouml;ne an Kreditkartennummern ist, da&szlig; sie mathematisch in ihrer G&uuml;ltigkeit berechenbar sind.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000627</ArticleId>
<title><![CDATA[Einf&uuml;hrung in Data Shaping mit ADO]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[27.6.2000]]></date>
<description><![CDATA[Wer kennt das Szenario nicht, wo man zu einem Datensatz aus einer Mastertabelle die entsprechenden Datens&auml;tze aus der Kindtabelle abholen mu&szlig; - so zum Beispiel alle Bestellungen eines Kunden. Das ist nat&uuml;rlich nur eines der vielen Szenarien die auf Fremdschl&uuml;sselbeziehungen aufbauen k&ouml;nnen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000626</ArticleId>
<title><![CDATA[Tabellenerstellung mit ADOX]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[26.6.2000]]></date>
<description><![CDATA[Normalerweise erstellt man sich eine Access Datenbank direkt in MS Access um sie dann in ASP Seiten zu verwenden. Sehr wenige wissen allerdings, da&szlig; man diese Tabellenerstellung (als auch Datenbankerstellung) ohne MS Access abwicklen kann.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000616</ArticleId>
<title><![CDATA[Erste Schritte mit WML 3: Navigation und Links]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[16.6.2000]]></date>
<description><![CDATA[In diesem Artikel besprechen wir eine sehr wichtige Funktion in WML, die Ihre WAP-Site &uuml;bersichtlich gliedert und verhindert, da&szlig; der Betrachter den &Uuml;berblick verliert - die Navigation. Es werden elegante M&ouml;glichkeiten der Navigation besprochen, welche sich zum Aufrufen f&uuml;r Cards innerhalb eines Decks oder externer URLs eignen.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000615</ArticleId>
<title><![CDATA[Tools zur WML Programmierung]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[15.6.2000]]></date>
<description><![CDATA[In diesem Artikel werden einige Tools zur WML-Programmierung beschrieben. Ohne WML - Kenntnisse werden Sie allerdings nicht weit kommen, egal mit welchem Tool Sie arbeiten. Es wird Ihnen nicht erspart bleiben, sich auch direkt mit dem WML Sourcecode zu besch&auml;ftigen.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000614</ArticleId>
<title><![CDATA[Erste Schritte mit WML 2: Chic - Kosmetik in WML]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[14.6.2000]]></date>
<description><![CDATA[Damit ihre WML-Site nicht die Wirkung einer Valium-Packung hat, sollten Sie den Informationsflu&szlig; durch Textformatierung dezent auflockern. 
Mit "dezent" ist gemeint, da&szlig; Sie nur besonders wichtige Daten hervorheben sollten. Der Benutzer soll bei WML-Sites durch die Textformatierung lediglich auf besonders wichtige Informationen hingewiesen werden.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000613</ArticleId>
<title><![CDATA[WBMP - Das Grafikformat für WAP]]></title>
<author><![CDATA[Günter Hoffellner]]></author>
<date><![CDATA[13.6.2000]]></date>
<description><![CDATA[WBMP ist die Abk&uuml;rzung f&uuml;r Wireless Bitmap und das einzige Grafikformat, das im Moment f&uuml;r die Benutzung in WML Seiten verwendet werden kann. In diesem Artikel werden die bisher noch sehr einschr&auml;nkenden Spezifikationen, Hinweise zur Aufbereitung von Bildern, verschiedene Tools 
zur Arbeitserleichterung und die Einbindung in WML Files dargestellt.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000609</ArticleId>
<title><![CDATA[Erste Schritte mit WML (Wireless Markup Language)]]></title>
<author><![CDATA[Christian Holm]]></author>
<date><![CDATA[9.6.2000]]></date>
<description><![CDATA[Dies ist der Beginn einer neuen Serie bei AspHeute.com. Hier werden Sie Schritt für Schritt das Programmieren und Erstellen von WML-Sites anhand von Beispielen kennen lernen. In diesem Artikel werden die Grundstruktur von WML, Werkzeuge zur WML-Programmierung  und ein WML-Beispiel vorgestellt.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000608</ArticleId>
<title><![CDATA[404 Fehler elegant entsch&auml;rfen]]></title>
<author><![CDATA[Patrick A. Lorenz]]></author>
<date><![CDATA[8.6.2000]]></date>
<description><![CDATA[Die wohl bekannteste unter den Fehlermeldungen eines Web-Servers ist Numero 404, die die ern&uuml;chternde Feststellung "Object not found" auf den Bildschirm des hoffnungsvollen Surfers zaubert. In diesem Artikel stellt der Autor eine L&ouml;sung vor, mit der Ihr die trostlose Fehlerseite gegen ein funktionales Script 
austauschen k&ouml;nnt.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000607</ArticleId>
<title><![CDATA[IIS Konfiguration f&uuml;r WAP]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[7.6.2000]]></date>
<description><![CDATA[In diesem Artikel erkl&auml;re ich Ihnen die Konfiguration des Web-Servers (Internet Information Services, IIS) f&uuml;r WML-Seiten, in denen Sie auch ASP Scripts laufen lassen k&ouml;nnen.]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000606</ArticleId>
<title><![CDATA[Zugriff auf autom. generierte ID beim Einf&uuml;gen eines Datensatzes]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[6.6.2000]]></date>
<description><![CDATA[Fast jedes Datenbanksystem unterst&uuml;tzt ID Felder (autogenerierte, sich inkrementierende Werte), mit denen Datens&auml;tze eindeutig adressiert werden k&ouml;nnen. Allerdings ist das Auslesen dieses Wertes beim Einf&uuml;gen eines neuen Datensatzes so eine Sache...]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000605</ArticleId>
<title><![CDATA[Eine kurze Einf&uuml;hrung in die Technologie von WAP]]></title>
<author><![CDATA[Stefan Gründhammer]]></author>
<date><![CDATA[5.6.2000]]></date>
<description><![CDATA[Dieser Artikel befa&szlig;t sich mit den Grundlagen von WAP, speziell auch damit, wie WAP auf der Protokollebene funktioniert. Daneben enthält er eine beachtliche Zahl an Links zu Seiten über WAP-Entwickler-Tools, Disukssionsforen, Spezifikationen, WAP und WML-Kursen, Software Developer Kits für WAP, WAP-Browser, ...]]></description>
<category><![CDATA[WAP]]></category>
</article>
<article>
<ArticleId>20000602</ArticleId>
<title><![CDATA[Allgemeine MailParser-Klasse mit ASPMail]]></title>
<author><![CDATA[Patrick A. Lorenz]]></author>
<date><![CDATA[2.6.2000]]></date>
<description><![CDATA[Nachdem wir im Artikel <a href="/artikel/20000526.htm">Klassen in VBScript</a> die allgemeine Funktionsweise von Klassen kennengelernt haben, m&ouml;chte ich Euch heute eine Klasse vorstellen, die allgemein zum Versand von eMails verwendet werden kann.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000531</ArticleId>
<title><![CDATA[Generieren eines sicheren Pa&szlig;wortes]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[31.5.2000]]></date>
<description><![CDATA[Ein Pa&szlig;wort ben&ouml;tigt man in einer ASP-Applikation immer dann, wenn sich ein Benutzer mittels Kombination aus Benutzername und Pa&szlig;wort identifizieren soll. Ein "sicheres" Pa&szlig;wort darf nicht leicht zu erraten sein, es mu&szlig; eine eindeutige Folge von Buchstaben und Ziffern sein.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000530</ArticleId>
<title><![CDATA[Lesen von Textdateien]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[30.5.2000]]></date>
<description><![CDATA[Textdateien kann man in kleinen ASP-Applikationen vielf&auml;ltig einsetzen. Ob man sie als Speicherplatz für Daten benutzt, oder als Steuerungsdateien für bestimmte Anweisungen. Um Zugriff auf Textdateien zu erlangen, benutzt man unter ASP das FileSystemObject Objekt. Dieses ist Teil der Scripting Library, die mit VBScript geliefert wird.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000529</ArticleId>
<title><![CDATA[&Uuml;bergeben von Informationen von einer ASP-Seite zur n&auml;chsten]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[29.5.2000]]></date>
<description><![CDATA[Man kann Session Variablen benutzen, um Informationen von einer ASP-Seite an
andere ASP-Seiten der selben Website weiterzugeben. Dies erfordert jedoch, da&szlig; der Browser Cookies unterst&uuml;tzt und die ASP-Seite Sessions unterst&uuml;tzt.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000526</ArticleId>
<title><![CDATA[Klassen in VBScript]]></title>
<author><![CDATA[Patrick A. Lorenz]]></author>
<date><![CDATA[26.5.2000]]></date>
<description><![CDATA[Seit Version 5.0 bietet VBScript die M&ouml;glichkeit, Klassen anzulegen und somit mit Eigenschaften und Methoden zu arbeiten. Ob sich Klassen wirklich sinnvoll in VBScript einsetzen lassen, soll dieser Artikel kl&auml;ren.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000525</ArticleId>
<title><![CDATA[Access Abfragen in ADO verwenden]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[25.5.2000]]></date>
<description><![CDATA[Es gibt in MS Access Datenbanken Abfragen, die eine Mixtur aus SQL Server Views und Stored Procedures darstellen: Wenn man keine Parameter definiert, ist es mit einer View vergleichbar. Hat man Parameter festgelegt, dann hat man ein &Auml;quivalent zu Stored Procedures.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000524</ArticleId>
<title><![CDATA[Arbeiten mit Index Server Catalogs]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[24.5.2000]]></date>
<description><![CDATA[Wenn eine Website aus mehrheitlich statischen Seiten besteht - so wie AspHeute - dann bietet es sich an, den mit IIS gelieferten Index Server zu verwenden, um die Site f&uuml;r Besucher suchbar zu machen.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20000523</ArticleId>
<title><![CDATA[Dateiattribute unter ASP auslesen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[23.5.2000]]></date>
<description><![CDATA[Es gibt ASP-Applikationen, bei denen ist es unumg&auml;nglich, da&szlig; eine ASP-Seite auf die Festplatte, eine Datei, oder einen Ordner zugreift. Sei es nun, um eine Textdatei auszulesen, oder ein Unterverzeichnis und alle darin enthaltenen Dateien aufzulisten. Dieser Artikel zeigt prinzipiell auf, wie man Eigenschaften von Dateien unter ASP ausliest.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000522</ArticleId>
<title><![CDATA[&Uuml;berpr&uuml;fen von HTML-Formularen mit ASP]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[22.5.2000]]></date>
<description><![CDATA[Wenn ein Besucher Ihrer Site ein HTML-Formular abschickt, so ist oft der n&auml;chste Schritt, die eingegebenen Werte des Formulares zu &uuml;berpr&uuml;fen und gegebenenfalls eine Fehlermeldung auszugeben. Dieser Artikel pr&auml;sentiert ein Grundger&uuml;st f&uuml;r diese immer wiederkehrenden &Uuml;berpr&uuml;fungen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000519</ArticleId>
<title><![CDATA[Laden von Dateien aus dem Web mit ASP]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[19.5.2000]]></date>
<description><![CDATA[Um spezielle Anwendungen - wie Suchmaschinen oder Spider - mittels Active Server Pages programmieren zu k&ouml;nnen, ben&ouml;tigt man eine ASP-Komponente, die Dateien (und eventuell Bilder) aus dem Internet laden kann. Der Artikel beschreibt den Einsatz einer solchen Komponente am Beispiel der AspTear Komponente.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000518</ArticleId>
<title><![CDATA[ADO Konstanten und die Datei Adovbs.inc]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[18.5.2000]]></date>
<description><![CDATA[Wenn Sie ADO unter ASP einsetzen, so werden Sie beim Benutzen der diversen
Methoden und Eigenschaften des <i>Recordset-</i> und des <i>Connection</i> Objektes immer wieder ADO Konstanten ben&ouml;tigen. Diese Konstanten enthalten numerische Werte, die für bestimmte Attribute im Zusammenhang mit ADO Eigenschaften und Methoden stehen. Die Datei <i>Adovbs.inc</i> stellt alle ADO Konstanten zur Verf&uuml;gung.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000517</ArticleId>
<title><![CDATA[Zwischenspeichern von ASP Seiten]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[17.5.2000]]></date>
<description><![CDATA[Eine interessante Tatsache ist, da&szlig; der komplette Inhalt einer <i>Webseite schneller im Browser angezeigt</i> wird, wenn man die Ausgabe puffert. Dies ist eine Konsequenz der Art und Weise, wie Webserver und Browser w&auml;hrend eines Seitenaufrufes kommunizieren. Ausserdem gewinnt man durch das Puffern von ASP-Seiten neue M&ouml;glichkeiten der Fehlerbehandlung in ASP-Seiten, oder des Umleitens von ASP Seiten zu anderen Internetseiten.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000516</ArticleId>
<title><![CDATA[Einsatz des Recordset Objektes als Multifunktionaler Datenspeicher]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[16.5.2000]]></date>
<description><![CDATA[Das ADO <i>Recordset</i> Object (<i>ADODB.Recordset</i>) ist nicht nur geeignet, um Ergebnisse von Datenbankabfragen zu speichern. Man kann es auch Anstelle eines <i>Arrays</i> benutzen um komplexe Datens&auml;tze in ASP Seiten zu speichern und zu verwalten. Durch die Konzeption des ADO <i>Recordsets</i> als Objekt mit Eigenschaften und Methoden hat man einen einfachen und komfortablen Zugriff auf die gespeicherten Daten. Unter anderem bietet jedes <i>Recordset</i> Objekt von Haus aus die M&ouml;glichkeit nach bestimmten Werten zu suchen, Werte zu sortieren, Datens&auml;tze hinzuzuf&uuml;gen oder wieder zu l&ouml;schen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000515</ArticleId>
<title><![CDATA[Emails senden mit CDONTS]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[15.5.2000]]></date>
<description><![CDATA[Das CDONTS Objekt eignet sich hervorragend um Emails zu versenden ohne den Webserver zu belasten oder einen User unn&ouml;tig lange warten zu lassen. Das CDONTS.NewMail Objekt ist optimiert für hohe Performance und damit für Massen-Mails wie Newsletter- oder Listserver-Applikationen sehr gut geeignet.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000512</ArticleId>
<title><![CDATA[ASP-Fehlerbehandlung unter IIS5]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[12.5.2000]]></date>
<description><![CDATA[Mit IIS4 waren die M&ouml;glichkeiten der Fehlerbehandlung nur eingeschr&auml;nkt vorhanden. Unter IIS5 gibt es jetzt die M&ouml;glichkeit, von ASP ausgel&ouml;ste Fehler zentral in einer Datei abzuhandlen. Der Schl&uuml;ssel dazu ist der HTTP Status Code 500.100.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000511</ArticleId>
<title><![CDATA[Automation - WSH versus Wget]]></title>
<author><![CDATA[Werner Kofler]]></author>
<date><![CDATA[11.5.2000]]></date>
<description><![CDATA[Eine Frage, die h&auml;ufig auftritt ist: Wie kann ich ASP-Scripts zu bestimmten Zeiten aufrufen? Oder, eng damit verbunden: Wie kann ich die Ausgabe eines ASP-Scripts in eine Datei umleiten?]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20000510</ArticleId>
<title><![CDATA[ASP Scripts verschl&uuml;sseln]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[10.5.2000]]></date>
<description><![CDATA[Der Schutz geistigen Eigentums (Urheberrecht) ist besonders am Internet ein sehr hei&szlig;es Thema. Und wir als ASP Programmierer sind mitbetroffen - unsere Scripts sind f&uuml;r jedermann lesbar, der Zugriff auf die lokale Festplatte hat.]]></description>
<category><![CDATA[Sicherheit]]></category>
</article>
<article>
<ArticleId>20000509</ArticleId>
<title><![CDATA[Serverseitige Redirects mit IIS5]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[9.5.2000]]></date>
<description><![CDATA[Mit IIS 5 unter Windows 2000 sind 2 neue Methoden f&uuml;r serverseitige Redirects eingebaut worden: Server.Transfer (funktioniert im Prinzip wie das altbekannte GoTo Statement), sowie Server.Execute (vergleichbar mit dem Aufruf einer Prozedur).]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000508</ArticleId>
<title><![CDATA[Erstellen eines HTTP Test Tools]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[8.5.2000]]></date>
<description><![CDATA[Das Testen einer Website mit verschiedenen Browsern geh&ouml;rt zum Alltag eines Webentwicklers. Mit Browsertests alleine kann man allerdings nicht alle Details der Verbindung Web Server und Client manipulieren, was f&uuml;r Sicherheits- und Stabilit&auml;tstests wichtig sein kann.]]></description>
<category><![CDATA[Server]]></category>
</article>
<article>
<ArticleId>20000505</ArticleId>
<title><![CDATA[Session Variablen - Verwendung und Stolpersteine]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[5.5.2000]]></date>
<description><![CDATA[Session Variablen kommen dort zur Anwendung, wo man f&uuml;r einen einzelnen
Benutzer w&auml;hrend seines Besuches der Website Werte speichern will. So kann man zum Beispiel ASP-Seiten absichern, die nur befugten Usern (oder Mitgliedern) nach einer Authentifizierung (mittels Usernamen und Passwort) zug&auml;nglich gemacht werden.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000504</ArticleId>
<title><![CDATA[Formatierte Zahlenausgabe]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[4.5.2000]]></date>
<description><![CDATA[Um eine in VBscript errechnete Zahl dem User zu pr&auml;sentieren, ist es oft im Sinne der Benutzerfreundlichkeit, wenn man diese Zahl in der gew&uuml;nschten Weise formatiert, um so festzulegen, wieviele Kommastellen angezeigt werden, oder ob ein Tausenderzeichen eingef&uuml;gt werden soll.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000503</ArticleId>
<title><![CDATA[Einfache String Operationen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[3.5.2000]]></date>
<description><![CDATA[Operationen mit Textvariablen, die Strings enthalten, gibt es viele. Wenn man die Wichtigsten kennt, so kann man sich das Leben als ASP-Programmierer ganz 
erheblich erleichtern.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000502</ArticleId>
<title><![CDATA[Monitoring von ASP]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[2.5.2000]]></date>
<description><![CDATA[Performance Monitoring ist ein weiterer Baustein am Weg zu einer erfolgreichen Website. Heute wendet sich der Autor dem Active Server Pages Performance Counter Objekt zu, das spezielle Informationen &uuml;ber ASP zu Tage f&ouml;rdert.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20000428</ArticleId>
<title><![CDATA[Einf&uuml;hrung in Performance Monitoring]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.4.2000]]></date>
<description><![CDATA[Die eigenen ASP Seiten auf Geschwindigkeit zu optimieren, ist der erste Schritt zu einer Website, die viele gleichzeitige Benutzer bedienen kann. Allerdings kann auch noch so gut optimierter ASP Code den Server bis an seine Grenzen ausreizen - dieser Artikel zeigt, wie man diese Grenzen entdeckt, bevor die Kunden es tun.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20000427</ArticleId>
<title><![CDATA[Abfragen aller Application Variablen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[27.4.2000]]></date>
<description><![CDATA[Grunds&auml;tzlich bleibt in einer Application-Variablen der Wert solange
gespeichert, bis der Webserver hinunterf&auml;hrt oder die Variable gel&ouml;scht wird. Dieser Artikel zeigt, wie man herausfindet, welche Variablen mit welchen Werten zugewiesen wurden.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000426</ArticleId>
<title><![CDATA[Verf&uuml;gbarkeit von Objekten pr&uuml;fen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[26.4.2000]]></date>
<description><![CDATA[Will man auf einem (fremden) Webserver ein bestimmtes Objekt in einer ASP-Seite 
verwenden, so mu&szlig; die Objekt-Bibliothek, zu der das Objekt geh&ouml;rt, 
auf dem Server installiert sein.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000425</ArticleId>
<title><![CDATA[Speichern von Recordsets in Application-Variablen (Teil&nbsp;II)]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[25.4.2000]]></date>
<description><![CDATA[Mit ADO 2.5 (oder h&ouml;her) kann man das Stream Objekt benutzen, um das Recordset als XML im Stream Objekt zu speichern, und von dort als Textvariable wiederrum problemlos in einer Application- oder Session-Variable speichern.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000420</ArticleId>
<title><![CDATA[Speichern von Recordsets in Application-Variablen (Teil&nbsp;I)]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[20.4.2000]]></date>
<description><![CDATA[In einer ASP Anwendung kann es von Vorteil sein, Datenbankwerte, die nicht (oder nur sehr selten) ver&auml;ndert werden, in einer Application Variablen zu speichern. Dieser Artikel zeigt zwei M&ouml;glichkeiten auf...]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000419</ArticleId>
<title><![CDATA[Auswirkung des Providers auf die Datenbank Performance]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[19.4.2000]]></date>
<description><![CDATA[Um mittels ADO 2.5 eine Datenbank-Verbindung mit Hilfe des Connection Objektes aufzubauen gibt es mehr als eine M&ouml;glichkeit. Man kann unterschiedliche Datenbankprovider einsetzen, die deutliche Geschwindigkeitsunterschiede zeigen. Ein guter Grund, seinen Code zu optimieren...]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20000418</ArticleId>
<title><![CDATA[ADO Feld-Abfragen Optimierung]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[18.4.2000]]></date>
<description><![CDATA[Viele Datenbankapplikationen, auch unter ASP, &ouml;ffnen ein ADO Recordset, um dann auf einzelne Felder oder Feldwerte des Recordsets zuzugreifen. Wenn man es richtig implementiert, kann man sich dabei 20% Performancesteigerung holen.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>20000417</ArticleId>
<title><![CDATA[Auslesen von XML Dateien mit dem DOM]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[17.4.2000]]></date>
<description><![CDATA[XML Dateien eignen sich hervorragend dazu, um Daten zu formatieren - aber weniger, diese so formatierten Daten dem XML-unbedarften Websurfer direkt anzuzeigen. Um XML am Server auslesen und als HTML formatiert zum Kunden schicken zu k&ouml;nnen, gibt es den XML Parser und das DOM...]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20000414</ArticleId>
<title><![CDATA[Messen der Verbindungsgeschwindigkeit]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[14.4.2000]]></date>
<description><![CDATA[Im Internet ist ein deutlicher Trend zu gr&ouml;&szlig;eren Datenstr&ouml;men
hin festzustellen. Ein Browser kann &uuml;ber Leitungen unterschiedlicher Geschwindigkeit eine Internetseite von einem Server abrufen. F&uuml;r Sie als ASP Programmierer bedeutet das, da&szlig; Sie Ihre Webapplikationen auf sehr unterschiedliche Daten&uuml;bertragungsraten abstimmen m&uuml;ssen.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000413</ArticleId>
<title><![CDATA[Probleme beim Verarbeiten von Datumswerten]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[13.4.2000]]></date>
<description><![CDATA[Als Entwickler von Web Sites ist das Datumsformat ein ganz spezielles Problem, bei dem man sehr schnell anst&ouml;&szlig;t - weil sich die L&auml;ndereinstellungen des jeweiligen Servers auf den Code Ihrer ASP Seiten auswirken. Dieser Artikel zeigt eine L&ouml;sung, die auf allen Systemen die gew&uuml;nschten Ergebnisse liefert.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>20000412</ArticleId>
<title><![CDATA[Pr&uuml;fen ob ein Browser Cookies annimmt]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[12.4.2000]]></date>
<description><![CDATA[Ob ein Browser Cookies annimmt ist in vielen Anwendungen wichtig.
Wenn Sie eine einfache E-Commerce Applikation implementieren,
bei der die bereits bestellten Waren (Shopping-Bag) in einer Session 
Variablen mitgef&uuml;hrt werden,
oder einen dauerhaften Cookie zur Personalisierung Ihrer Website setzen wollen,
immer h&auml;ngt der Erfolg Ihres Bem&uuml;hens davon ab, ob der Browser
Cookies annimmt.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000411</ArticleId>
<title><![CDATA[Flash Plug-In Erkennung]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[11.4.2000]]></date>
<description><![CDATA[Ob nun Macromedia Flash nur als multimediales Intro f&uuml;r eine Website gebraucht wird, oder als tragendes Element zum Beispiel als Navigationsleiste,
immer stellt sich die bange Frage: &quot;Hat der User in seinem Browser auch das ben&ouml;tigte Flash Plug-In installiert?&quot;]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000410</ArticleId>
<title><![CDATA[Browsereigenschaften mit BrowserHawk 2000 bestimmen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[10.4.2000]]></date>
<description><![CDATA[Lernen Sie die Browserhawk Komponente kennen - in diesem "Appetizer-Artikel" stellt Christian die Komponente vor, in weiteren folgen dann konkrete Anwendungsbeispiele f&uuml;r Web Sites.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000407</ArticleId>
<title><![CDATA[XML Data Islands]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[7.4.2000]]></date>
<description><![CDATA[In Internet Explorer k&ouml;nnen verschiedenste Data Source Objects (DSO) eingebunden werden, und ein komponentenunabh&auml;ngiges DSO ist das XML Data Island. In Zusammenhang mit serverseitigem ASP/ADO Code kann man so Intranetanwendungen geschwindigkeitsm&auml;&szlig;ig auf die Spr&uuml;nge helfen.]]></description>
<category><![CDATA[XML]]></category>
</article>
<article>
<ArticleId>20000406</ArticleId>
<title><![CDATA[Auswertung von HTML Formularen mit ASP]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[6.4.2000]]></date>
<description><![CDATA[Dieser Artikel beschreibt die Grundlagen der Programmierung von HTML Formularen, und wie man Formulardaten in ASP Seiten auswertet.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000405</ArticleId>
<title><![CDATA[@-Direktiven auf ASP Seiten]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[5.4.2000]]></date>
<description><![CDATA[In diesem Artikel demonstriert der Autor wie die verschiedenen @ Direktiven  auf ASP Seiten eingesetzt werden - um dem Benutzer eine korrekte Darstellung der Daten zu garantieren, sowie die Geschwindigkeit der Seitenerstellung zu erh&ouml;hen.]]></description>
<category><![CDATA[ASP Grundlagen]]></category>
</article>
<article>
<ArticleId>20000404</ArticleId>
<title><![CDATA[Ein G&auml;stebuch in ASP erstellen - Teil 3]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[4.4.2000]]></date>
<description><![CDATA[Im letzten Teil der Artikelserie geht es um die Administration des G&auml;stebuchs. Der Autor zeigt, wie man Formulare zur Wartung (editieren und l&ouml;schen) erstellt, sowie den Zutritt zu diesen Wartungsseiten nur f&uuml;r berechtigte Personen absichert.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000403</ArticleId>
<title><![CDATA[Ein G&auml;stebuch in ASP erstellen - Teil 2]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[3.4.2000]]></date>
<description><![CDATA[Im zweiten Artikel erkl&auml;rt der Autor, wie man die Eintr&auml;ge des G&auml;stebuchs pr&auml;sentiert - und zwar getrimmt auf h&ouml;chste Geschwindigkeit. Paging einmal anders...]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000331</ArticleId>
<title><![CDATA[Ein G&auml;stebuch in ASP erstellen - Teil 1]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[31.3.2000]]></date>
<description><![CDATA[Willkommen zum ersten Artikel aus einer Serie von drei, in deren Rahmen sie ein vollst&auml;ndiges G&auml;stebuch mit ASP und ADO erstellen. Im ersten Teil erstellen sie das Eingabeformular und die Datenbank, und speichern einen neuen Eintrag in die Datenbank]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000330</ArticleId>
<title><![CDATA[Downloads per Email verschicken]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[30.3.2000]]></date>
<description><![CDATA[Wenn eine Firma Dateien zum Download anbietet, dann tut Sie dies f&uuml;r Benutzer, die sich die Datei sofort lokal abspeichern k&ouml;nnen. Nur wenige aber bieten an, da&szlig; sich der Kunde das Programm emailen kann (z.B. weil er gerade an einem &ouml;ffentlichen Terminal sitzt), um es sp&auml;ter am eigenen Rechner sofort zur Verf&uuml;gung zu haben.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>20000329</ArticleId>
<title><![CDATA[ADO Component Checker Tool]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[29.3.2000]]></date>
<description><![CDATA[Mit Hilfe des Component Checker Tools kann man herausfinden, welche ADO (ActiveX Data Objects) und MDAC (Microsoft Data Access Components) Version auf einem Computer installiert ist, Unterschiede zu Major Releases identifizieren, sowie die MDAC Installation vom Rechner entfernen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000328</ArticleId>
<title><![CDATA[Installation der neuesten ADO Version (ADO 2.5)]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[28.3.2000]]></date>
<description><![CDATA[Mit dem Erscheinen von Windows 2000 wurde MDAC 2.5 (Microsoft Data Access Components), und damit auch ADO 2.5 ein Bestandteil des Betriebssystems. Wenn sie also ein Windows 2000 Betriebssystem haben, dann ist ADO 2.5 schon automatisch installiert. Um die neueste ADO Version unter &auml;lteren Windows Betriebssystemen (Windows 95/98, Windows NT 4.0) zu installieren, ...]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>20000327</ArticleId>
<title><![CDATA[ADO und MDAC Versionen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[27.3.2000]]></date>
<description><![CDATA[Die lange Entwicklung von ADO brachte es mit sich, da&szlig; ADO in unterschiedlichen Versionen (auch bei gleicher Versionsnummer) existiert. Speziell f&uuml;r Entwickler von Anwendersoftware und Betreuer gro&szlig;er Windows NT/2000 und Windows 9x Netzwerke ist es oftmals wichtig, den Funktionsumfang der installierten ADO oder MDAC Version genau zu kennen. Dieser Artikel bringt einen &Uuml;berblick &uuml;ber die Geschichte, den Funktionsumfang und 
die verwendeten Vertiebswege der verschiedenen ADO und MDAC Versionen und Subversionen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>19990919</ArticleId>
<title><![CDATA[Geschwindigkeitsmessungen in ASP]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[19.9.1999]]></date>
<description><![CDATA[Nur eine Geschwindigkeitsmessung kann genauen Aufschlu&szlig; &uuml;ber die Performance verschiedener L&ouml;sungsans&auml;tze bringen. Gef&uuml;hlsm&auml;&szlig;ige Entscheidungen sind meist falsch.]]></description>
<category><![CDATA[Optimierung]]></category>
</article>
<article>
<ArticleId>19990828</ArticleId>
<title><![CDATA[Windows Script Components]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[28.8.1999]]></date>
<description><![CDATA[Eine Neueinf&uuml;hrung mit VBScript 5 (eigentlich den ganzen v5 Scriptengines) sind die Windows Script Components (WSC). Komponenten auf Basis einer Scriptsprache.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>19990827</ArticleId>
<title><![CDATA[Preisauszeichnung in Euro mit ASP]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[27.8.1999]]></date>
<description><![CDATA[Mit der Einf&uuml;hrung des Euro m&uuml;ssen nun Produkte doppelt ausgezeichnet werden, einmal in Landesw&auml;hrung, und auch in Euro.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>19990826</ArticleId>
<title><![CDATA[ODBC und ASP - Eine DSN zur Verwendung mit ASP definieren]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[26.8.1999]]></date>
<description><![CDATA[Einer der einfachsten Wege um unter ASP eine Verbindung zu einer Datenbank herzustellen ist, die zugeh&ouml;rige ODBC DSN zu definieren und einzusetzen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>19990825</ArticleId>
<title><![CDATA[ADO und ASP - Datenbanken einmal n&auml;her betrachtet]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[25.8.1999]]></date>
<description><![CDATA[Kaum eine anspruchsvolle Website die heute nicht mit einer Datenbank arbeitet. Ob Veranstaltungskalender, 
Produktkatalog,  Mitgliederdatenbank, G&auml;stebuch, personalisierte Dienste oder allgemein ver&auml;nderliche Daten -
all dies l&auml;&szlig;t sich mit Hilfe der Kombination ASP Skripts auf der Webserver Seite und einer Datenbank auf 
der anderen Seite verwirklichen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>19990819</ArticleId>
<title><![CDATA[JavaScript &amp; DHTML - Wie man Fehler findet bevor die Kunden es tun]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[19.8.1999]]></date>
<description><![CDATA[Wenn  man seine Seiten mit JavaScript oder DHTML aufpoliert, so kann man nie ganz sicher sein, da&szlig; es nicht doch einen bestimmten Browser oder eine Version in irgendeiner Sprache gibt, die auf die Seite allergisch reagiert sowie unsch&ouml;ne und nicht gerade imagef&ouml;rdernde Fehlermeldungen produziert.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>19990812</ArticleId>
<title><![CDATA[Dateien mit dem Browser auf Webserver laden]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[12.8.1999]]></date>
<description><![CDATA[Das HTTP Protokoll bietet die technische Voraussetzung zum Transferieren von Dateien mittels Webbrowser auf den Webserver. Dies kann zum Beispiel genutzt werden um Bild- und Textdateien von berechtigten Personen ganz gezielt auf den Webserver zu laden.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>19990811</ArticleId>
<title><![CDATA[Eigenschaften der Connection und Recordset Objekte]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[11.8.1999]]></date>
<description><![CDATA[Wenn man nun wissen m&ouml;chte, welche ADO Version (1.0, 1.5, 2.0, 2.1,...) auf einem Server l&auml;uft und welche Eigenschaften eine Connection oder ein Recordset Objekt hat, so kann man sich des nachfolgenden Scripts bedienen.]]></description>
<category><![CDATA[Datenbank]]></category>
</article>
<article>
<ArticleId>19990810</ArticleId>
<title><![CDATA[Installation/Upgrade von Komponenten]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[10.8.1999]]></date>
<description><![CDATA[Wie installiert, deinstalliert oder upgradet man Komponenten korrekt auf einem Web server.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>19990809</ArticleId>
<title><![CDATA[Email versenden mit AspMail]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[9.8.1999]]></date>
<description><![CDATA[Das ber&uuml;hmt-ber&uuml;chtigte "Anfrageformular" kommt auf (fast) jeder Internetsite vor, und wird meist so gel&ouml;st, da&szlig; an die zust&auml;ndige Personen eine Email mit den vom User eingegeben Formularwerten abgeschickt wird.]]></description>
<category><![CDATA[Komponenten]]></category>
</article>
<article>
<ArticleId>19990808</ArticleId>
<title><![CDATA[Caching bei Browser und Proxy - Woher Seiten wirklich kommen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[8.8.1999]]></date>
<description><![CDATA[Wieso bekommen nicht alle Kunden die aktuellsten Seiten, obwohl sich die Inhalte ständig ändern? Diesen Fragen wird in diesem Artikel nachgegangen.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>19990807</ArticleId>
<title><![CDATA[Dynamische Arrays - Fluch und Segen]]></title>
<author><![CDATA[Christian Koller]]></author>
<date><![CDATA[7.8.1999]]></date>
<description><![CDATA[Wie arbeitet man am effektivsten mit dynamischer Speicherverwaltung in VBScript.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
<article>
<ArticleId>19990806</ArticleId>
<title><![CDATA[Das Dictionary Objekt - Dein Feind und Helfer]]></title>
<author><![CDATA[Christoph Wille]]></author>
<date><![CDATA[6.8.1999]]></date>
<description><![CDATA[Eine Komponente, die allgemein sehr gerne übersehen wird, ist das Dictionary Objekt. Es kann allerdings sehr gewinnbringend auf einer Website eingesetzt werden.]]></description>
<category><![CDATA[ASP Tricks]]></category>
</article>
</articles>