<HTML>
<HEAD>
<TITLE>Tools zur WML Programmierung</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="In diesem Artikel werdem einige Tools zur WML-Programmierung beschrieben. 
Es wird Ihnen allerdings nicht erspart bleiben sich auch direkt mit dem WML Sourcecode zu besch&auml;ftigen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,WAP, WAP Programmierung, WML Seiten, Tools, Browser, WAP Browser, Emulator">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Tools zur WML Programmierung</H1>
<p>
Geschrieben von: <a href="../autoren/stefangruendhammer.htm">Stefan Gründhammer</a><br>
Kategorie: <a href="../kategorien/WAP.htm">WAP</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000615"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
In diesem Artikel beschreibe ich einige Tools zur WML-Programmierung, wo man sie findet und 
zu einigen Tools bekommen Sie noch kleine Tips.
</p>
<p>
Da es WAP noch nicht sehr lange gibt und es bei weitem noch nicht ausgereift ist, ergibt sich 
die M&ouml;glichkeit sehr viele Tools kostenlos zu bekommen, alles was Sie machen m&uuml;ssen ist sich zu 
registrieren (und das k&ouml;nnte als zuk&uuml;nftiger WAP-Developer sogar ein Vorteil sein).
</p>
<p>
Ach ja, eines sollte ich noch am Beginn noch in den Raum stellen: Ohne WML - Kenntnisse 
werden Sie nicht weit kommen, egal mit welchem Tool Sie arbeiten. Es wird Ihnen nicht erspart 
bleiben sich mit dem Sourcecode zu besch&auml;ftigen.
</p>


<h2>Emulatoren und Browser</h2>

<p>Als Emulator bezeichnet man ein Programm das ein anderes System (Betriebssystem) oder 
Programm simuliert. Es werden Hardware und auch Software durch eine reine Softwarel&ouml;sung nachgeahmt.<br>
Da nicht jeder von uns ein WAP f&auml;higes Handy oder ein anderes WAP taugliches Endger&auml;t besitzt 
sind solche Emulatoren sehr n&uuml;tzlich denn damit k&ouml;nnen Sie Ihre WML-Seiten auch auf dem PC 
anschauen, ohne da&szlig; Sie jede von Ihnen entwickelte Site erst einmal zu Ihrem Provider 
transferieren m&uuml;ssen.</p>


<p><u>Hier stelle ich Ihnen einige <b>Emulatoren</b> vor:</u></p>

<ul>
<li><b>WinWap 2.3 Light</b>:<br>
WinWap2.3 Light (der Firma Slob-Trot Software)  ist um einiges fehlerfreier als der Vorg&auml;nger 
die Version 2.2.<br>
Die Wap-Seiten werden zwar nicht auf einem Handy gezeigt, daf&uuml;r ist die Darstellung um einiges 
besser als in der Vorg&auml;ngerversion und so manchem anderen Browser. Der Download ist kostenlos 
und erm&ouml;glicht Offline- und auch Online-Browsing, alles was Sie brauchen ist Windows 95/98 oder NT. 
Die Darstellung von Tables ist mangelhaft und dadurch, da&szlig; die WML-Seiten in einem "normalen" 
Browserfenster dargestellt werden. Wenn Sie das Programm im Offline-Modus starten, gibt es noch 
einige Pfadprobleme, soda&szlig; die (bescheidene) Dokumentation nur &uuml;ber Umwege erreichbar war. 
Falls Sie die Sound-Events (Wurlizer?) st&ouml;rend finden, k&ouml;nnen Sie die im Options-Men&uuml; getrost 
deaktiveren.<br><br>

Download hier: <a href="http://www.slobtrot.com/index.html">http://www.slobtrot.com/index.html</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_winwap01.png" width=603 height=498 alt="" border="0"></div>
<br></li>

<li><b>Wapalizer</b>:<br>
Dieser Browser welcher von <a href="http://www.gelon.net">Gelon.net</a> angeboten wird, bietet 
Ihnen die M&ouml;glichkeit relativ schnell und ohne gro&szlig;en Aufwand Ihre Seite anzuschauen. Der 
Browser kann direkt &uuml;ber www.gelon.net ge&ouml;ffnet werden, Sie m&uuml;ssen den Wapalizer nicht einmal 
downloaden. Sie m&uuml;ssen nur die gew&uuml;nschte URL in das Textfeld eingeben und dann auf wapalize 
klicken, das war's.<br>
Sie k&ouml;nnen die von Ihnen gew&uuml;nschte Site auf 3 verschiedenen Handys darstellen lassen, 
standardm&auml;&szlig;ig wird das Nokia 7110 ge&ouml;ffnet, Sie k&ouml;nnen Ihre Site aber auch auf einem Ericsson 
R320s oder R380 anzeigen lassen.</li>

<li><b>Wapman</b>:<br>
Wapman (von <a href="http://edge.com.sg/">Edge.com.sg</a>) ist wahrscheinlich der 
futuristischte aller Wapbrowser. Sie k&ouml;nnen zwischen einer Version f&uuml;r Windows 95/98/NT/2000 
und einer f&uuml;r Palm OS w&auml;hlen, es werden auch verschiedene Skins f&uuml;r den Wapman angeboten was 
doch sehr an so manchen mp3-Player erinnert. Unter MS-Windows etwas instabil.<br>
Die Navigation erwies sich als sehr einfach, Sie brauchen nur auf den GO-Button zu klicken, 
dann geben Sie die von Ihnen gew&uuml;nschte URL ein und schon geht es los. Offline Browsing z.B. um 
Ihre fertige WML-Site zu testen war in dieser Version leider nicht m&ouml;glich, da wie gesagt nur URLs ansteuerbar waren. Also zum Site-Testing ungeeignet.<br><br>

Download hier: <a href="http://www.wap.com.sg/downloads">http://www.wap.com.sg/downloads</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_wapman01.png" width=312 height=398 alt="" border="0"></div>
<br></li>

<li><b>WapPage 1.0</b>:<br>
Wappage 1.0 ist von der Bedienung her Microsoft Frontpage sehr &auml;hnlich. 
Im Design-Modus k&ouml;nnen Sie einfache Objekte wie Text, Input-Felder per Maus in die Cards 
einf&uuml;gen. Anf&auml;nger haben somit sehr schnell Erfolge.<br>
Nat&uuml;rlich k&ouml;nnen Sie auch direkt mittels Codeeingabe Ihre WML-Site entwickeln. Der XML-Parser 
wirft manchmal mit w&uuml;sten Fehlermeldungen um sich, gibt aber ausreichend Auskunft wo sich der 
erste aufgetretene Fehler befindet.<br>
Die Projekte werden immer im Design-Modus ge&ouml;ffnet. Dadurch kann es passieren da&szlig; Code der in 
einem anderen Tool geschrieben wird, oder der Ihren programmtechnischen Konventionen entspricht 
neu strukturiert wird. Tables waren dem Objektkatalog v&ouml;llig fremd, und nach Programmierung 
dieser im Code-Fenster konnten diese im Programm nicht auf ihre Richtigkeit &uuml;berpr&uuml;ft 
werden.<br>
Zu beachten ist, da&szlig; der Design-Mode nicht als Vorschau-Browser dient.<br><br>

Im Programmdownload ist keine Dokumentation enthalten. Diese k&ouml;nnen Sie aber per Link an der 
Startseite downloaden.<br><br>

Download nach Registrierung kostenlos hier: <a href="http://www.wapmine.com/Products.asp">http://www.wapmine.com/Products.asp</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_wappage01.png" width=591 height=407 alt="" border="0"></div>
<br></li>

<li><b>WML EXPRESS</b>:<br>
WML Express ist ein Editor der es Ihnen erlaubt nahezu ohne Kenntnis von WML oder gar HTML die 
ersten Schritte mit WAP zu t&auml;tigen. Alles was Sie nach dem &Ouml;ffnen dieses Editors noch machen 
m&uuml;ssen ist, die wichtigsten Informationen Ihrer Site in ein Formular zu schreiben,alles andere 
macht dann WML Express.<br>
F&uuml;r die ersten Schritte recht brauchbar.<br><br>

Download hier: <a href="http://www.muenster.de/~sak/wml.htm">http://www.muenster.de/~sak/wml.htm</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_wmlexpress01.png" width=372 height=547 alt="" border="0"></div>
<br></li>

<li><b>Wireless Companion</b>:<br>
Der Wireless Companion von <a href="http://www.yourwap.com">YourWap</a> ist momentan einer der 
besten Wap-Browser, und noch dazu ein Web-Browser ist. Sie k&ouml;nnen auch hier aus verschieden 
Handymodellen w&auml;hlen (Nokia 7110, Ericsson R320), und diese auch testen falls Sie selbst noch 
keines besitzen oder sich ein neue zulegen wollen. Die verschiedensten Wap-Dienste wie z.B. 
shopping oder einfach nur durch Wap-Sites surfen sind mit dem Companion m&ouml;glich.<br>

Download hier: <a href="http://www.yourwap.com">http://www.yourwap.com</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_wirelesscompanion01.png" width=512 height=358 alt="" border="0"></div>
<br></li>

<li><b>Waptor</b>:<br>
Man k&ouml;nnte meinen den kleinen Bruder des HTML - Editors Homesite 
(von <a href="http://www.allaire.com">Allaire</a>) vor sich zu haben. 
Das Arbeiten wird mit diesem Tool zum Spa&szlig; (falls das m&ouml;glich ist).<br>
Der Waptor verf&uuml;gt &uuml;ber einige praktische Features an die man sich als zuk&uuml;nftiger 
WML-Programmierer leicht gew&ouml;hnen k&ouml;nnte, da w&auml;re das gute alte Go to line oder Replace und 
sogar das Tag-Highlighting funktioniert auch ganz brauchbar.<br>
Ich w&uuml;rde sagen sehr gelungen und eines der bisher besten L&ouml;sungen.<br><br>

Download hier: <a href="http://www.waptop.net/waptor/">http://www.waptop.net/waptor/</a><br>
<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_waptor01.png" width=407 height=304 alt="" border="0"></div>
<br></li>
</ul>


<h2>WBMP Grafik Konverter</h2>

<p>Um Bilder und Graphiken in ein WML-Seite einzuf&uuml;gen m&uuml;ssen Sie zuerst das geeignete 
Dateiformat zur Verf&uuml;gung haben, das w&auml;re .wbmp.<br>
Um z.B. ein .jpg in ein wbmp erfolgreich und zufriedenstellend umzuwandeln ben&ouml;tigen Sie einen 
Graphikkonverter. Eine genauere Vorgehensweise wird im Artikel von G&uuml;nter beschrieben.</p>

<p><u>Hier eine kurze Auflistung der g&auml;ngigsten <b>Konverter</b>:</u></p>

<ul>

<li><b>pic2wbmp</b>:<br>
Eines der besten Tools zur Konvertierung von Graphiken (Gif oder JPG) ist meiner Meinung nach 
pic2wbmp von Gingco New Media.<br>
Damit Sie dieses Tool benutzen zu k&ouml;nnen m&uuml;ssen Sie sich allerdings das Java Runtime 
Environment 1.3/ (JRE) der Firma Sun downloaden und installieren. Sie k&ouml;nnen damit unter 
anderem .bmp, .gif, .jpg, .tif importieren, dann k&ouml;nnen Sie der Graphik eine von Ihnen 
definierte Gr&ouml;&szlig;e in Pixel zuweisen und sogar den Hintergrund auf wei&szlig; &auml;ndern, und dann in .wbmp 
konvertieren. Pic2wbmp ist kostenlos und ist f&uuml;r Windows und Mac erh&auml;ltlich.<br>
Nach der Installation beider Programme m&uuml;ssen Sie die AUTOEXEC.BAT um die Zeile
<i>set path=c:\javasoft\jre1.3\bin;%path%</i> erweitern um das Programm zum Laufen zu 
bringen.<br><br>

Download hier: <a href="http://www.gingco.de/wap">http://www.gingco.de/wap</a><br>
Ben&ouml;tigt wird: <a href="http://java.sun.com/j2se/1.3/jre/">Java Runtime Environment 1.3/(JRE)</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_pic2wbmp.png" width=499 height=415 alt="" border="0"></div>
<br></li>

<li><b>WapTiger WBMP Converter</b>:<br>
Der WapTiger WBMP Converter ist ein Kommandozeilen orientiertres Tool zu konvertieren von Graphiken in wbmp. Sie sollten die folgenden 3 Schritte bei der Installation beachten:<br>
* Download der entsprechenden Version des BMP Converters f&uuml;r Ihre Plattform.<br>
' Erstellen einer s/w-Bitmap (1 Bit Farbtiefe) mit einem Malprogramm (z.B. Paint oder Gimp/Linux).<br>
Aufruf des Converters von der Kommandozeile oder DOS-Box(Windows) aus: <b><i>bmp2wbmp bild.bmp</i></b>. Und das war's auch schon.<br><br>

Download hier:<br>
Diese Datei ist unter Command Prompt (Dos Box) auszuf&uuml;hren: <a href="http://www.waptiger.de/download/msdos/bmp2wbmp.exe">http://www.waptiger.de/download/msdos/bmp2wbmp.exe</a><br>
Diese Version k&ouml;nnen Sie unter Linux (libc-2.1.2.)verwenden: <a href="http://www.waptiger.de/download/linux6/bmp2wbmp">http://www.waptiger.de/download/linux6/bmp2wbmp</a></li>

<li><b>WBMP-Converter</b>:<br>
Der WBMP-Converter von Teraflops ist im Stande .jpg, .gif, .bmp Dateien in .wbmp Dateien 
umzuwandeln. Sie k&ouml;nnen dieses Tool auch zum Betrachten von WBMP Bildern verwenden, unter 
anderem besitzt dieses Tool auch eine Preview- Funktion.<br>
Alles was Sie tun m&uuml;ssen ist sich zum gew&uuml;nschten Bild durchzubrowsen dieses auszuw&auml;hlen und 
dann auf View zu klicken. Wandelt GIF, JPG und .BMP-Grafiken in das Format WBMP.<br><br>

Download hier: <a href="http://www.teraflops.com/wbmp">http://www.teraflops.com/wbmp</a></li>

</ul>


<h2>SDK Toolkits</h2>

<br>Und noch zu guter letzt die K&ouml;nigsklasse der Tools, die SDKs (Software Development Kits).<br>
Ich stelle Ihnen hier noch die Toolkits der Firmen Nokia, Ericsson und Phone.com vor. Diese 
Toolkits enthalten unter anderem Editoren, Emulatoren, Konverter

<p><u>Die bekanntesten <b>Toolkits</b> sind:</u></p>

<ul>

<li><b>UP.SDK 4.0</b>:<br>
Dieses Produkt der Firma <a href="http://www.Phone.com">Phone.com</a> ist ein sehr gelungenes 
Paket, es empfiehlt sich aber vorher die Dokumentation(sehr umfangreich) durchzulesen. Ein 
Software Developement Kit mit einigen guten Beispielen und jeder Menge von Zubeh&ouml;r auf das ein 
Wap-Entwickler nicht verzichten sollte.<br>
Das Spiel mit der Registrierung f&uuml;r den kostenlosen Download dieses SDK's m&uuml;ssen Sie hier 
genauso wie bei fast allen Downloads wieder mitspielen, aber ich finde es zahlt sich aus.<br>
Das UP.SDK 4.0 ist f&uuml;r Windows 95, 98, NT geeignet, leider ist die Version 4.0 f&uuml;r Solaris noch nicht (Erscheinungstag dieses Artikels) tauglich, Sie k&ouml;nnen sich bis dahin ja die Version 3.2 downloaden.<br><br>

Download hier: <a href="http://developer.phone.com">http://developer.phone.com</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_upphone.png" width=253 height=601 alt="" border="0"></div>
<br></li>

<li><b>NOKIA WAP Toolkit Version 1.2</b>:<br>
Die vorliegende Version 1.2 des NOKIA WAP Toolkit ist bei der Vielzahl an bereits verf&uuml;gbaren 
WAP-Emulations Tools eine der besten L&ouml;sungen. Dieses Toolkit ist f&uuml;r MS Windows 98/NT 4/2000 
geeignet. Diese Version l&auml;uft relativ stabil (nach dem zus&auml;tzlichen download der Java Runtime 
Environment (JRE) Version 1.2.2), der WML-Browser ist zur WAP-Spezifikation 1.1 kompatibel, 
inkludiert ist auch ein WBMP Editor und bietet zudem eine umfangreiche Dokumentation im 
PDF-Format (Sie ben&ouml;tigen zum Lesen den Acrobat-Reader). Die Doku umfasst eine Beschreibung des 
Programms, Entwickler Informationen, WML Sprach-Referenz und WML Script-Referenz. Im Moment ist 
die gesamte Doku wie das Programm selbst, nur in Englisch verf&uuml;gbar.<br>

Bei der Installation kann es eventuell zu kleinen Problemen kommen im Ordner Programme wird der 
Ordner "Nokia WAP Toolkit" angelegt das ist der Grund weshalb das Programm nicht funktioniert! 
Sie m&uuml;ssen den Ordnernamen auf "NokiaWAPToolkit" &auml;ndern.<br>

Die IDE bietet Tag-Highlighting und einen stabilen und schnellen XML-Parser. Da jedoch die beim 
Programmieren sehr n&uuml;tzliche Zeilennummerierung und Tag-Completion (d.h. der Tab wird w&auml;hrend 
der aktiven Eingabe, in einer Bubble-Help vollst&auml;ndig angezeigt) und ein integrierter 
Objektkatalog fehlt ist dieses Programm nur bedingt f&uuml;r WML-Neulinge geeignet.<br>

Tip: Damit Sie bei WML-Codierungsfehler nicht gleich frustriert aufgeben, sollten Sie unter dem 
Men&uuml;punkt Toolkit | Preferences | Encoding die Option "Use Fast Encoding" deaktivieren. Bei 
Codeierungsfehlern wird ihnen nun eine genauere Fehlerbeschreibung angezeigt und nun auch die 
Zeilennummer samt Spalte angezeigt.<br>

Wenn es jetzt noch im Codefenster Zeilennummern g&auml;be, w&auml;re das Debuggen ein Kinderspiel.<br>

Sehr praktisch ist auch, dass aufgrund des integrierten WAP-Gateways Sie Ihre WML-Seiten auch 
offline (also ohne Provider bzw. Netzanbieter oder WAP-Server) betrachten. Diese M&ouml;glichkeit 
gibt es nat&uuml;rlich nur f&uuml;r die Nokia Modelle 6110 und 6150.<br>
Der Funktionsumfang des WBMP-Editors ist eher bescheiden, aber vorhanden.<br><br>

Fazit: Alles in allem ein gelungenes Programm, das nur wenige W&uuml;nsche (f&uuml;r 
Nokia-Mobiltelefonbesitzer) offen l&auml;sst, zumal es ja kostenlos ist. Die Zeilennummerierung und
Tag-Completion werden hoffentlich in der n&auml;chsten Hauptversion nachgereicht.</li>


<li><b>NOKIA WAP Toolkit Version 1.3 Beta</b>:<br>
Der Unterschied zur Version 1.2 liegt haupts&auml;chlich darin da&szlig; Sie jetzt auch das Nokia 7110 
ben&uuml;tzen k&ouml;nnen.<br>
Die Ben&uuml;tzung ist aber darauf beschr&auml;nkt, da&szlig; Sie f&uuml;r das 7110 eine WAP Gateway ben&ouml;tigen (im 
Gegensatz zu den inkludierten Modellen 6110 bzw. 6150). Die Verbindungsparameter k&ouml;nnen Sie im 
Einstellungsmen&uuml; ohne Probleme einrichten. Zus&auml;tzlich im Unfang der Dokumentation ist ein 
Setup-Guide und ein Style-Guide f&uuml;r das Nokia 7110 enthalten.<br>
Das Toolkit beinhaltet WML-Parser und WAP-Emulator mit IDE (Integrierte Entwickler Umgebung), 
alles was Sie tun m&uuml;ssen ist sich einer Registrierung  zu unterziehen der Download ist gratis.
Der WML-Browser ist zu  WAP 1.1 kompatibel, emuliert Nokia 6110, Nokia 6150,
Nokia 7110.<br><br>

Fazit: Abgesehen davon, dass ein neues Mobiltelefon unterst&uuml;tzt wird, sind die Ver&auml;nderungen 
kaum bemerkbar.<br><br>

Download hier:
<a href="http://www.forum.nokia.com/main/1,6668,1_1,00.html">http://www.forum.nokia.com/main/1,6668,1_1,00.html</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_nokiatool.png" width=640 height=458 alt="" border="0"></div>
<br></li>		

<li><b>Ericsson WAP IDE SDK 2.1</b>:<br>
Die neueste Version der Entwicklungssoftware der Firma 
<a href="http://www.ericsson.de">Ericsson</a> erlaubt es Ihnen wirklich professionelle 
WML-Seiten zu gestalten. Diese Sammlung von Tools umfa&szlig;t unter anderem die 3 Hauptkomponenten 
einen Browser, den Application Designer und das Server Toolset. Der WML-Browser ist hier 
genauso wie in allen anderen SDKs als Mobiltelefon dargestellt.<br>
Das WapIDE SDK 2.1 unterst&uuml;tzt WML1.1 und WML Script1.1 laut Spezifikation des Wapforums. Der 
Application Designer ist das erste Tool das Programmzeilen freiwillig anzeigt.<br>
Wie bei den meisten Programmen empfiehlt es sich auch hier die Readme Dateien zu lesen die vom 
Hersteller bereitgestellt werden, denn bei der Installation des SDK's m&uuml;ssen Sie eine bestimmte 
Reihenfolge einhalten:<br>
* Sie k&ouml;nnen das WapIDE SDK 2.1 erst nach dem WapIDE_3PP_2_0. installieren.<br>
* Der User Guide (sowie alle anderen PDF's die Sie downloaden k&ouml;nnen ) sollte unbedingt 
genauestens gelesen werden, denn hier finden Sie die genaue Anleitung wie Sie diese Toolkit 
installieren und verwenden k&ouml;nnen, zudem finden Sie dort auch eine Einf&uuml;hrung in die WapIDE und 
wie man diese gebraucht.<br>
* Die Installationspakete sind f&uuml;r Win32 Plattformen wie Windows 95, 98, NT, 2000.<br><br>

Download hier: <a href="http://www.ericsson.com/developerszone/">http://www.ericsson.com/developerszone/</a><br><br>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000615_ericssonappdesigner.png" width=561 height=500 alt="" border="0"></div>
<br></li>

</ul>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Ich pers&ouml;nlich gebe unter den Editoren dem Waptor meinen Vorzug. Ich habe dieses Programm 
aus dem Grund als letzten der Editoren angef&uuml;hrt da ich der Meinung bin er sollte sich als 
letzter in Ihr Ged&auml;chtnis pr&auml;gen. Sie werden damit sicher eine Freude haben. Wenn Sie tiefer in 
die WML-Programmierung einsteigen wollen, ist es sicher kein Fehler sich einmal die SDK's der 
Firmen Nokia, Ericsson und Phone.com n&auml;her anzusehen - es wird Ihnen ohnehin nicht erspart 
bleiben.
</p>
<p>
Es wird Ihnen sicher aufgefallen sein da&szlig; ich &uuml;ber das Nokia Toolkit am meisten geschrieben 
habe. Das sollte keine Werbung sein (ich bekomme kein Geld daf&uuml;r).  Ich entwickle darauf und 
habe es nicht nur getestet, da fallen einem dann schon ein paar Dinge auf.
</p>
<p>
Da es eine Unzahl von Waptools gibt, ist es mir nicht m&ouml;glich alle zu testen und &uuml;ber sie zu 
schreiben. Sollten Sie der Meinung sein, da&szlig; Ihr Produkt (oder eines das Sie benutzen) in diesem 
Artikel beschrieben sein sollte dann schreiben Sie mir doch ein mail und ich werde es mir 
anschauen.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20000609.htm">Erste Schritte mit WML (Wireless Markup Language)</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000609.htm</span><br>
<a href="../artikel/20000614.htm">Erste Schritte mit WML 2: Chic - Kosmetik in WML</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000614.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Egixom%2Ede%2Fwap23%2Ehtm">Gixom - WAP Catalog (deutsch)</a><br>
<SPAN class="content">http://www.gixom.de/wap23.htm</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fgraphicssoft%2Eabout%2Ecom%2Fcompute%2Fgraphicssoft%2Fmsubimgconv%2Ehtm">Image File Format Converters (engl.)</a><br>
<SPAN class="content">http://graphicssoft.about.com/compute/graphicssoft/msubimgconv.htm</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epalopt%2Ecom%2Eau%2Fwap%2Fdevtools%2Ehtml">PPT WAP Development Tools (engl.)</a><br>
<SPAN class="content">http://www.palopt.com.au/wap/devtools.html</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ewapmine%2Ecom%2FProducts%2Easp">WAP produkte bei Wapmine.com</a><br>
<SPAN class="content">http://www.wapmine.com/Products.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fitec%2Eerg%2Ecuhk%2Eedu%2Ehk%2Fref%2Fwap%2F">WAP Referenz (englisch)</a><br>
<SPAN class="content">http://itec.erg.cuhk.edu.hk/ref/wap/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwebcab%2Ede%2Fwrg%2FTool%2F">WAP Resources Guide (englisch)</a><br>
<SPAN class="content">http://webcab.de/wrg/Tool/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fpwot%2Eco%2Euk%2Fwml%2F">WAP Tools (englisch)</a><br>
<SPAN class="content">http://pwot.co.uk/wml/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ewaplink%2Enl%2Fhome%2Easp">WAPlink.nl (englisch)</a><br>
<SPAN class="content">http://www.waplink.nl/home.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ewapsearch%2Ech%2Fsofthard%2Findex%2Ehtml">Wapsoftware bei der WAP Suchmaschine Wapsearch.ch</a><br>
<SPAN class="content">http://www.wapsearch.ch/softhard/index.html</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ewapulous%2Ecom%2F">Wapulous.com - The WAP Developers Repository</a><br>
<SPAN class="content">http://www.wapulous.com/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwebsecrets%2Eorg%2FTop%2FComputers%2FMobile%5FComputing%2FWireless%5FData%2FWAP%2FSoftware%2FWBMP%5Futilities%2Findex%2Ehtm">WBMP Utilities (englisch)</a><br>
<SPAN class="content">http://websecrets.org/Top/Computers/Mobile_Computing/Wireless_Data/WAP/Software/WBMP_utilities/index.htm</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ewap%2Dforum%2Ein%2Dx%2Ede%2Fprg%5Fgrph%2Ehtm">WBMP-Converter (deutsch)</a><br>
<SPAN class="content">http://www.wap-forum.in-x.de/prg_grph.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
