<HTML>
<HEAD>
<TITLE>Mit PGP verschl&uuml;sselte e-Mails senden</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Dieser Artikel erklärt wie man mit Hilfe von ASP PGP (Pretty Good Privacy) verschlüsselte e-Mails versendet.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,ASP, PGP, Pretty Good Privacy, email, E-Mail, e-Mail, verschlüsseln, Public Key, Key, Private Key">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Mit PGP verschl&uuml;sselte e-Mails senden</H1>
<p>
Geschrieben von: <a href="../autoren/christiankoller.htm">Christian Koller</a><br>
Kategorie: <a href="../kategorien/ASP%20Tricks.htm">ASP Tricks</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000912"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>Um von ASP aus eine PGP (Pretty Good Privacy) verschl&uuml;sselte e-Mail versenden zu k&ouml;nnen,
ben&ouml;tigen Sie auf Ihrem Webserver 2 Dinge:</p>

<p><ul>
<li>Eine e-Mail Komponente, die mit PGP zusammenarbeitet</li>
<li>Die PGP Software, die f&uuml;r die Verschl&uuml;sselung sorgt</li>
</ul></p>

<p>Kenner der computergest&uuml;tzten Kryptographie wissen, was PGP ist und wie man damit arbeitet.
Nichtsdestotrotz gebe ich hier einen kleinen Einf&uuml;hrungskurs:</p>

<p>PGP steht f&uuml;r Pretty Good Privacy, was auf Deutsch soviel wie &quot;ziemlich gute Geheimhaltung&quot; hei&szlig;t.
Worauf baut nun PGP auf, und wie benutzt man es?</p>

<p>PGP ist prim&auml;r eine Software, die Verschl&uuml;sselung auf Basis des &quot;public Key&quot;
Prinzips erlaubt. Ohne auf den dahinterstehenden Algorithmus, der auf der Multiplikation
sehr gro&szlig;er Primzahlen basiert eingehen zu wollen, gibt es f&uuml;r eine 
Verschl&uuml;sselung mittels PGP immer 2 &quot;Keys&quot; oder Schl&uuml;ssel.</p>

<p>Sie generieren mit der PGP Software ein Schl&uuml;sselpaar,
wobei sie den &quot;&ouml;ffentlichen Schl&uuml;ssel&quot; &uuml;ber allgemein
zug&auml;ngliche PGP Server jedermann zur Verf&uuml;gung stellen k&ouml;nnen.
Den &quot;privaten Schl&uuml;ssel&quot; halten Sie geheim.</p>

<p>Jeder der Ihnen verschl&uuml;sselte Daten (oder e-Mails) senden will, benutzt
nun Ihren &quot;&ouml;ffentlichen Schl&uuml;ssel&quot; um die Daten zu verschl&uuml;sseln.
Diese verschl&uuml;sselten Daten lassen sich nun nur mehr mit Hilfe der PGP
Software und dem &quot;privaten Schl&uuml;ssel&quot; (oder der Rechenleisung vom Pentagon
oder der NSA) wieder entschl&uuml;sseln.</p>

<p>Eine gute FAQ (Frequently Asked Questions) in deutscher Sprache zum Thema PGP
gibt es auf der Website von PGPi.com unter der Adresse 
<a href=http://www.pgpi.org/doc/faq/pgpi/de/>http://www.pgpi.org/doc/faq/pgpi/de/</a>.</p>

<p>Noch ein rechtlicher Hinweis (mu&szlig; leider sein): Wenn Sie PGP oder die internationale Version PGPi
f&uuml;r gewerbliche Zwecke nutzen wollen, so müssen Sie eine kommerzielle Userlizenz von 
Network Associates Inc. oder seinen bevollmächtigten Vertretern erwerben. 
Wenn Sie in den den USA oder Kanada leben so gehen Sie zu 
<a href=http://www.nai.com/>http://www.nai.com/</a>. 
Leben Sie au&szlig;erhalb der USA oder Kanada, so gehen Sie zu
<a href=http://www.pgpinternational.com/>http://www.pgpinternational.com/</a> um sich zu informieren.</p>

<p>Genug der Theorie, nun zur Verwendung von PGP auf einem Webserver.</p>

<h2>Installation von PGP auf einem Webserver</h2>

<p>Zu Testzwecken k&ouml;nnen Sie die Freeware PGPi Version f&uuml;r Windows NT/2000 
unter der Adresse <a href=http://www.pgpi.org/products/pgp/versions/freeware/>http://www.pgpi.org/products/pgp/versions/freeware/</a>
downloaden.</p>

<p>Installieren Sie die Software auf dem Webserver 
(auf eigene Gefahr, nur da&szlig; nachher niemand sagt, ich bin verantwortlich wenn
wieder etwas nicht funktioniert). Schlie&szlig;en Sie dazu alle Anwendungen auf dem Webserver
(vor allem Mailprogramme) und f&uuml;hren Sie die <i>Setup.exe</i> Datei aus. Vorher sollten
Sie das downgeloadete ZIP File aber noch entzippen, mit <a href="http://www.winzip.de/">WinZip</a> 
zum Beispiel. Sie m&uuml;ssen nur das PGP Key Management installieren.
</p>

<p>Nachdem das PGPi Setup erfolgreich ausgef&uuml;hrt wurde, finden Sie die neue
Programm Gruppe <i>PGP</i> im Start Men&uuml; vor.</p>

<p><IMG SRC="/artikel/Bilder/200009/20000912_PGP.png" width=422 height=86 alt="" border="0"><br>
<i>Bild 1: PGP Programm Gruppe</i></p>

<p>Um ein neues Schl&uuml;sselpaar zu generieren, starten Sie das Programm <i>PGPkeys</i>
aus der PGP Programm Gruppe. Geben Sie im Key Generation Wizard Ihren Namen und Ihre e-Mail Adresse
ein. W&auml;hlen Sie im n&auml;chsten Fenster &quot;<i>Diffie-Hellman/DSS</i>&quot;, benutzen Sie eine
Schl&uuml;ssell&auml;nge von 2048 bits, w&auml;hlen Sie &quot;Key pair never expires&quot; (Schl&uuml;sselpaar
wird niemals ung&uuml;ltig). Im nachfolgenden Fenster m&uuml;ssen Sie nun die 
&quot;Verschl&uuml;sselungsphrase&quot; (Passphrase) eingeben, mit der Sie Zugang zu Ihrem privaten
Schl&uuml;ssel erlangen.</p>

<p><IMG SRC="/artikel/Bilder/200009/20000912_KGWizard.png" width=510 height=385 alt="" border="0">
<br>
<i>Bild 2: Fenster der Key Generation Wizard</i></p>

<p>Benutzen Sie zur Demonstration die Passphrase &quot;<i>Dies ist nur ein Test!</i>&quot; (ohne Anf&uuml;hrungszeichen).
Danach generiert Ihnen der Key Generation Wizard Ihr PGP Schl&uuml;sselpaar. 
Da dies nur eine Demo ist, m&uuml;ssen Sie den Schl&uuml;ssel nicht zum &quot;Rootserver&quot; schicken.
Der Rootserver dient zur Verwaltung aller &ouml;ffentlichen PGP Schl&uuml;ssel, die
man allgemein zug&auml;nglich gemacht hat.</p>

<p>Nachdem der Wizard beendet ist &ouml;ffnet sich das PGP Keys Fenster (siehe Bild 3).</p>

<p><IMG SRC="/artikel/Bilder/200009/20000912_PGPKeys.png" width=520 height=300 alt="" border="0">
<br>
<i>Bild 3: PGPKeys</i></p>

<p>Sie k&ouml;nnen das PGP Keys Fenster jederzeit wieder &uuml;ber das Programm
PGPKeys in der Programmgruppe PGP &ouml;ffnen.</p>

<p>Nachdem Sie nun Ihr ganz pers&ouml;nliches Schl&uuml;sselpaar generiert (und sich die 
Verschl&uuml;sselungsphrase gut gemerkt, aber nicht mittels Zettel zum Bildschirm geh&auml;ngt haben),
k&ouml;nnen wir nun daran gehen, die Schl&uuml;ssel zum Verschl&uuml;sseln unserer Mails zu benutzen.</p>



<h2>PGP-Verschl&uuml;sselung mittels e-Mail Komponente unter ASP</h2>

<p>Ich habe hier als e-Mail Komponente zur Benutzung unter ASP die 
<a href="http://tech.dimac.net/">w3 JMail Komponente</a> der Firma 
<a href="http://www.dimac.net/">Dimac</a> nicht ohne Grund gew&auml;hlt.
Sie bietet nicht nur die Funktionalit&auml;t um e-Mails sowohl zu senden als auch
von jedem beliebigen POP3 Account auszulesen, sie unterst&uuml;tzt auch PGP!</p>

<p>Die <a href="http://tech.dimac.net/">w3 JMail Komponente</a> ist in der Personal Version
gratis als Download verf&uuml;gbar. Die hier vorgestellte Verschl&uuml;sselungsfunktionalit&auml;t
ist aber nur in der Professional Version enthalten, die mit USD 49,- aber auch f&uuml;r jede
Firma leistbar ist.</p>

<h3>Installation der JMail Professional 4.0 Mail Komponente</h3>

<p>F&uuml;r die Installation der JMail Komponente auf dem Webserver m&uuml;ssen Sie
nur das Setup Programm ausf&uuml;hren. W&auml;hrend des Setups sollten Sie sich f&uuml;r
die "Custom Installation" entscheiden, denn nur so k&ouml;nnen Sie auch die 
JMail Dokumentation als PDF Dokument installieren (siehe Bild 4).</p>


<p><IMG SRC="/artikel/Bilder/200009/20000912_Custom.png" width=504 height=379 alt="" border="0">
<br>
<i>Bild 4: Installation von JMail</i></p>

<p>Nachdem die Komponente auf dem Server installiert ist, m&uuml;&szlig;en Sie
noch f&uuml;r den IUSR_<i>ComputerName</i> Account (unter dem ASP Dateien ausgef&uuml;hrt werden)
des Webservers die Lese- und Schreibrechte f&uuml;r die PGP-relevanten Verzeichnisse
und Dateien setzen. Ausserdem m&uuml;&szlig;en Sie noch Installationsdateien, 
die auf die Verzeichnisse der PGP-Schl&uuml;ssel verweisen, f&uuml;r 
den IUSR_<i>ComputerName</i> Account zug&auml;nglich machen (Diese Prozeduren
sind auch in der JMail Dokumentation <i>w3jmail4.pdf</i> nachzulesen, die standardm&auml;&szlig;ig 
im Verzeichnis C:\Program Files\Dimac\w3JMail4 installiert ist).</p>


<h3>Setzen der Schreib-/Leserechte f&uuml;r den IUSR_Machine Account</h3>

<p>Kopieren Sie zuerst auf einem Windows 2000 Server die Dateien aus dem Verzeichnis
<i>C:\Documents and Settings\Administrator\Application Data\PGP\</i> ins Verzeichnis
<i>C:\Documents and Settings\Default User\Application Data\PGP</i>.
Wenn Sie unter Windows NT 4.0 arbeiten, so kopieren Sie die Dateien aus dem Verzeichnis
<i>C:\Winnt\Profiles\Administrator\Application Data\PGP\</i> ins Verzeichnis 
<i>C:\Winnt\Profiles\Administrator\Default User\Application Data\PGP\</i>.</p>

<p>Danach sollten Sie f&uuml;r folgende Verzeichnisse und alle darin liegenden Dateien
und Verzeichnisse Schreib- und Leserechte (Read-, Write-Permission) 
f&uuml;r alle Benutzer (<i>Everyone</i>) und den 
IUSR_<i>MachineName</i> Account einrichten:</p>

<p><ul>
	<li>Installationsverzeichnis der PGP Software (<i>C:\Program&nbsp;Files\Network&nbsp;Associates\PGPNT\</i>)</li>
	<li>PGP Verzeichnis f&uuml;r den Administrator Account 
	(<i>C:\Documents&nbsp;and&nbsp;Settings\Administrator\Application&nbsp;Data\PGP</i>)</li>
	<li>PGP Verzeichnis f&uuml;r alle Benutzer (Default User) unter 
	<i>C:\Documents&nbsp;and&nbsp;Settings\Default&nbsp;User\Application Data\PGP</i>
	</li>
</ul></p>


<h3>Einsatz von JMail mit PGP unter ASP</h3>

<p>Um also ins kalte Wasser zu tauchen, hier gleich ein ASP Beispiel, wie man
von einer ASP Seite aus eine PGP verschl&uuml;sselte e-Mail generiert und verschickt.
Die Erkl&auml;rung des Skripts finden Sie im Anschlu&szlig; an den Sourcecode.</p>

<p><pre style="background='silver';">
&lt;% @LANGUAGE="VBScript" %&gt;
&lt;HTML&gt;
&lt;BODY&gt;
&lt;%
' Message Objekt generieren
Set msg = Server.CreateObject( "JMail.Message" )

' Nachrichten Eigenschaften festlegen
msg.From = "redaktion@aspheute.com"     ' Absender
msg.Subject = "Nur fuer Ihre Augen"     ' Betreff
msg.Body = "Streng geheime Nachricht!"  ' Nachricht

' Weitere Parameter um die Fehlerbehandlung zu erleichtern
msg.Logging = True
' msg.Silent = True  ' Komponente faengt intern Fehler ab

' PGP Verschluesselung aktivieren fuer Nachricht
msg.PGPEncrypt = True

' Empfaenger fuer die Nachricht angeben,
' dritter Parameter enthaelt den die PGP-Key ID 
' oder die Email Adresse des PGP-Keys
msg.AddRecipient "redaktion@aspheute.com", "Redaktion", "redaktion@aspheute.com"

If Not msg.Send("mail.domain.com") Then
    Response.write "&lt;pre&gt;" &amp; msg.log &amp; "&lt;/pre&gt;"
Else
    Response.write "Nachricht wurde erfolgreich verschluesselt und versendet!"
End if
%&gt;
&lt;/BODY&gt;
&lt;/HTML&gt;
</pre></p>

<p>Das <i>Message</i> Objekt der w3 JMail Komponente wird mittles <i>CreateObject</i> erstellt.
Das <i>Message</i> Objekt stellt eine e-Mail Nachricht dar, die an verschiedene Empf&auml;nger 
verschickt wird.</p>

<p><pre style="background='silver';">
Set msg = Server.CreateObject(&quot;JMail.Message&quot;)
</pre></p>

<p>Ganz gew&ouml;hnliche e-Mail Daten, wie Absender, Betreff oder Nachricht werden 
mittels <i>From</i>, <i>Subject</i> und <i>Body</i> Eigenschaften gesetzt:</p>

<p><pre style="background='silver';">
msg.From = &quot;redaktion@aspheute.com&quot;
msg.Subject = &quot;Nur fuer Ihre Augen&quot;
msg.Body = &quot;Streng geheime Nachricht!&quot;
</pre></p>

<p>Um anzugeben, da&szlig; die Nachricht mittels PGP verschl&uuml;sselt werden soll,
mu&szlig; man die <i>PGPEncrypt</i> Eigenschaft des <i>Message</i> Objektes auf <i>True</i> setzen:</p>

<p><pre style="background='silver';">
msg.PGPEncrypt = true
</pre></p>

<p>Der oder die Empf&auml;nger werden dabei mittels <i>AddRecipient</i> Methode zur Nachricht
(dem <i>Message</i> Objekt) hinzugef&uuml;gt. Die <i>AddRecipient</i> Methode hat 3 Parameter:</p>

<p><pre style="background='silver';">
msg.AddRecipient <i>emailAdresse</i>, <i>Empf&auml;ngername</i>, <i>PGPSchl&uuml;ssel</i>
</pre></p>

<p>Der PGPSchl&uuml;ssel Parameter ist dabei eine Zeichenkette, die entweder 
die hexadezimale Schl&uuml;ssel-ID des PGP-Schl&uuml;ssels oder
die zugeordnete Emailadresse des Schl&uuml;ssels enth&auml;lt. Der "&ouml;ffentliche Schl&uuml;ssel"
wird dann verwendet um die Email zu verschl&uuml;sseln bevor sie an den Empf&auml;nger verschickt 
wird.</p>

<p>Um im PGP Keys Programm die Schl&uuml;ssel ID (Key ID) f&uuml;r die Schl&uuml;ssel
anzeigen zu lassen, w&auml;hlen Sie im Men&uuml; <i>View, KeyID</i>. Die Key ID f&uuml;r 
<i>Christian Koller</i> in meinem generierten Schl&uuml;ssel ist zum Beispiel 
<i>0x90EB3CA5</i> (siehe Bild 5).</p>

<p><IMG SRC="/artikel/Bilder/200009/20000912_KeyCK.png" width=576 height=300 alt="" border="0">
<br>
<i>Bild 5: Schl&uuml;ssel ID f&uuml;r Christian Koller (Redaktion@AspHeute.com).</i></p>


<p>Wenn Sie nun die <i>Send</i> Methode des <i>Message</i> Objektes ausf&uuml;hren, 
benutzt die w3 JMail Komponente die PGP-Keys, die am Webserver installiert sind,
um die abgehenden Nachrichten zu verschl&uuml;sseln.</p>

<p>Die <i>Send</i> Methode hat als Eingangsparameter die Domain des Mailservers,
&uuml;ber den die e-Mail geschickt werden soll.<p>

</p>Zur Erinnerung: Um abgehende Nachrichten zu verschl&uuml;sseln ben&ouml;tigen Sie nur 
den sogenannten &quot;Public Key&quot;, also den &ouml;ffentlichen Schl&uuml;ssel des 
Empf&auml;ngers. Dieser mu&szlig; vom Empf&auml;nger erstellt und Ihnen &uuml;bermittelt werden.</p>


<h2>Schlu&szlig;bemerkung</h2>

<p>Um e-Mails verschl&uuml;sselt und damit halbwegs sicher zum Empf&auml;nger zu schicken, 
ist eine Verwendung von PGP zusammen mit einer PGP-f&auml;higen e-Mail Komponente
m&ouml;glich. Die in diesem Artikel vorgestellte w3 JMail Komponente enth&auml;lt bereits eine
eingebaute PGP Funktionalit&auml;t zu einem leistbaren Preis.</p>

<p>Um nun eine &uuml;berschaubare Menge von e-Mails verschl&uuml;sselt zu versenden,
so ist eine kombinierte ASP-PGP L&ouml;sung vor allem f&uuml;r kleine und mittlere
Firmen interessant.</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20000912.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20000912.zip</span></p>
<h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20021028.htm">ACT MetaMailer - Mails verschicken leicht gemacht</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20021028.htm</span><br>
<a href="../artikel/20000602.htm">Allgemeine MailParser-Klasse mit ASPMail</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000602.htm</span><br>
<a href="../artikel/20000810.htm">Auslesen von Emails aus einem POP3 Account</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000810.htm</span><br>
<a href="../artikel/20000330.htm">Downloads per Email verschicken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000330.htm</span><br>
<a href="../artikel/19990809.htm">Email versenden mit AspMail</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/19990809.htm</span><br>
<a href="../artikel/20000515.htm">Emails senden mit CDONTS</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000515.htm</span><br>
<a href="../artikel/20010625.htm">Html Emails mit Dundas Mailer verschicken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010625.htm</span><br>
<a href="../artikel/20000920.htm">PGP-Verschl&uuml;sselung bei Dateien</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000920.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epgpi%2Eorg%2Fdoc%2Ffaq%2Fpgpi%2Fde%2F">FAQ zu PGP</a><br>
<SPAN class="content">http://www.pgpi.org/doc/faq/pgpi/de/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epgpinternational%2Ecom">PGP Security</a><br>
<SPAN class="content">http://www.pgpinternational.com</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epgpi%2Eorg">The International PGP Home Page</a><br>
<SPAN class="content">http://www.pgpi.org</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epgp%2Ecom">US PGP Website</a><br>
<SPAN class="content">http://www.pgp.com</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Ftech%2Edimac%2Enet">w3 JMail Komponente</a><br>
<SPAN class="content">http://tech.dimac.net</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
