<HTML>
<HEAD>
<TITLE>Installation der neuesten ADO Version (ADO 2.5)</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Mit Windows 2000 wird MDAC als fixer Teil des Betriebssystem ausgeliefert, aber auch unter alten Plaftformen kann man MDAC 2.5 installieren - dieser Artikel zeigt, worauf man aufpassen mu&szlig;.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,MDAC,ADO,Installation,Windows 95,Windows 98, Windows NT 4,NTW,NTS,SDK">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Installation der neuesten ADO Version (ADO 2.5)</H1>
<p>
Geschrieben von: <a href="../autoren/christiankoller.htm">Christian Koller</a><br>
Kategorie: <a href="../kategorien/Datenbank.htm">Datenbank</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000328"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Mit dem Erscheinen von Windows 2000 wurde MDAC 2.5 (Microsoft Data Access Components), und damit auch 
ADO 2.5 ein Bestandteil des Betriebssystems. Wenn sie also ein Windows 2000 Betriebssystem haben, dann 
ist ADO 2.5 schon automatisch installiert. Um unter Windows 2000 die jeweils neueste ADO Version zu 
installieren, sind sie auf Service Packs f&uuml;r das Betriebssystem angewiesen, da ein Installieren von 
ADO (oder MDAC) allein unter Windows 2000 nicht m&ouml;glich ist.
</p>
<p>
Um die neueste ADO Version unter &auml;lteren Windows Betriebssystemen (Windows 95/98, Windows NT 4.0) zu 
installieren, laden sie das Setup Program f&uuml;r die neueste MDAC Version (MDAC 2.5 RTM) von der Microsoft 
Web Site unter <a href="http://www.microsoft.com/data/" target="_new">http://www.microsoft.com/data/</a>.
</p>
<p>
Da alle Komponenten von MDAC 2.5 als Teil des Betriebssystems (Windows 2000) gedacht sind, wird eine 
brauchbare ADO Dokumentation weder mit Windows 2000 noch mit dem MDAC Setup Program mitgeliefert. 
Stattdessen ben&ouml;tigt man das Microsoft Platform SDK (Software Development Kit) um die vollst&auml;ndige 
Micorosoft Dokumentation zu MDAC, ADO und verwandten Komponenten zu erhalten.
</p>

<h2>Installation des Platform SDK</h2>
<p>
Das Platform SDK kann von der Microsoft Website unter 
<a href="http://msdn.microsoft.com/developer/sdk/platform.asp" target="_new">http://msdn.microsoft.com/developer/sdk/platform.asp</a> geladen werden.
Achten sie darauf, da&szlig; Microsoft Internet Explorer 4.01 (mit Service Pack 2) oder eine neuere Version auf 
dem Betriebssystem installiert ist, bevor sie das Platform SDK Setup Programm laufen lassen.
F&uuml;r den Fall, dass sie das Platform SDK unter Windows 95 oder Windows 98 installieren ben&ouml;tigen sie 
m&ouml;glicherweise zus&auml;tzlich den Windows Installer 1.1 (oder neuer).
</p>
<p>
Wenn sie das Platform SDK Setup Programm starten, k&ouml;nnen sie &uuml;ber <i>Custom Install</i> ausw&auml;hlen, welche Teile 
des Platform SDK's sie installieren m&ouml;chten.
</p>

<h2>Allgemeines zur Installation von ADO 2.5</h2>
<p>
Da seit MDAC 2.5 ADO nicht mehr separat installiert werden kann, installieren sie MDAC 2.5 um das darin 
enthaltene ADO 2.5 mit zu installieren.
</p>
<p>
Die Setup Prozedur f&uuml;r das neueste MDAC ist wie folgt:
</p>
<p>
F&uuml;r Windows 95, Windows 98 und Windows NT 4.0 k&ouml;nnen sie das neueste MDAC Setup Programm (mdac_typ.exe oder 
mdacg_typ.exe) von der Microsoft Website unter der Adresse <a href="http://www.microsoft.com/data/" target="_new">http://www.microsoft.com/data/</a>. laden
</p>
<p>
Beachten sie, da&szlig; MDAC 2.5 (und neuer) nur mehr f&uuml;r x86-kompatible Computer erh&auml;ltlich ist. F&uuml;r Alpha 
Maschinen ben&uuml;tzen sie bitte MDAC 2.1 (SP2).
</p>
<p>
Unter Windows 2000 ist MDAC 2.5 ein integraler Bestandteil des Betriebssystems. Da Windows 2000 das 
Windows File Protection (WFP) System benutzt um alle Betriebssystemdateien vor dem L&ouml;schen oder 
&Uuml;berschreiben zu sch&uuml;tzen, kann eine neue MDAC Version nicht einfach installiert werden wie auf den 
alten Windows Betriebssystemen. Anstatt das MDAC Setup Programm zu verwenden, m&uuml;ssen sie das neueste 
Service Pack f&uuml;r Windows 2000 installieren.
</p>

<h2>MDAC Setup Programm</h2>
<p>
Gehen sie die folgende Checkliste durch um das MDAC Setup Prgramm (mdac_typ.exe oder mdacg_typ.exe) 
erfolgreich laufen zu lassen.
<ol>
<li>Laden sie die neueste MDAC Version aus dem Internet. Die Adresse f&uuml;r das MDAC Setup Programm 
	lautet <a href="http://www.microsoft.com/data/" target="_new">http://www.microsoft.com/data/</a>
<li>Wenn sie MDAC unter Windows 95 installieren m&ouml;chten, dann vergewissern sie sich, da&szlig; DCOM95 auf dem 
	Computer verf&uuml;gbar ist. Wenn sie DCOM95 nicht haben so laden sie es von der Microsoft Website unter 
	der Adresse <a href="http://www.microsoft.com/com/resources/downloads.asp" target="_new">http://www.microsoft.com/com/resources/downloads.asp</a> herunter und installieren sie es.
<li>Unter Windows 98 is DCOM98 f&uuml;r gew&ouml;hnlich installiert. Falls sie DCOM98 ben&ouml;tigen, sie finden es unter 
	derselben Internet Adresse wie DCOM95.
<li>Um MDAC 2.5 benutzen zu k&ouml;nnen ben&ouml;tigen sie mindestens Internet Explorer 4.01 (SP 2) oder neuer. 
	Andernfalls k&ouml;nnen Teile des MDAC nicht benutzt werden da sie auf Resourcen des Internet Explorer 
	zugreifen.
<li>Bevor sie das MDAC Setup Programm (mdac_typ.exe) laufen lassen, beenden sie alle Windows Applikationen 
	und Windows NT Services die MDAC benutzen k&ouml;nnten. F&uuml;r optimale Resultate beenden sie alle 
	Applikationen und Programme, speziell Entwicklungstools und Server Applikationen.
<li>Wenn sie MDAC auf einer Windows NT 4.0 Maschine installieren, so loggen sie sich zuvor als 
	Administrator ein.
<li>Beenden sie alle Anti-Virus, Harddisk Mangement Programme und speicherresistente Applikationen die
	noch auf dem Computer laufen.
<li>Die MDAC Installation ben&ouml;tigt mindestens 50 MB freien Festplattenspeicher. Pr&uuml;fen sie daher den 
	verf&uuml;gbaren Festplattenspeicher. Beachten sie, da&szlig; MDAC seine Dateien sowohl in den "Programme" Ordner 
	als auch in den System Ordner (Windows\System unter Windows 9x, oder WinNT\System32 unter Windows NT) 
	kopiert.
<li>Stellen sie sicher, dass der TEMP Ordner eingerichtet und das zugeh&ouml;rige Laufwerk mindestens 50 MB 
	Speicher frei hat. Sie k&ouml;nnen mittles des SET Kommandos (in einem DOS oder Command Prompt ausgef&uuml;hrt) 
	die sogenannten Umgebungsvariablen des Betriebssystems ausgeben lassen, wobei der ausgegebene Wert 
	der Variablen TEMP= und TMP= den Pfad des TEMP Ordners angeben.
<li>Wenn sie das MDAC Setup Programm unter Windows 95 ausf&uuml;hren wollen, so muss sich das Setup Programm 
	auf dem Computer oder einem eingemappten Laufwerk befinden.
<li>F&uuml;r den Fall, dass sie MDAC auf einem Windows NT 4.0 Terminal Server installieren wollen, m&uuml;ssen 
	sie eine spezielle Vorgehensweise beachten. Weitere Informationen sind im Microsoft Knowledge Base 
	Artikel mir der Nummer <a href="http://support.microsoft.com/support/kb/articles/Q216/1/49.asp" target="_new">Q216149</a> enthalten.
<li>Starten sie das MDAC Setup Programm mdac_typ.exe auf dem Rechner. Sollte eine Nachricht erscheinen, 
	da&szlig; DCOM95 oder DCOM98 ben&ouml;tigt wird, so installieren sie zuerst DCOM 95 (dcom95.exe) oder
	DCOM98 (dcom98.exe) und starten danach das MDAC Setup Programm erneut.
<li>F&uuml;r den Fall, da&szlig; sie MDAC 2.5 (oder neuer) auf einem Computer installieren, der auf eine SQL Server 
	6.5 Datenbank zugreift, haben sie noch folgendes zu beachten. Bei einem veraltertem Satz von Catalog 
	Stored Procedures auf dem SQL Server wird bei einem Zugriff unter MDAC 2.5 eine Warnung ausgegeben. 
	Neben dieser Warnung kann es unter MDAC 2.5 zu ernsthaften Problemen kommen, wie zum Beispiel dem 
	Verlust von Information &uuml;ber den Aufbau einer Tabelle. Um dieses Problem zu l&ouml;sen m&uuml;ssen sie die 
	SQL Scripts der Datei names <i>instcat.sql</i> auf dem SQL Server laufen lassen. Die instcat.sql 
	Datei ist im MDAC 2.5 enthalten. Genausogut k&ouml;nnen sie auch das Service Pack 5 (oder neuer) f&uuml;r 
	SQL Server 6.5 auf dem Datenbank Server installieren, wobei die neuen Catalog Stored Procedures 
	automatisch angelegt werden.
</ol>
</p>
<p>
Wenn sie eine &auml;ltere MDAC Version &uuml;ber eine neuere spielen m&ouml;chten, so m&uuml;ssen sie zuerst das installierte 
MDAC vom Computer entfernen. Da MDAC ohne De-Installationsroutine ausgeliefert wird, m&uuml;ssen sie zum 
De-Installierern auf das Component Checker Tool zur&uuml;ckgreifen, welches sie von der Microsoft Site 
unter <a href="http://www.microsoft.com/Data/download.htm" target="_new">http://www.microsoft.com/Data/download.htm</a> herunterladen k&ouml;nnen.
</p>
<p>
Durch die Installation einer neuen MDAC Version auf ihrem Computer werden alle ADO Komponenten, OLE DB 
Provider und ODBC Treiber von Microsoft Produkten auf einen einheitlichen neuen Stand gebracht. Um OLE DB 
Provider und ODBC Treiber anderer Hersteller upzudaten, m&uuml;ssen sie diese nach der Installation von MDAC 
gesondert installieren.
</p>
<p>
Das MDAC Setup Programm ist geeignet um es gemeinsam mit einer eigenen Applikation zu vertreiben. So 
bereiten sie einen Kundencomputer optimal f&uuml;r eine Datenbank Applikation vor. Beachten sie bitte, da&szlig; 
MDAC nur auf Betriebssystemen installiert werden darf, wenn das Betriebssystem g&uuml;ltig lizensiert ist 
(siehe zum Beispiel MDAC 2.5 End-User License Agreement, kurz EULA).
</p>
<p>
MDAC Setup Programme (mdac_typ.exe) zum Weitervertrieb k&ouml;nnen von der Microsoft Internet Site 
unter <a href="http://www.microsoft.com/data/" target="_new">http://www.microsoft.com/data/</a> heruntergeladen werden. Um MDAC 2.0 (oder neuer) 
auf Windows 95 (oder Windows 98) zu installieren ben&ouml;tigt das Betriebssystem das DCOM95 
(oder DCOM98) Update, welches sie auch bei Microsoft auf der Website zum Download finden.
</p>

<h2>&Uuml;berpr&uuml;fen der MDAC Installation</h2>
<p>
Das Beste, was sie zur &Uuml;berpr&uuml;fung einer MDAC Installation tun k&ouml;nnen, ist eine Datenbank Applikation laufen 
zu lassen, die ADO und andere MDAC Komponenten benutzt.
</p>
<p>
Auch eine Analyse des Systems mit dem Component Checker Tool stellt weitgehend sicher, da&szlig; MDAC und ADO 
korrekt installiert sind.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20000518.htm">ADO Konstanten und die Datei Adovbs.inc</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000518.htm</span><br>
<a href="../artikel/20000327.htm">ADO und MDAC Versionen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000327.htm</span><br>
<a href="../artikel/20001107.htm">Einf&uuml;gen eines Datensatzes mit dem INSERT Statement</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001107.htm</span><br>
<a href="../artikel/20000627.htm">Einf&uuml;hrung in Data Shaping mit ADO</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000627.htm</span><br>
<a href="../artikel/20000516.htm">Einsatz des Recordset Objektes als Multifunktionaler Datenspeicher</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000516.htm</span><br>
<a href="../artikel/20010511.htm">Tabellenexistenz in Datenbanken &uuml;berpr&uuml;fen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010511.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emicrosoft%2Ecom%2Fcom%2Fresources%2Fdownloads%2Easp">DCOM95</a><br>
<SPAN class="content">http://www.microsoft.com/com/resources/downloads.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fsupport%2Emicrosoft%2Ecom%2Fsupport%2Fkb%2Farticles%2FQ216%2F1%2F49%2Easp">How to Install ODBC or MDAC on Terminal Server</a><br>
<SPAN class="content">http://support.microsoft.com/support/kb/articles/Q216/1/49.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emicrosoft%2Ecom%2Fdata%2F">Microsoft Universal Data Access</a><br>
<SPAN class="content">http://www.microsoft.com/data/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fmsdn%2Emicrosoft%2Ecom%2Fdeveloper%2Fsdk%2Fplatform%2Easp">Platform SDK</a><br>
<SPAN class="content">http://msdn.microsoft.com/developer/sdk/platform.asp</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
