<HTML>
<HEAD>
<TITLE>Die SA Excel Writer Komponente</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Dieser Artikel soll als Teaser die Software Artisans ExcelWriter Komponente dienen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Excel,Komponete,ASP,ExcelWriter,SA ExcelWriter">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Die SA Excel Writer Komponente</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/ASP%20Tricks.htm">ASP Tricks</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20001204"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Mit der <a href="http://www.softartisans.com/">Software Artisans</a> ExcelWriter Komponente
k&ouml;nnen Sie Microsoft Excel kompatible Spreadsheets erstellen. Dabei mu&szlig; am 
Webserver Excel nicht installiert sein. Dieser Artikel soll als Teaser dienen, d.h. der Artikel
beinhaltet eine Kurzbeschreibung der Features der Komponente. Zus&auml;tzlich beinhaltet er die Installation der kostenlosen 
Demoversion der Komponente auf einem Webserver, damit Sie leichter entscheiden k&ouml;nnen, ob sie 
Ihren Anspr&uuml;chen gen&uuml;gt.
</p>

<h2>Features</h2>

<p>
Sie k&ouml;nnen mit der Komponente Microsoft Excel kompatible Spreadsheets (Tabellen) erstellen. Das von der Komponente
erzeugte Excel <i>BIFF7 Format</i> kann von allen Excel Versionen ab Version 7.0, also MS Excel 95,
MS Excel 97 und MS Excel 2000 gelesen werden. Die Komponete unterst&uuml;tzt auch den Zugriff auf Datenbanken,
die Verwendung bzw. Berechnung von Formeln (z.B. Summe, ...) sowie die Anwendungen von Formatierungen.
</p>

<h2>Verf&uuml;gbare Editionen</h2>

<p>
Die Software Artisans ExcelWriter Komponente wird in drei Editionen angeboten, die sich nach Funktionsumfang 
und Preis unterscheiden:

<p>
<ul>
<li>ExcelWriter
<li>ExcelWriter LE
<li>ExcelWriter Free
</ul>
</p>

<p>
Die <i>ExcelWriter Edition</i> ist f&uuml;r Enterprise (Gro&szlig;unternehmen) Level Websites gedacht, und bietet daher
auch die meisten Funktionen.
</p>

<p>
Die <i>ExcelWriter LE</i> Edition ist hingegen auf geringere Anspr&uuml;che und einfache 
Bedienung ausgelegt.
</p>

<p>
Die <i>ExcelWriter Free Edition</i> - welche kostenlos downloadbar ist - soll nur als Evaluierungsversion
dienen, und enth&auml;lt gerade genug Funktionen um Sie testen zu k&ouml;nnen.
</p>

<h2>Lizensierung</h2>
<p>
Die Komponente hat prinzipiell zwei Lizenzmodelle: <i>Server</i> bzw. <i>Developer</i>.
Wie der Name schon sagt, ist die <i>Server</i> Lizenz "pro Server" auf dem die Komponente installiert
werden soll.
</p>

<p>
Wenn Sie die Komponente z.B. auf einer Workstation installieren wollen, m&uuml;ssen eine <i>Developer</i> Lizenz
erwerben. Die Developer Lizenz besitzt den gleichen Funktionsumfang wie die Server Lizenz, jedoch mit der
Einschr&auml;nkung auf die gleichzeitige Erstellung von nur <i>einem</i> Spreadsheet.
</p>

<h2>Systemvoraussetzungen</h2>

<h3>Server</h3>

<p>
Als Server-Betriebssystem wird im Moment nur Microsoft Windows NT oder Windows 2000 unterst&uuml;tzt. Zus&auml;tzlich
mu&szlig; bei <i>Windows NT</i> der Internet Information Server Version 4 (inkludiert im NT Option Pack) bzw.
bei <i>Windows 2000</i> die Internet Information Services Version 5 installiert sein. Microsoft Excel wird
am Server nicht ben&ouml;tigt.
</p>

<p>
Um den Datenbankzugriff zu erm&ouml;glichen m&uuml;ssen  mindestens die Microsoft Data Access Components  (MDAC)
ab Version 2 installiert sein.
</p>

<h3>Client</h3>

<p>
Am Client mu&szlig; Mircosoft Excel ab Version 7.0 (95) oder eine MS Excel kompatible Tabellenkalkulation 
installiert sein. F&uuml;r einfache Tabellen gen&uuml;gt auch der kostenlos zum Download verf&uuml;gbare 
<i>Excel Viewer</i>. <i>Einfach</i> bedeutet, da&szlig; die Tabelle keine Formeln enth&auml;lt, da der Excel Viewer diese 
nicht berechnet.
</p>

<h3>Webbrowser</h3>

<p>
Es werden der Microsoft Internet Explorer ab Version 4 und der Netscape Navigator bzw. Communicator ab 
Version 4.5 unterst&uuml;tzt.
</p>

<h2>Einschr&auml;nkungen der Komponente</h2>

<p>
In der vorliegenden Version 1.0 sind folgende Funktionen noch nicht implementiert, sollen 
aber in den n&auml;chsten Versionen verf&uuml;gbar sein. ExcelWriter hat noch keine Methode um existierende Excel Dateien 
zu lesen. Sie k&ouml;nnen sich aber durch den Excel ODBC Treiber oder Excel selbst Abhilfe schaffen.
</p>

<p>
Die Komponente kann keine Diagramme generieren. Ebenso ist es nicht m&ouml;glich Makros, benuzerdefinierte Dialoge
oder Pivot Tabellen zu erstellen.
</p>

<h2>Installation</h2>

<p>
Die Installation erfolgt durch den <i>Windows Installer</i> und ist damit einfach und selbst erkl&auml;rend. Es
Werden dabei die ben&ouml;tigen Programmdateien kopiert, die Komponete wird registriert und am Webserver wird
ein virtuelles Verzeichnis erstellt, das die Dokumentation und die Tutorial-Beispiele enth&auml;lt.
Wie bei jeder Installation auf Windows NT oder Windows 2000 m&uuml;ssen Sie die Privilegen (z. B. Administrator, etc.)
besitzten um die Installation durchf&uuml;hren zu k&ouml;nnen. 
</p>

<h2>Konfiguration des IIS</h2>

<p>
Das Spreadsheet wird dem Client direkt &uuml;bermittelt ohne es vorher am Webserver abzuspeichern. Das bedeutet,
da&szlig; sich im Client-Browserfenster ein &Ouml;ffnen/Speichern Dialog &ouml;ffnet um die Datei(en) lokal beim Client abzuspeichern.
</p>

<p>
F&uuml;r den Fall, da&szlig; dies nicht erw&uuml;nscht sein sollte, m&uuml;ssen Sie den IIS konfigurieren um <i>xls</i> Dateien 
mit der <i>asp.dll</i> Datei zu assoziieren. Die nun folgenden Screenshots
zeigen die einzelnen Konfigurationsschritte.
</p>

<p>
Zun&auml;chst &ouml;ffen Sie den <i>Internet Services Manager</i> und klicken auf das virtuelle Verzeichnis
der Komponente (standardm&auml;&szlig;ig <i>excelwriter</i>). &Ouml;ffen Sie nun das Kontextmen&uuml; dieses Verzeichnisses
und klicken Sie auf Eigenschaften (Properties):
</p>

<p><IMG SRC="/artikel/Bilder/200012/20001204_iis.png" width="619" height="272" alt="" border="0"></p>

<p>
Klicken Sie, falls nicht schon offen, auf den <i>Virtual Directory</i> Tab. In der Sektion 
<i>Application Settings</i> klicken Sie auf den <i>Configuration</i> Button.
</p>

<p><IMG SRC="/artikel/Bilder/200012/20001204_virtualdir.png" width="461" height="435" alt="" border="0"></p>

<p>
Falls der <i>Configuration</i> Button inaktiv ist, m&uuml;ssen Sie auf <i>Create</i> klicken.
</p>

<p>
W&auml;hlen Sie den <i>App Mappings</i> Tab und klicken Sie auf <i>Add</i>:
</p>

<p><IMG SRC="/artikel/Bilder/200012/20001204_AppConfig.png" width="406" height="448" alt="" border="0"></p>

<p>
Abschlie&szlig;end m&uuml;ssen Sie nur noch bei <i>Executable</i> auf die <i>asp.dll</i> Datei referenzieren, die 
sich normalerweise unter dem Verzeichnispfad <i>C:\WINNT\system32\inetsrv</i> findet.
</p>

<p><IMG SRC="/artikel/Bilder/200012/20001204_XtensionMap.png" width="429" height="243" alt="" border="0"></p>

<p>
Geben Sie dann die Erweiterung <i>xls</i> bei Extension an. W&auml;hlen Sie den Radiobutton <i>All Verbs</i> an und
klicken Sie noch auf die <i>Script engine</i> Checkbox. Um Probleme zu vermeiden mu&szlig; <i>Check that file exists</i>
<b>inaktiv</b> bleiben. Schlie&szlig;lich best&auml;tigen Sie mit <i>OK</i> und schlie&szlig;en alle ge&ouml;ffneten Fenster.
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
Dies war ein Teaser und eine kleine Einrichtungshilfe f&uuml;r die SoftwareArtisans <i>ExcelWriter</i> Komponente.
Der Vorteil liegt in der einfachen Erstellung von Excel kompatiblen Spreadsheets auf Webseiten. Da auch Formeln
berechnet werden k&ouml;nnen, besitzt sie schon in der vorliegenden Version ein gro&szlig;es Anwendungspotential.
</p>

<p>
Auf die noch fehlenden wichtigen Features wie Diagrammgenerierung oder Pivot Tabellen mu&szlig; man noch warten.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010305.htm">Ein Excel-Sheet am Server generieren und zum Client schicken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010305.htm</span><br>
<a href="../artikel/20001207.htm">SA ExcelWriter in Action</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001207.htm</span><br>
<a href="../artikel/20020128.htm">Serverdaten clientseitig in Exceltemplates importieren</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020128.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fdemo%2Esoftartisans%2Ecom%2FExcelWriter%2Fdefault%2Easp">SA ExcelWriter Demoseite</a><br>
<SPAN class="content">http://demo.softartisans.com/ExcelWriter../default.htm</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Esoftartisans%2Ecom%2Fexcelwriter%2Ehtml">SA ExcelWriter Seite</a><br>
<SPAN class="content">http://www.softartisans.com/excelwriter.html</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Esoftartisans%2Ecom%2F">SoftwareArtisans</a><br>
<SPAN class="content">http://www.softartisans.com/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
