<HTML>
<HEAD>
<TITLE>Erste Schritte mit WML (Wireless Markup Language)</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Der erste Artikel zur Einführung in WML (Wireless Markup Language) bei AspHeute.com. Struktur einer WML Seite, Werkzeuge, Tools, SDKs, Browser, WML Beispiel.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,WAP, WML, Entwickler, Tools, SDK, Software Developer Kit, Nokia, WML-Seite, Card, Deck">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Erste Schritte mit WML (Wireless Markup Language)</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/WAP.htm">WAP</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000609"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>Dies ist der Beginn einer neuen Serie bei <a href="/">AspHeute.com</a>. 
Hier werden Sie Schritt f&uuml;r Schritt das Programmieren und Erstellen von WML-Sites
anhand von Beispielen kennen lernen.</p>

<ul><b>Heute lesen Sie</b>:
 <li>Die Grundstruktur von WML</li>
 <li>Werkzeuge um WML zu programmieren und zu testen</li>
 <li>Ein Beispiel einer WML Seite</li>
</ul>


<h2>Grundstruktur von WML</h2>

<p>Durch die heutzutage noch begrenzten Kapazit&auml;ten von Mobiltelefonen in Bezug auf
&Uuml;bertragungsgeschwindigkeit (9600 bps), Displaygr&ouml;&szlig;e, Speicherverm&ouml;gen etc, 
ist es n&ouml;tig die Sourcecodegr&ouml;&szlig;e von WAP-Seiten f&uuml;r Handys gering zu halten, ohne jedoch den 
Bedienungskomfort zu schm&auml;lern.</p>

<p>Aus diesen Vorgaben entwicklete sich WAP als &Uuml;bertragungsprotokoll und WML als 
Sprache f&uuml;r WAP-Seiten. &Auml;hnlich wie HTML oder XML besitzt WML zur Beschreibung einer Seite 
<i>Header</i>, <i>Tags</i> und <i>Attribute</i>. Daneben erlaubt WML auch die Einbindung von Bildern im 
WBMP-Format (Endung *.wbmp) auf einer WAP-Seite, oder das Ausf&uuml;hren von client-seitigen Skripts in 
WMLScript.</p>

<p>Eine WML Seite kann, genauso wie eine HTML-Seite, unter Verwendung von server-seitigen Skriptsprachen
dynamisch generiert werden, um zum Beispiel Ergebnisse einer Datenbankabfrage darzustellen.</p>

<p>Ein WML-Dokument besteht aus einem <i>Deck</i>, welches sich in Untergruppen, sogenannte
<i>Cards</i>, unterteilt, die &uuml;ber Links miteinander verkn&uuml;pft sind.
Das Deck kann man sich also wie einen Container vorstellen, der in mehrere F&auml;cher (sprich 
<i>Cards</i>) unterteilt ist. 
Um den Nachteil der geringen &Uuml;bertragungsgeschwindigkeit bei GSM (und anderen Funknetzen)
zu umgehen, wird das <i>Deck</i> mit all seinen <i>Cards</i> auf einmal in den internen 
Mobiltelefon-Speicher &uuml;bertragen.
Aus diesem Grund sollten f&uuml;r eine WAP-Site alle zusammengeh&ouml;rigen <i>Cards</i> in einem 
<i>Deck</i> untergebracht sein, um eine rasche Navigation zwischen den <i>Cards</i> zu 
erm&ouml;glichen.</p>

<p>W&auml;hlerisch sollten Sie auch bei der Auswahl des Inhaltes einer WAP-Site sein: 
Aufgrund der &uuml;blicherweise kompakten Displays von WAP-Handys sollten nur wichtige Informationen 
wie News-Schlagzeilen, Zusammenfassungen, Online Buchungen, <nobr>m(obile)</nobr>-Commerce ohne
&uuml;berfl&uuml;ssigen Ballast zum User geschickt und angezeigt werden.</p>


<h2>Was ben&ouml;tigt man um WML zu programmieren und zu testen</h2>

<p>Sie k&ouml;nnen WML-Dokumente (Dateiendung *.wml) schlicht mit einem Text-Editor erstellen.
Komfortabler ist die Erstellung von WML-Seiten jedoch mit SDKs (Software Development Kit) f&uuml;r WAP,
wie sie von diversen Anbietern (z.B. Nokia, Ericsson) oft gratis im Internet zum Download zur 
Verf&uuml;gung gestellt werden.</p>

<p>Die Vorteile im Gebrauch von SDKs, oder anderer Entwicklertools f&uuml;r WAP und WML-Seiten,
liegt darin, da&szlig; die Entwicklungsumgebung Features wie Listnumbers, Tag Coloring und meist auch ein 
Tag-Glossar besitzt und Sie das fertige Dokument unter Verwendung eines integrierten WAP-Emulators 
gleich kompilieren und ansehen k&ouml;nnen.</p>

<p>Um dann Ihre Site der &Ouml;ffentlichkeit zu pr&auml;sentieren, m&uuml;ssen Sie noch 
die WML Seiten auf einen, &uuml;ber ein WAP-Gateway zug&auml;nglichen und f&uuml;r WAP
konfigurierten, Webserver legen.</p>

<p>Wenn Sie einen Internet Information Server (IIS) f&uuml;r WAP konfigurieren m&ouml;chten,
so lesen Sie bitte unseren Artikel <a href="../artikel/20000607.htm">IIS Konfiguration f&uuml;r WAP</a>. 
Dieser enth&auml;lt alle n&ouml;tigen Anweisungen um die f&uuml;r WAP ben&ouml;tigten MIME-Types 
einzurichten.</p>


<h2>Grafiken in WML</h2>

<p>Um den Text einer WML-Site mit Bildern (z.B. Firmen-Logos) aufzuwerten k&ouml;nnen Sie auf
diverse Grafik-Programme zur&uuml;ckgreifen, wenn sie das "WAP-Bitmap" (Dateiendung *.wbmp) Format 
unterst&uuml;tzen. Bedenken Sie beim Einsatz von Bildern unter WAP, da&szlig; die Displaygr&ouml;&szlig;e 
von Mobiltelefonen variiert und meist sehr begrenzt ist (Nokia 7110: 48x78 Pixel). 
Die Grafikaufl&ouml;sung ist in den allermeisten F&auml;llen ebenfalls gering.
Als Bilder kommen nur schwarz-wei&szlig; Bitmaps in Frage, da nur die wenigsten WAP-Mobiltelefone 
&uuml;ber ein farbtaugliches Displays verf&uuml;gen.</p>


<h2>Programmierung von WML</h2>

<p>Obwohl die Programmierung von WML &auml;hnlich der von XML ist (WML ist ein XML-Schema!),
ben&ouml;tigen Sie keine XML Vorkenntnisse. 
Wie jede Programmiersprache, so hat auch WML gewisse Konventionen.</p>

<ul><b>Konventionen in WML</b>:
  <li>Keine Unterst&uuml;tzung von Umlauten. Gegebenenfalls sind Umlaute zu maskieren 
  (<i>&Auml;</i> wird <i>&amp;Auml;</i>), oder W&ouml;rter zu umschreiben (aus "<i>&auml;</i>" wird "<i>ae</i>").</li>
  <li>WML-Tags sind klein zu schreiben z.B. <i>&lt;p&gt; ... &lt;/p&gt;</i></li>
  <li>WML-Tags sind immer zu schlie&szlig;en z.B. <i>&lt;table&gt; ... &lt;/table&gt;</i>. Bei Tags 
    ohne abschlie&szlig;enden Tag wird der Schr&auml;gstrich in den ersten Tag mit einbezogen z.B.
    eine Leerzeile <i>&lt;p/&gt;</i>.</li>
  <li>Da WML-Editoren oft nicht auf Fehler im WML hinweisen, sollten Sie Ihren Sourcecode
    mit einen Emulator (Browser) testen und genau pr&uuml;fen.</li>
</ul>


<h2>"Hello World" - Beispiel</h2>

<p>Dieses einfache Programmierbeispiel soll Ihnen als Einstieg in WML dienen.
Die Screenshots stammen vom Nokia WAP Toolkit Version 1.2, das f&uuml;r registrierte Mitglieder 
des <a href="http://www.forum.nokia.com/main.html">Forum Nokia</a> gratis
zu downloaden ist. (Siehe auch 
<a href="http://www.nokia.de/systemloesungen/wap/entwicklung/index.html">Nokia Deutschland</a>)
Die Benutzung eines SDKs oder Toolkits f&uuml;r WAP ist keineswegs notwendig, f&uuml;r eine erfolgreiche
WML-Site Entwicklung aber sicherlich vorteilhaft.</p>


<pre style="background='silver';">
&nbsp;1: &lt;?xml version="1.0"?&gt; 
&nbsp;2: &lt;!DOCTYPE wml PUBLIC "-//WAPFORUM//DTD WML 1.1//EN" _
&nbsp;3: "http://www.wapforum.org/DTD/wml_1.1.xml"&gt; 
&nbsp;4: 
&nbsp;5: &lt;wml&gt; 
&nbsp;6: 
&nbsp;7:   &lt;card id="card1" title="ASPHeute.com"&gt; 
&nbsp;8:     &lt;p&gt; 
&nbsp;9:       &lt;!-- 1. WML Beispiel --&gt; 
10:       Hallo Welt!!! 
11:     &lt;/p&gt; 
12:   &lt;/card&gt; 
13: 
14: &lt;/wml&gt;</pre>

<p><b>Ergebnis am Phone-Display:</b></p>

<div align="center"><IMG SRC="/artikel/Bilder/200006/20000609_1.png" width=141 height=141 border=0></div>

<p>Besprechen wir nun die einzelnen WML Zeilen:</p>

<p><b>Zeile 1</b>:  Der <i>XML</i> Tag sollte immer in der ersten Zeile stehen. 
Dieser Tag definiert die Kompatibilit&auml;t zu XML-kodierten Dateien und macht es m&ouml;glich,
WML Seiten auch als XML zu interpretieren.</p>

<p><b>Zeile 2 und Zeile 3</b>: Der Dokumententyp steht zwingend nach der XML-Definition der 1. Zeile.
Er legt fest, um welche WML Version es sich handelt. Die nachfolgende Adresse ist der 
Resourcenursprung.</p>

<p><b>Zeile 5</b>: <i>&lt;wml&gt;</i> Bezeichnet den Beginn des WML-Sourcecodes.</p>

<p><b>Zeile 7</b>: <i>&lt;card&gt;</i> &ouml;ffnet den Tag f&uuml;r ein <i>Card</i>, das Attribut 
<i>id="card1"</i> dient zur Bezeichnung der einzelnen <i>Card</i> innerhalb eines <i>Decks</i>. 
Jeder <i>Card</i> wird eine eindeutige ID zugeordnet, die den Zugriff auf die <i>Card</i> erm&ouml;glicht.
Das Attribut <i>title="ASPHeute.com"</i> im <i>&lt;card&gt;</i> Tag gibt dem Benutzer 
Informationen &uuml;ber die betrachtete WAP-Site (Titel der Site).</p>

<p><b>Zeile 8 bzw. Zeile 11</b>: Der Text innerhalb von <i>&lt;p&gt; ... &lt;/p&gt;</i> ist
als Absatz organisiert. Jede <i>Card</i> ben&ouml;tigt mindestens einen Absatz.</p>

<p><b>Zeile 9</b>: Der <i>&lt;!-- ... --&gt;</i> Tag erm&ouml;glicht Kommentare in WML-Seiten.
Sie sollten w&auml;hrend der Entwicklung Ihren Sourcecode dokumentieren, damit die Seite 
&uuml;bersichtlicher und einfacher zu debuggen ist. In der fertigen WML-Seite sollten Sie jedoch auf 
Kommentare verzichten, um die Seite, und daher auch ihre Ladezeit am Handy, so klein wie m&ouml;glich zu 
halten.</p>

<p><b>Zeile 12</b>: Der Tag <i>&lt;/p&gt;</i> schlie&szlig;t den Tag <i>&lt;p&gt;</i> aus Zeile 7.</p>
    
<p><b>Zeile 14</b>: <i>&lt;/wml&gt;</i> beendet den WML-Sourcecode.</p>


<h2>Schlu&szlig;bemerkung</h2>

<p>Dies war eine &auml;u&szlig;erst knappe Einf&uuml;hrung in die Grundlagen und M&ouml;glichkeiten von 
WML. Der Artikel sollte Ihnen einen &Uuml;berblick vermitteln und den Einstieg in die 
Seitenbeschreibungssprache WML so einfach wie m&ouml;glich machen.</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20000605.htm">Eine kurze Einf&uuml;hrung in die Technologie von WAP</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000605.htm</span><br>
<a href="../artikel/20000616.htm">Erste Schritte mit WML 3: Navigation und Links</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000616.htm</span><br>
<a href="../artikel/20000607.htm">IIS Konfiguration f&uuml;r WAP</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000607.htm</span><br>
<a href="../artikel/20000615.htm">Tools zur WML Programmierung</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000615.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Eforum%2Enokia%2Ecom">Entwickler Forum Nokia</a><br>
<SPAN class="content">http://www.forum.nokia.com</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
