<HTML>
<HEAD>
<TITLE>Was ist neu in ASP.NET</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Willkommen zu einem Kurzbericht von der High-Tech Front - was gibt es Neues in ASP.NET? In diesem Artikel erfahren Sie in komprimierter Form, was Sie von ASP.NET erwarten k&ouml;nnen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,ASP.NET,VB.NET,.NET,Microsoft .NET,Microsoft .NET Framework,SOAP,XML,C#,Visual Studio.NET">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Was ist neu in ASP.NET</H1>
<p>
Geschrieben von: <a href="../autoren/christophwille.htm">Christoph Wille</a><br>
Kategorie: <a href="../kategorien/ASPdotNET.htm">ASP.NET</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000712"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Willkommen zu einem Kurzbericht von der High-Tech Front - was gibt es Neues in ASP.NET? In diesem Artikel erfahren
Sie in komprimierter Form, was Sie von ASP.NET erwarten k&ouml;nnen. Details zu den einzelnen angesprochenen Technologien
werden in sp&auml;teren Artikeln nachgereicht.
</p>
<p>
<b>Wichtig</b> ASP.NET wird als Teil des <i>Microsoft .NET Framework SDK</i> installiert (wenn ein IIS auf der Maschine installiert ist, dann 
kann man es auch testen). Das .NET Framework SDK enth&auml;lt ein ASP.NET Quickstart Tutorial, und die Hilfe ist Teil des SDK.
</p>
<p>
Um es gleich vorweg zu sagen - Active Server Pages .NET (ASP.NET) ist mehr als nur ein einfaches Upgrade zu ASP 3.0,
wie wir es von Windows 2000 kennen. ASP.NET hat sich zu einer Entwicklungsplattform f&uuml;r wirklich ernsthafte
Enterprise Anwendungen gemausert.
</p>
<p>
Obwohl ASP.NET abw&auml;rtskompatibel zu ASP ist (nicht 100%, um gleich vorzuwarnen), kommt ASP.NET mit einem v&ouml;llig neuen
Programmiermodell und einer eigenen Runtime - der Common Language Runtime. Diese enth&auml;lt
Compiler (!) f&uuml;r Visual Basic, JScript, C++ und C# (spricht sich "C Sharp" aus). C# wurde speziell f&uuml;r die 
Enterprise Programmierer entwickelt, und ist <b>die</b> Programmiersprache f&uuml;r ASP.NET.
</p>
<p>
Im letzten Absatz kommt auch mehr oder minder versteckt das Wort Compiler vor - ja, ab sofort werden ASP Seiten nicht mehr
interpretiert, sondern kompiliert und danach im Maschinensprache abgearbeitet. Willkommen im Land der "echten"
Programmierer!
</p>
<p>
Die Entwicklung von ASP.NET Anwendungen wird vollst&auml;ndig durch die visuelle Entwicklungsumgebung von Visual Studio 7
unterst&uuml;tzt. Man kann zwar immer noch mit Notepad entwickeln, dies d&uuml;rfte sich jedoch auf ein Minimum reduzieren,
da die Unterst&uuml;tzung durch VS.NET sehr weitreichend ist.
</p>
<p>
Doch jetzt zu den Features im Detail:
<ul>
	<li>Web Forms
	<li>Web Services
	<li>Personal Tier
	<li>ADO.NET
</ul>
</p>

<h2>Web Forms</h2>
<p>
Der Name ist Programm - Web Forms erlauben es, extrem leistungsf&auml;hige Formular-basierte Internetanwendungen
zu erstellen. Im Gegensatz zu den HTML Controls wie wir sie aus ASP kennen, gibt es jetzt Server Controls,
die einem sehr viel Arbeit (=Verk&uuml;rzung der Entwicklungszeit) abnehmen.
</p>
<p>
Web Forms werden kompiliert - aus jeder aspx Datei (so hei&szlig;t die neue Dateiendung) wird ein Objekt erstellt,
das in kompilierter Form die Anforderungen abarbeitet - im Namen der aspx Datei. Bei diesem Modell wird das 
HTML in den Objektcode eingebaut, und nicht wie in ASP der ausgef&uuml;hrte Sourcecode in den HTML Code. Die
Geschwindigkeit und Skalierbarkeit, die dadurch erreicht wird, ist wirklich beeindruckend.
</p>
<p>
Auf Web Forms kann man <b>Server Controls</b> einbauen, die sich selbst entsprechend den F&auml;higkeiten des Clients als HTML rendern.
Dazu geh&ouml;ren einfache Controls wie Textboxen oder Schaltfl&auml;chen, aber auch komplexe Templates oder Kalender
sind im Standardumfang enthalten.
</p>
<p>
Die Server Controls stellen Ihre Funktionalit&auml;t im Code als Objekte zur Verf&uuml;gung - das hei&szlig;t, nie
wieder <i>Request.Form("Username")</i>, sondern <i>Username.Value</i>. Und auch die ganze Feldvalidierung
(G&uuml;ltigkeitspr&uuml;fung) wird von ASP.NET &uuml;bernommen - je nach Browserf&auml;higkeit am Client, oder direkt am Server. Und
man mu&szlig; keine Zeile Code schreiben; ein einfaches Tag &uuml;bernimmt die Aufgabe.
</p>
<p>
Eine Art der "Komponentisierung" von Webseiten wird unterst&uuml;tzt - <b>User Controls</b>. Dadurch kann man ASP.NET Seiten in
andere ASP.NET Seiten als Komponente importieren. Damit kann man oft ben&ouml;tigte User Interface Funktionalit&auml;t
f&uuml;r Seiten mehrfach zur Verf&uuml;gung stellen.
</p>
<p>
Zu guter Letzt m&ouml;chte ich noch kurz auf das <b>Code Behind</b> Feature von ASP.NET eingehen. Es erlaubt, Code und
Pr&auml;sentation zu trennen - eine Datei h&auml;lt den ASP.NET Code, die zweite Datei ist nur HTML. Damit k&ouml;nnen Designer
und Programmierer gleichzeitig an ASP.NET Seiten arbeiten, ohne sich gegenseitig den Code zu zerst&ouml;ren. Visual
Studio.NET verwendet automatisch Code Behind.
</p>

<h2>Web Services</h2>
<p>
Einige haben sicher schon von <b>SOAP</b> (Simple Object Access Protocol) geh&ouml;rt - und hier in den ASP.NET Web Services
werden Sie es wiederfinden. SOAP ist das Protokoll, das von den ASP.NET Web Services verwendet wird, um Daten zwischen
Client und Server auszutauschen.
<p>
Die Web Services erlauben es, bestimmte Funktionalit&auml;t &uuml;ber das Internet zur Verf&uuml;gung
zu stellen, so zum Beispiel das Abfragen von Wertpapierkursen. Nat&uuml;rlich ist das nur ein Beispiel, das Limit
ist nur die Vorstellungskraft (Wetteranfragen, News, ...).
</p>
<p>
Mit den Web Services kann man Business Logic dem Client zur Verf&uuml;gung stellen. 
Der Vorteil ist, da&szlig; das verwendete SOAP Protokoll auf XML aufsetzt, und &uuml;ber HTTP
transferiert wird - und somit Firewalls &uuml;berbr&uuml;cken kann. Gerade dieser Punkt war das gr&ouml;&szlig;te Problem von DCOM
oder anderen Remote-Object-Invocation Protokollen.
</p>
<p>
Und wer jetzt meint, das sei nicht sicher: man kann SSL verwenden, die &uuml;blichen Methoden der Benutzervalidierung 
anwenden, als auch Client Certificates voraussetzen. Einfache, effektive, und vor allem erprobte Methoden.
</p>

<h2>Host anywhere</h2>
<p>
ASP.NET ist nicht mehr an den IIS gebunden, man kann ASP.NET auch in seiner eigenen Anwendung hosten. Dadurch
werden interessante Benutzerinterfaces m&ouml;glich, von denen man bis dato nur tr&auml;umen durfte. Um dieses Feature
allerdings verwenden zu k&ouml;nnen, mu&szlig; man auf low-level Interfaces (COM) zugreifen.
</p>

<h2>ADO.NET</h2>
<p>
Das ist nicht unbedingt ein "Teil" von ASP.NET, aber wir als ASP.NET Programmierer werden sicher sehr oft mit dem
neuen ADO.NET in Ber&uuml;hrung stehen. Grunds&auml;tzlich ist ADO.NET eine evolution&auml;re Weiterentwicklung von ADO, die aber
sehr viele &Auml;nderungen mit sich bringt.
</p>
<p>
Zentraler Dreh- und Angelpunkt von ASP.NET ist das <b>Data Set</b>. Es ist In-Memory Kopie der Datenbankdaten (wer
erinnert sich noch an die IMDB [In Memory DataBase], die im letzten Moment aus Windows 2000 gestrichen wurde?).
Es kann vielf&auml;ltige Daten enthalten, so zum Beispiel mehrere Tabellen. Das Data Set kann ohne aktive Verbindung
zur Datenbank existieren, und unter ASP.NET, sogar in dessen Cache abgelegt werden.
</p>
<p>
Um im Detail auf ADO.NET einzugehen fehlt hier der Platz - aber sp&auml;tere Artikel werden "Licht ins Dunkel" bringen.
</p>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Dies war ein kurzer &Uuml;berblick &uuml;ber die Neuerungen, die ASP.NET uns ASP Programmierern bringen wird. Obwohl sich ASP.NET
gerade erst in den Anf&auml;ngen befindet, sollte man sich die Zeit nehmen, diese Technologie aktiv mitzuverfolgen - die
M&ouml;glichkeiten sind einfach faszinierend!
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20000713.htm">A Brief History of C#</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000713.htm</span><br>
<a href="../artikel/20001102.htm">Datenbankzugriff mittels ADO.NET</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001102.htm</span><br>
<a href="../artikel/20000808.htm">Einf&uuml;hrung in ASP.NET Web Forms</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000808.htm</span><br>
<a href="../artikel/20020117.htm">Last but not least - .NET 1.0 ist da!</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020117.htm</span><br>
<a href="../artikel/20000728.htm">On-the-fly Generierung von Graphiken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000728.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Easp%2Enet">ASP.NET Homepage</a><br>
<SPAN class="content">http://www.asp.net</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Edotnetgerman%2Ecom%2Flisten%2FaspDEdotnet%2Easp">Die aspDEdotnet Diskussionsliste</a><br>
<SPAN class="content">http://www.dotnetgerman.com/listen/aspDEdotnet.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emicrosoft%2Ecom%2Fnet%2Fdefault%2Easp">Microsoft .NET</a><br>
<SPAN class="content">http://www.microsoft.com/net../default.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
