<HTML>
<HEAD>
<TITLE>Bannerwerbung mit ASP</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Viele Websites verwenden rotierende Werbung auf ihren Seiten. Warum nicht auch Ihre Site? - Mit der Ad Rotator Komponente, welche in ASP implementiert ist, bietet sich eine einfache und schnelle M&ouml;glichkeit an, dies zu realisieren.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Ad Rotator,Banner,Werbung,Werbebanner,Komponente,Schedule,URL">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Bannerwerbung mit ASP</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20000711"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Viele Websites verwenden rotierende Werbung auf ihren Seiten. Warum nicht auch Ihre Site? - Mit der 
Ad Rotator Komponente, welche in ASP implementiert ist, bietet sich eine einfache und schnelle 
M&ouml;glichkeit an, dies zu realisieren! Aufgrund dessen, da&szlig; die Komponente standardm&auml;&szlig;ig bei ASP 
dabei ist, stellt Ihr Web Hosting Provider diese Komponente bereits zur Verf&uuml;gung und Sie m&uuml;ssen 
Ihre Site nur wenigen &Auml;nderungen unterziehen - ein minimaler Aufwand der sich lohnen kann!
</p>

<h2>Die Ad Rotator Komponente</h2>
<p>
Die Ad Rotator Komponente automatisiert den Wechsel (Rotation) zwischen den einzelnen Werbungen 
einer vordefinierten Gruppe von Werbungen  auf einer Seite oder mehreren Seiten. Die Komponente 
wechselt jedesmal die einzelnen Werbungen, wenn die Seite neu ge&ouml;ffnet oder neu geladen wird. Welche 
Werbung wann und wie oft angezeigt wird, bestimmen Sie selbst durch die Rotator Schedule Datei.
</p>
<p>
Diese ASP-Komponete verwendet folgende Dateien:
<ul>
<li><b>Rotator Schedule Datei</b> Eine Textdatei, welche die Anzeigeh&auml;ufigkeit und die 
	Werbeinformationen, wie  z.B die Pfade, Bilder und URLs der einzelnen 
	Werbungen enth&auml;lt.
<li><b>Redirection Datei</b> Diese Datei ist optional; Sie erm&ouml;glicht es, die Anzahl der Besucher 
	und den Erfolg jeder einzelnen Werbung zu erfassen. Durch diese Datei erfolgen die Eintr&auml;ge in 
	Ihrer Server-Log Datei.
</ul>
</p>
<p>
Bevor wir nun zur Anwendung (=dem Beispiel) kommen, m&ouml;chte ich zuerst noch auf die Methoden
und Eigenschaften kurz eingehen. Die Ad Rotator Komponente hat folgende Eigenschaften:
<ul>
<li><b>Border</b> Gibt die Dicke des Rahmens an, welcher die Werbung umgeben soll
<li><b>Clickable</b> Definiert, ob der Werbebanner klickbar sein soll
<li><b>TargetFrame</b> Definiert den Frame, in welchem die Werbung ge&ouml;ffnet bzw. angezeigt 
	werden soll
</ul>
</p>
<p>
Dazu kommt eine Methode: <b>GetAdvertisement</b>. Diese holt die Spezifikationen (z.B. Werbebild, 
Hyperlink) f&uuml;r die als n&auml;chstes geplante Werbung aus der Rotation Schedule-Datei (siehe oben) und 
formatiert sie als HTML.
</p>

<h2>Verwendung der Ad Rotator Komponente</h2>
<p>
Dieses einfache Beispiel gliedert sich in folgende Abschnitte: 
<ul>
<li>Einbindung der Komponente in die Hauptseite
<li>Erstellen der Rotator Schedule Datei
<li>Die Redirection Datei
</ul>
</p>
<p>
Das Hinzuf&uuml;gen der Komponente zu Ihrer aktuellen Website oder in einer neuen ist nicht weiter schwierig. 
Neben dem Einf&uuml;gen der Codezeile, welche die Instanz des Ad Rotator Objekts erstellt, m&uuml;ssen Sie 
nur mit Hilfe eines ASP-Statements die Rotator Schedule Datei einlesen.
</p>

<h3>Einbindung der Komponente in die Hauptseite</h3>
<p>
Hier ein einfaches Beispiel f&uuml;r eine Standard-Seite mit der Ad Rotator Komponente:
<pre style="background='silver';">
 1: &lt;% @Language = VBScript  %&gt;
 2: &lt;HTML&gt;
 3: &lt;HEAD&gt;
 4: &lt;TITLE&gt;Webseite mit Werbe Banner &lt;/TITLE&gt;
 5: &lt;/HEAD&gt;
 6: &lt;BODY&gt;
 7: 
 8: &lt;%
 9: dim adrot
10: Set adrot = Server.CreateObject("MSWC.AdRotator")
11: adrot.Border = 3
12: adrot.Clickable = True 
13: adrot.TargetFrame = "_new"
14: Response.Write(adrot.GetAdvertisement("adrotfile.txt"))
15: %&gt;
16: &lt;/BODY&gt;
17: &lt;/HTML&gt;
</pre>
</p>
<p>
Zeile 10: Erstellen der Instanz des Ad Rotators Objekts. Da diese Zeile die Komponete 
initialisiert ist sie zwingend erforderlich
</p>
<p>
Zeilen 11 bis 13 definieren die Eigenschaften und das Verhalten des Ad Rotators Objekts (siehe 
oben). Wenn Sie diese Eigenschaften setzen m&ouml;chten, werden die Standardeinstellungen ignoriert.
</p>
<p>
Zeile 14: Diese Zeile ist ebenfalls wie Zeile 10 erforderlich. Sie holt &uuml;ber ein ASP-Statement 
die Spezifikationen (z. B. Anzeigeh&auml;ufigkeit etc.) aus der Rotator Schedule Datei.
</p>

<h3>Erstellen der Rotator Schedule Datei</h3>
<p>
Wie schon erw&auml;hnt, beinhaltet diese Datei alle wichtigen Informationen &uuml;ber die Werbungen.
Der erste Teil der Datei enth&auml;lt die Grundeigenschaften der Werbungen, wie die Redirect URL (welche 
zum Aktivit&auml;t loggen ben&ouml;tigt wird)  oder die Abmessungen der Werbebilder in Pixel. 
</p>
<p>
Im zweiten Teil stehen dann die einzelnen Detailinformationen der Werbungen, wie die URL der Werbung, Anzeigeh&auml;ufigkeit, usw. Die Trennung der beiden Abschnitte erfolgt durch einen Asterisk (*).
</p>
<p>
Grundstruktur der Rotator Schedule Datei:
<pre style="background='silver';">
&lt;!--1.Teil --&gt;
[REDIRECT URL]
[WIDTH  WerbebildBreite]
[HEIGHT WerbebildH&ouml;he]
[BORDER Rahmendicke]
*
&lt;!--2.Teil; f&uuml;r jede Werbung wiederholen--&gt;
AdURL
AdHomePageURL
AltText
Impressions
</pre>
</p>
<p>
Die Argumente im 1. Teil sind optional. Der Asterisk (*) der die beiden Teile trennt mu&szlig; jedoch 
immer vorhanden sein auch wenn der 1. Teil fehlt. Achtung: die Kommentare habe ich in dieses
Listing nur zur Orientierung eingef&uuml;gt - in Ihren Rotator Schedule Dateien d&uuml;rfen Sie keine 
Kommentare einbauen.
</p>
<p>
Im 2. Teil werden die einzelnen werbespezifischen Informationen eingetragen. Falls Sie eine 
Information nicht kennen oder auslassen wollen ersetzen Sie die gesamte Zeile mit einem 
Bindestrich (dash, [ - ] ). Wiederholen Sie diesen Informationsblock f&uuml;r jede Werbung und achten 
Sie darauf, da&szlig; Sie keine Leerzeilen zwischen den einzelnen Bl&ouml;cken einf&uuml;gen.
</p>
<p>
Die einzelnen Parameter nun im Detail:  
<table>
<tr>
	<td valign="top"><i>URL</i></td>
	<td>Gibt die URL f&uuml;r die ASP Seite an, welche die Umleitung durchf&uuml;hrt. Dient meist dazu, die jeweilige Anzahl der Klicks auf die einzelnen Werbungen zu ermitteln.</td>
</tr>
<tr>
	<td valign="top"><i>WIDTH</i></td>
	<td>Definiert die Breite des Werbebildes</td>
</tr>
<tr>
	<td valign="top"><i>HEIGHT</i></td>
	<td>Definiert die H&ouml;he des Werbebildes</td>
</tr>
<tr>
	<td valign="top"><i>BORDER</i></td>
	<td>Gibt die Dicke des Rahmens an (in Pixel), welcher das Werbebild umgibt. Kann durch die Border-Eigenschaft des Ad Rotator Objekts &uuml;bergangen werden</td>
</tr>
<tr>
	<td valign="top"><i>AdURL</i></td>
	<td>URL zum Bild der Werbung</td>
</tr>
<tr>
	<td valign="top"><i>AdHomePageURL</i></td>
	<td>URL zu der Homepage des Werbers</td>
</tr>
<tr>
	<td valign="top"><i>AltText</i></td>
	<td>Falls der Client-Browser keine Bilder unterst&uuml;tzt oder der Client die Anzeigefunktion des Browsers ausgeschalten hat, wird  dieser alternative Text ausgegeben</td>
</tr>
<tr>
	<td valign="top"><i>Impressions</i></td>
	<td>Eine Zahl, die die relative H&auml;ufigkeit der Werbung angibt. Die einzelnen H&auml;ufigkeiten werden zusammengez&auml;hlt und eine Anzeigedauer je nach der angegebenen H&auml;ufigkeit der einzelnen Werbungen ermittelt.</td>
</tr>
</table>
</p>
<p>
Erstellen wir nun die Rotation Schedule Datei unter Verwendung der obigen Parameter:
<pre style="background='silver';">
 1: REDIRECT adrotat.asp
 2: WIDTH  468
 3: HEIGHT 60
 4: *
 5: ad_aspheute.png
 6: http://www.aspheute.com
 7: Alles &uuml;ber ASP bei ASP Heute
 8: 50
 9: ad_aspaktuell.png
10: http://www.aspaktuell.com
11: -
12: 25
13: ad_aspkurse.png
14: http://www.aspkurse.com
15: Online ASP lernen? &ndash; Bei ASPKurse
16: 25
</pre>
</p>
<p>
Die Umlenkung (Zeile 1) erfolgt auf die eigene Webseite <b>adrotat.asp</b>, um die jeweilige Anzahl 
der Klicks auf die einzelnen Werbungen ermitteln zu k&ouml;nnen (siehe sp&auml;ter).
</p>
<p>
Da hier auf eine extra Definition der Rahmendicke verzichtet wurde, entf&auml;llt der Eintrag 
<i>[BORDER Rahmendicke]</i>.
</p>
<p>
Die drei Werbungen sind grunds&auml;tzlich &auml;hnlich aufgebaut, jedoch mit dem Unterschied, da&szlig; der 
impressions-Wert jeweils unterschiedlich ist. Diese Konfiguration bedeutet, da&szlig; die "ASPHeute" - 
Werbung am l&auml;ngsten eingeblendet wird und "ASP Aktuell" und "ASP Kurse" zu gleichen Teilen k&uuml;rzer.
</p>
<p>
Der Bindestrich (dash, [ - ] ) in Zeile 11 bedeutet hier da&szlig; kein alternativer Text bei dieser 
Werbung erscheinen w&uuml;rde. Wie schon erw&auml;hnt m&uuml;ssen Sie diese setzten wenn Sie ein Argument nicht 
kennen (im Gegensatz zum 1. Teil wo Sie die nicht ben&ouml;tigten Formatoptionen einfach 
weglassen k&ouml;nnen. Sie d&uuml;rfen keinesfalls statt dessen Leerzeilen einf&uuml;gen).
</p>

<h3>Die Redirection Datei</h3>
<p>
Diese Datei veranla&szlig;t Ihren Server die Anzahl der erfolgreichen impressions-Klicks mitzuloggen, um 
eine Bewertung der Werbungen treffen zu k&ouml;nnen. Wenn Sie den REDIRECT-Parameter nicht angeben, 
beinhaltet der Werbebild-Hyperlink die URL des Werbers.
</p>
<p>
In unserem Fall, wo der Parameter gesetzt ist, ist folgender Hyperlink enthalten:
<pre style="background='silver';">
Adrotat.asp?url=http://www.aspheute.com/banner/&amp;image=ad_aspheute.png
</pre>
</p>
<p>
Dadurch sind Sie in der Lage, die Anzahl der erfolgreich angeklickten Werbungen generieren zu 
lassen, weil die  Seite auf Ihrem Server den Client zu der Homepage des Werbers umlenken mu&szlig;.
</p>
<p>
Ein Beispiel der <b>adrotat.asp</b> Datei:
<pre style="background='silver';">
&lt;% @LANGUAGE = VBScript %&gt;
&lt;%
	strAdvertiserURL = Request.QuerryString("http://www.aspheute.com")
	Response.AppendToLog strAdvertiserURL
	Response.Redirect(strAdvertiserURL)
%&gt;
</pre>
</p>
<p>
Die URL der Homepage des Werbers wird im Querystring der Redirection Datei &uuml;bergeben. Diese URL 
wird in Zeile 4 und der Log-Datei des Servers (Zeile 5) hinzugef&uuml;gt. Um die Art und Weise des 
Aktivit&auml;tsloggings zu &auml;ndern m&uuml;ssen Sie diese Zeile &auml;ndern. Da der "Werbe-Klick" in der Log-Datei 
eingetragen ist, wird der Client zu der Homepage des Werbers unter Verwendung  des ASP-Statements 
<i>Response.Redirect</i> (Zeile 6) umgeleitet.
</p>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Dieses einfache Beispiel sollte die Grundfunktionen der Ad Rotator Komponete veranschaulichen und 
den Einstieg in die Verwendung so einfach wie m&ouml;glich machen.
</p>
<p>
Obwohl Sie diese Komponete noch um einiges ausbauen k&ouml;nnen, st&ouml;&szlig;t sie bald an ihre Grenzen. Um 
mit Bannerwerbung richtig Geld zu verdienen, werden Sie wohl an einer umfangreichen Banner 
Management Software nicht herumkommen.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20000711.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20000711.zip</span></p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
