<HTML>
<HEAD>
<TITLE>Datenbank zur Weiterbearbeitung in Excel bereitstellen</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Dieser Artikel beschreibt, wie Sie eine vorhandene Daten[bank]ausgabe in eine Exceldatei ausgeben, soda&szlig; der Besucher Ihrer Seiten die Daten weiterverarbeiten kann.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Excel,Jet-Datenbanktreiber,ASP,Tabellenkalkulation,Excel-Datei,Webserver,Web Server,Internet">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Datenbank zur Weiterbearbeitung in Excel bereitstellen</H1>
<p>
Geschrieben von: <a href="../autoren/hubertdaubmeier.htm">Hubert Daubmeier</a><br>
Kategorie: <a href="../kategorien/ASP%20Tricks.htm">ASP Tricks</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20001128"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Hier nun wie versprochen der Folgeartikel zu <a href="../artikel/20001110.htm">Excel Dateien ohne Excel anzeigen</a>, der beschreibt, 
wie Sie eine vorhandene Daten[bank]ausgabe in eine Exceldatei ausgeben, soda&szlig; der Besucher Ihrer Seiten 
die Daten weiterverarbeiten kann.
</p>

<h2>Schnell und easy</h2>

<p>
Zun&auml;chst als Anmerkung: es gibt eine recht simple und schnelle Methode Daten von einer Webseite in Excel 
weiterzuverwenden. In Excel 2000 finden Sie unter DATEN - EXTERNE DATEN - NEUE WEBABFRAGE den folgenden 
Dialog. 
</p>

<p><IMG SRC="/artikel/Bilder/200011/20001128_xlwebabfrage.png" width="476" height="399" alt="" border="0"></p>

<p>
Dort die Zieladresse eingeben, oder &uuml;ber die Schaltfl&auml;che "Web durchsuchen" die gew&uuml;nschte Seite suchen.
Die weiteren Option sind weitestgehend selbsterkl&auml;rend.  Auf jeden Fall erhalten Sie in k&uuml;rzester Zeit 
Daten zur Weiterbearbeitung in Excel.
</p>

<p>
Zur sp&auml;teren Aktualisierung positionieren Sie den Zellzeiger auf eine beliebige Zelle des Ausgabebereichs 
und w&auml;hlen DATEN -DATEN AKTUALISIEREN. Alternativ k&ouml;nnen Sie beim Erstellen der Abfrage angeben, ob und in 
welchen Intervallen aktualisiert werden soll.
</p>

<p>
Eine ganze Palette weiterer M&ouml;glichkeiten und Feineinstellungen finden Sie bei vorhandenen 
Abfrageergebnissen in den Dialogen  DATEN - EXTERNE DATEN - ABGRAGE BEARBEITEN und 
DATEN - EXTERNE DATEN - DATENBEREICH EIGENSCHAFTEN.   Diese Optionen werden erst dann aktiv, wenn Sie 
bereits eine Abfrage durchgef&uuml;hrt haben und der Zellzeiger auf einer Zelle des Ausgabebereichs steht.
</p>

<h2>Aktuell, dynamisch</h2>

<p>
So nun aber zur dynamischen Bereitstellung einer Excel-Datei. Zur Verdeutlichung verwende ich das bekannte 
Beispiel aus Artikel "Excel Dateien ohne Excel anzeigen"{Link}. Ebenso wird die bereits bekannte 
Include-Datei readdb.asp verwendet. F&uuml;r Ihre sp&auml;tere Anwendung verwenden Sie zur Ausgabe nat&uuml;rlich Ihre 
Datenbank in einem beliebigen anderen Format.  
</p>

<p>
Um es kurz zu machen, der ganze Trick liegt in der Angabe eines neuen ContentTypes in Zeile 2. 
</p>

<p>
Wie gehabt, konzentrieren Sie sich auf Ihr Design und &uuml;bernehmen Sie nur die relevanten Zeilen 2 und 3 
sowie an passender Stelle den Aufruf der Unterroutine READDB. 
</p>

<p>
<pre style="background='silver';">
&lt;%@ LANGUAGE = VBScript %&gt;
&lt;%  Response.ContentType = "application/x-msexcel" %&gt;
&lt;!-- #include file="include/readdb.asp" --&gt;

&lt;html&gt;

&lt;head&gt;
&lt;title&gt;Datenbank als Exceldatei ausgegeben&lt;/title&gt;
&lt;link rel="stylesheet" type="text/css" href="Include/stylesheet.css"&gt;
&lt;/head&gt;

&lt;body&gt;

&lt;b&gt;Datenbank als Exceldatei ausgegeben&lt;br&gt;
&lt;hr size="1" color="#000000"&gt;

&lt;% call Readdb %&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</p>

<p>
Der Output sieht wie folgt aus (wenn man Open statt Save gew&auml;hlt hat):
</p>

<p><IMG SRC="/artikel/Bilder/200011/20001128_excelinbrowserwindow.png" width="566" height="414" alt="" border="0"></p>

<h2>Download oder wie?</h2>

<p>
Beim ersten Testen werden Sie feststellen, dass Sie die Anfrage erhalten "Datei downladen". Dies ist 
durchaus korrekt. Standardm&auml;&szlig;ig &uuml;bertr&auml;gt der Server - unsichtbar im Hintergrund - immer einen ContentType.
Der ist in aller Regel mit dem Inhalt "text/html" gef&uuml;llt, was der Browser als normal anzuzeigende Seite 
interpretiert und das naheliegende tut: die Seite anzeigen. 
</p>

<p>
In unserem Fall kommt nun ein neuer ContentType "daher", den der Browser richtigerweise als Downloaddatei 
interpretiert und den Inhalt an die dazu passende Applikation &uuml;bergibt (sofern der Benutzer dies erlaubt).
Beim Internet Explorer wird diese Exceldatei je nach Einstellung im Browserfenster (Standard) oder als 
separate Datei in Excel angezeigt. Der Navigator l&auml;dt sie immer in ein eigenes Excelfenster. 
</p>

<h2>Renn Rudi, renn</h2>

<p>
Bei firmenintern Einsatz bietet sich ein weiterer Ansatz der in der t&auml;glichen Praxis durchaus seine 
Berechtigung hat, weil er f&uuml;r die Anwender pfeilschnell ist und gleichzeitig maximale Flexibilit&auml;t 
bietet: Anzeige von Datenbankdaten in den Microsoft Office Web Components (OWC). 
</p>

<p>
Zum Beispiel im Finanzbereich werden oft t&auml;glich Daten gesichtet, die oft keine weitere Bearbeitung 
ben&ouml;tigen.  Die OWCs bieten flexible Anzeigefunktionen (siehe Screenshot), schnelles Filtern und Sortieren, 
und erm&ouml;glichen einfache Bearbeitungsschritte. 
</p>

<p><IMG SRC="/artikel/Bilder/200011/20001128_OWC_properties.png" width="274" height="390" alt="" border="0"></p>

<p>Wird mehr Funktionalit&auml;t ben&ouml;tigt, k&ouml;nnen die Daten in Excel &uuml;bernommen werden 
(siehe Excel-Schaltfl&auml;che).
</p>

<p><IMG SRC="/artikel/Bilder/200011/20001128_OWC_symbole.png" width="344" height="41" alt="" border="0"></p>

<p>
Als Voraussetzung muss bei den Anwendern Office 2000 installiert sein und die Ausf&uuml;hrung von ActiveX 
Controls im Intranet erlaubt sein. Ich will hier nicht &uuml;ber Sinn oder Unsinn des Einsatzes von ActiveX 
im Web diskutieren. Der Gedanke dahinter ist durch &uuml;berwiegend unqualifizierte Beitr&auml;ge nie recht verstanden 
worden. Falls Sie sich selbst ein Bild von der Sache machen wollen, finden Sie ein Beispiel das hier nicht weiter beschrieben ist, im Download. 
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
Es w&uuml;rde mich freuen, wenn Sie das eine oder andere der hier gezeigten Beispiel aufgreifen und nutzbringend 
einsetzen k&ouml;nnen. Ich erlebe in meiner betrieblichen Praxis immer wieder &uuml;ber welch unbegreifliche Umwege 
manche Anwender an das an und f&uuml;r sich einfache Ziel kommen. Da&szlig; die dabei vertane Zeit besser genutzt 
werden k&ouml;nnte, dazu will dieser Artikel beitragen. 
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20001128.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20001128.zip</span></p>
<h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010605.htm">CSVs aus MDBs leicht gemacht</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010605.htm</span><br>
<a href="../artikel/20001110.htm">Excel Dateien ohne Excel anzeigen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001110.htm</span><br>
<a href="../artikel/20020128.htm">Serverdaten clientseitig in Exceltemplates importieren</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020128.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
