<HTML>
<HEAD>
<TITLE>Web-basiertes Dateimanagement mit dem ASP FileMan</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Die ASP FileMan(ager) Applikation bietet umfassende Dateimanagementoptionen f&uuml;r eine Webseite in Verbindung mit dem IIS. Sie k&ouml;nnen basierend auf Benutzerrichtlinien (NT Authentifizierung) Dateien up- bzw. downloaden, oder Dateien manipulieren.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,FileMan,File Manager,Upload,Download,File Upload,file management,Dateimanager,Komprimierung,Dateien zippen">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Web-basiertes Dateimanagement mit dem ASP FileMan</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/Server.htm">Server</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20010507"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Die ASP FileMan(ager) Applikation bietet umfassende Dateimanagementoptionen f&uuml;r eine Webseite in Verbindung mit dem IIS. 
Sie k&ouml;nnen basierend auf Benutzerrichtlinien (NT Authentifizierung) Dateien up- bzw. downloaden, oder Dateien
manipulieren - und sogar Komprimierungsm&ouml;glichkeiten sind enthalten. Sie k&ouml;nnen also bequem &uuml;ber ASP (Ihre) Dateien
verwalten. Dieser Artikel bietet Ihnen eine kurze Anleitung zur Installation und Konfiguration dieser 
kostenlosen (Useranzahl eingeschr&auml;nkt in der freien Version) ASP Applikation.
</p>

<p>
Diese funktionsreiche Applikation k&ouml;nnen Sie, wie gesagt, kostenlos von <a href="http://www.iisworks.com/fileman/" target="_blank">IIS Works</a> downloaden. F&uuml;r den Betrieb der Applikation
ben&ouml;tigen Sie entweder den IIS oder PWS auf Windows NT 4 oder Windows 2000 Server. Nach dem Entpacken des Zip-Archivs
in ein Webserververzeichnis m&uuml;ssen Sie lediglich noch eine IIS Applikation f&uuml;r die Applikation im Internet Services 
Manager (ISM) erstellen.
</p>

<p>
Sie erstellen eine IIS Applikation indem Sie auf das Webserververzeichnis von FileMan klicken, das Kontextmen&uuml;
aufrufen und dort das Eigenschaftenfenster &ouml;ffen. Unter dem <i>Directory</i>-Tab finden Sie den Abschnitt 
<i>Application Settings</i>. Dort klicken Sie auf den <i>Create</i> Button und die <i>FileMan</i> Applikation wird
automatisch erstellt.
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_1.png" width="458" height="432" alt="" border="0">
</p>

<p>
Im Webserververzeichnis der FileMan Applikation befinden sich zwei Unterverzeichnisse: <i>img</i> und <i>database</i>. Aus Sicherheitsgr&uuml;nden
sollten Benutzer auf diese keinen direkten Zugriff erhalten. Denn z.B. das <i>database</i> Verzeichnis enth&auml;lt die Datenbank mit 
allen Benutzerlogininformationen inklusive Pa&szlig;wort als <i>Cleartext</i> und sollte daher auf jeden Fall gegen 
unerlaubten Zugriff gesch&uuml;tzt sein.
</p>

<p>
Bevor wir uns einloggen, sehen wir uns noch die mitgelieferte MS Access Datenbank (<b>fm.mdb</b>) an, die die Benutzerkonten verwaltet.
Hier k&ouml;nnen Access-erfahrene Administratoren ohne Browser neue Benutzer anlegen, verwalten oder Feintuning durchf&uuml;hren.
Die Benutzerlogindatenbank enth&auml;lt eine Tabelle namens <i>Login</i>, welche folgende Datenspalten enth&auml;lt (zweiteiliger Screenshot):
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_2.png" width="294" height="231" alt="" border="0">
<IMG SRC="/artikel/Bilder/200105/20010507_3.png" width="359" height="233" alt="" border="0">
</p>

<p>
Wie Sie sehen k&ouml;nnen, haben Sie hier einige M&ouml;glichkeiten um den Benutzern Rechte zu vergeben und die Konten an Ihre 
Sicherheitsma&szlig;st&auml;be anzupassen. 
</p>
<p>
Nun wollen wir aber FileMan ausprobieren. Da die Grundeinstellungen f&uuml;r die
Applikation in der <b>global.asa</b> Datei f&uuml;r die meisten Webserver akzeptabel sein sollten, m&uuml;ssen wir zun&auml;chst auch
keine &Auml;nderungen vornehmen.
</p>

<p>
Die Grundeinstellungen in der <b>global.asa</b> umfassen u.a. die M&ouml;glichkeiten der Angabe wo sich die Benutzerdatenbank befindet,
der Bekanntgabe des Authentifizierungsmodells (standardma&szlig;ig ist NT Authentication eingestellt), des Speicherortes
des Logfiles - mit dem man die Benutzeraktionen mitverfolgen kann - und vieles mehr.
</p>

<p>
Beginnen wir aber nun mit dem Login. Wenn Sie die kurze Installationsanleitung befolgt haben, sollten Sie nun beim 
Aufrufen der <b>default.asp</b> Datei der Applikation folgenden Login Screen sehen:
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_4.png" width="346" height="343" alt="" border="0">
</p>

<p>
Zu Testzwecken loggen wir uns mit dem voreingestellten Administratorkonto (UserID= <i>admin</i>, Pwd= <i>pass</i>) ein, 
das Sie aber dann im Betrieb nat&uuml;rlich &auml;ndern sollten. Nach erfolgreichem Login erhalten Sie folgende 
Datei&uuml;bersicht (mit den f&uuml;r dieses Konto voreingestellten Zugriffsberechtigungen):
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_5.png" width="590" height="432" alt="" border="0">
</p>

<p>
Die meisten Icons sollten Ihnen bekannt vorkommen, nichtsdestotrotz erhalten Sie eine Quickinfo, wenn Sie den 
Mauszeiger &uuml;ber das Icon bewegen. Jetzt wollen wir zun&auml;chst die Optionen von FileMan editieren. 
Hierf&uuml;r klicken Sie
auf das Optionen Icon <IMG SRC="/artikel/Bilder/200105/20010507_6.png" width="21" height="21" alt="" border="0">.
</p>

<p>
Im benutzerspezifischen <i>Optionen</i> Men&uuml; k&ouml;nnen Sie das Aussehen des Dateilistings und dateispezifische Einstellungen
treffen, welche Sie durch Klicken auf den <i>Save</i> Button permanent f&uuml;r das aktuelle Benutzerkonto speichern (wieder
ein gesplitteter Screenshot):
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_7.png" width="190" height="263" alt="" border="0">
<IMG SRC="/artikel/Bilder/200105/20010507_8.png" width="190" height="273" alt="" border="0">
</p>

<p>
Nun wollen wir aber auch einen neuen Benutzer anlegen. Hierf&uuml;r klicken Sie auf das 
<IMG SRC="/artikel/Bilder/200105/20010507_9.png" width="23" height="23" alt="" border="0"> Icon und Sie erhalten folgenden Screen:
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_10.png" width="328" height="313" alt="" border="0">
</p>

<p>
In diesem k&ouml;nnen Sie entweder nach vorhandenen Benutzern suchen, oder webbasierend neue anlegen. Um einen neuen Benutzer 
anzulegen, klicken Sie auf <i>Add new user</i>. Sie k&ouml;nnen nun dem neuen Benutzer die standardm&auml;&szlig;igen
Kontoinformationen (Kontoname und Pa&szlig;wort) und folgende Rechte vergeben:
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_11.png" width="226" height="354" alt="" border="0">
<IMG SRC="/artikel/Bilder/200105/20010507_12.png" width="227" height="290" alt="" border="0">
</p>

<p>
Im <i>Root folder</i> geben Sie das Verzeichnis an, das dem Benutzer exklusiv zugeordnet ist, d.h. wenn Sie in diesem Eingabefeld 
eines angeben, hat der jeweilige Benutzer au&szlig;erhalb
diesem keine Berechtigungen. Weiters k&ouml;nnen Sie dem Benutzer spezielle Verzeichnisse sperren, indem Sie diese in der <i>Forbidden List</i>
eintragen.
</p>

<p>
Die Applikation bietet auch ein <i>Disk Quota</i> &auml;hnliches Management. Wenn Sie bei <i>Maximum size</i> eine MB-Gr&ouml;&szlig;e
angeben, so erh&auml;lt das Konto eine Speicherkapazit&auml;tslimitierung auf die genannte Gr&ouml;&szlig;e. Bei Erreichen des Limits kann der
Benutzer keine Dateien mehr uploaden oder z.B. Kopien davon erstellen.
</p>

<p>
Je nach Berechtigung kann ein Benutzer Verzeichnisse erstellen (<IMG SRC="/artikel/Bilder/200105/20010507_13.png" width="20" height="20" alt="" border="0">)
oder die Eigenschaften einer Datei bearbeiten (<IMG SRC="/artikel/Bilder/200105/20010507_14.png" width="21" height="21" alt="" border="0">):
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_15.png" width="487" height="123" alt="" border="0">
<br>Ein Verzeichnis erstellen.
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_16.png" width="487" height="126" alt="" border="0">
<br>Dateiattribute bearbeiten.
</p>

<p>
Aber nun zu den Dateiup- bzw. -downloadf&auml;higkeiten der FileMan Applikation. Die gute Nachricht - die Applikation enth&auml;lt bereits
alles n&ouml;tige, um diese Operationen durchzuf&uuml;hren. Sie m&uuml;ssen daher keine Down- bzw. Upload Komponenten von anderen 
Drittherstellern beziehen. Sie k&ouml;nnen mit <i>Upload Files</i>
(<IMG SRC="/artikel/Bilder/200105/20010507_17.png" width="23" height="23" alt="" border="0">) bis zu sechs Dateien gleichzeitig uploaden. 
Nachdem Sie auf dieses Icon geklickt haben, erhalten Sie folgendes Fenster:
</p>

<p>
<IMG SRC="/artikel/Bilder/200105/20010507_18.png" width="392" height="374" alt="" border="0">
</p>

<p>
Hier einfach auf <i>Browse</i> klicken und eine Datei ausw&auml;hlen. Um die Dateien auf den Webserver upzuloaden dann einfach auf
den <i>Upload</i> Button klicken.
</p>

<p>
Dateien lokal abspeichern ist ebenso einfach - funktioniert aber, im Gegegensatz zum Upload, immer nur f&uuml;r eine Datei 
gleichzeitig. Hierf&uuml;r klicken Sie einfach auf den jeweiligen Dateinamen und Sie erhalten den standardm&auml;&szlig;igen
<i>Datei Speichern Als</i> Dialog. Sie k&ouml;nnen auch innerhalb der Applikation - &auml;hnlich wie im Explorer - Dateien oder Verzeichnisse
kopieren, verschieben oder l&ouml;schen. Die Operationen beziehen sich dabei auf die ausgew&auml;hlten bzw. angehakten Dateien oder
Verzeichnisse. 
</p>

<p>
Wenn Sie Verzeichnisse manipulieren sind auch deren Unterverzeichnisse und die in ihnen enthaltene Dateien von den 
&Auml;nderungen betroffen.
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
Alles in allem eine einfach zu bedienende Applikation, die auch in puncto Sicherheit und Benutzerverwaltung keine W&uuml;nsche 
offen l&auml;&szlig;t. Die Integration der Up- bzw. Downloadf&auml;higkeiten und die automatischen Einbindung eines Dateikompressionstools
- bis jetzt nur mit der kostenlosen <a href="http://www.mitdata.com/" target="_blank">AspEasyZIP</a> Komponente realisierbar - lassen
andere kostenpflichtige Dateimanagement-Applikationen hinten anstehen.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/19990812.htm">Dateien mit dem Browser auf Webserver laden</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/19990812.htm</span><br>
<a href="../artikel/20010202.htm">Dateiupload mit ASP und WSC</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010202.htm</span><br>
<a href="../artikel/20000802.htm">Dateiupload mit ASP.NET</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000802.htm</span><br>
<a href="../artikel/20010124.htm">Dateiupload mit ASP.NET und VB.NET</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010124.htm</span><br>
<a href="../artikel/20001113.htm">Eine simple UNZIP-Komponente programmieren</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001113.htm</span><br>
<a href="../artikel/20001016.htm">Manipulieren von ZIP Archiven am Server</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001016.htm</span><br>
<a href="../artikel/20010402.htm">NT Account Management via ASP</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010402.htm</span><br>
<a href="../artikel/20021105.htm">Online File Management System mit ASP.NET und C# - Teil 2</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20021105.htm</span><br>
<a href="../artikel/20011016.htm">Verzeichnisb&auml;ume rekursiv generieren</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20011016.htm</span><br>
<a href="../artikel/20001109.htm">Verzeichnissicherheit mit NTFS und IIS Authentifizierung</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001109.htm</span><br>
<a href="../artikel/20001005.htm">Zippen und entzippen von Dateien</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001005.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emitdata%2Ecom%2F">AspEasyZIP</a><br>
<SPAN class="content">http://www.mitdata.com/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Eiisworks%2Ecom%2Ffileman%2F">FileMan Download</a><br>
<SPAN class="content">http://www.iisworks.com/fileman/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
