<HTML>
<HEAD>
<TITLE>Excel Diagramme als GIF's serven</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Dieser Artikel zeigt Ihnen wie Sie Grafiken aus einem serverseitig generierten Microsoft Excel Diagramm erstellen k&ouml;nnen. Die Grafiken werden dabei als GIF-Dateien im Server Pfad abgespeichert.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Excel,GIF,Speichern,Diagramm,Rendering,xlHtml,GetTempName,xlFileFormat">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Excel Diagramme als GIF's serven</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/ASP%20Tricks.htm">ASP Tricks</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20010309"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Dieser Artikel zeigt Ihnen wie Sie Grafiken aus einem serverseitig generierten Microsoft
Excel Diagramm erstellen k&ouml;nnen. Die Grafiken werden dabei als GIF-Dateien im Server Pfad abgespeichert.
Diese k&ouml;nnen dann von anderen Scripts weiterverwendet werden, oder einfach zum Client geschickt werden.
</p>

<p>
Der heutige Artikel baut auf den beiden Artikeln 
<a href="../artikel/20010305.htm">Ein Excel-Sheet am Server generieren und zum Client schicken</a>
und <a href="../artikel/20010307.htm">Ein Excel-Diagramm am Server generieren und zum Client schicken</a> auf.
Daher ist, wie in den vorigen beiden Artikeln, auch diesmal der Web Server dementsprechend zu konfigurieren, um
den Beispiel Sourcecode erfolgreich verwenden zu k&ouml;nnen. Die n&ouml;tigen
Vorbereitungen entnehmen Sie bitte aus einem der genannten Artikel.
</p>

<p>
Seit Beginn dieser Artikelserie, die sich mit dem serverseitigen Generieren eines Excel SpreadSheets
inklusive ADO Datenbankabfrage und mit der Erstellung eines passenden Charts befa&szlig;t, erweitern wir die 
Funktionalit&auml;t - und heute wieder, und zwar durch eine browserf&auml;hige Grafik des generierten Diagramms. Der Vorteil: der Client
braucht kein Excel, um das Diagramm betrachten zu k&ouml;nnen.
</p>

<p>
Die Erstellung einer Gif-Datei ist als zus&auml;tzliches Feature in einer Speicheroption von Excel versteckt. Der &quot;Speichern als&quot; Dialog bietet
n&auml;mlich die zus&auml;tzliche M&ouml;glichkeit das Workbook im <i>HTML</i>-Format abzuspeichern. Dabei werden vorhandene Diagramme
als GIF-Datei abgespeichert - praktisch! Dies ist dann unsere Grafik. Die erstellten
Grafiken haben eine brauchbare Aufl&ouml;sung von 800x600 Pixel.
</p>

<p>
Da wie gesagt der Artikel auf die obig genannten Artikel aufbaut, interessieren wir uns nur f&uuml;r den heute
ver&auml;nderten Teil. Der hier verwendete Sourcecode fokusiert sich dabei speziell nur auf die Erstellung der Grafik.
Das hei&szlig;t der Code f&uuml;r die Formatierung des SpreadSheets ist rausgeflogen, da uns ja heute nur die Diagrammerstellung
und der ver&auml;nderte Speichervorgang interessiert.
</p>

<p>
Beginnen wir mit der Sourcecodebesprechung an der Stelle, wo das zu generierende Diagramm erstellt wird. Die Datenbankoperationen sind bereits
abgschlossen und die daf&uuml;r ben&ouml;tigte Verbindung ist nun wieder geschlossen. Die benutzten Objekte sind zerst&ouml;rt.
Die Daten sind auch schon in die Zellen des SpreadSheets eingetragen und wir treffen nun die Vorbereitungen f&uuml;r das Diagramm:
</p>

<pre style="background='silver';">
...
'--- Creating Chart
xlBook.Charts.Add
xlBook.ActiveChart.Name = "Graph"
xlBook.Charts("Graph").SetSourceData (xlBook.Sheets("Data").Range("A4:B9"))

'--- 3DPieExploded
With xlBook.Charts("Graph")
    .ChartType = 70
    .PlotBy = 2
    .HasTitle = 1
    .charttitle.Characters.Text = "Overall Product Sales 2000"
    .charttitle.Font.Name = "Tahoma"
    .charttitle.Font.FontStyle = "Bold"
    .charttitle.Font.Size = 30
    .charttitle.Font.ColorIndex = 3
End With
...
</pre>

<p>
Gro&szlig;teils nichts Neues. Da wir zum Schlu&szlig; nur mehr eine Gif-Datei mit dem entsprechenden Diagramm erhalten wollen, ist es ganz angebracht
z.B. dem Diagramm eine &Uuml;berschrift zu verpassen. Diese habe ich optisch ein klein wenig aufgeputzt. Betont nur ein klein wenig,
da f&uuml;r die meisten Business-Grafiken ein 70er Jahre LSD-Trip Design wohl fehl am Platz ist. Au&szlig;erdem, wer schreibt schon
gern freiwillig Unmengen Code, der &quot;nur&quot; den Zweck der Formatierung hat.
</p>

<p>
Da nun der Diagrammcode soweit fertig ist, k&ouml;nnen wir eigentlich schon die Datei abspeichern. Bevor wir dies codieren wollen,
sind aber noch einge Punkte zu ber&uuml;cksichtigen.
<p>

<p>
Wie schon erw&auml;hnt wollen wir eigentlich nur eine Grafik des generierten Diagramms, und das m&ouml;glichst einfach und schnell.
Da aber im Gegensatz zu Microsoft PowerPoint eine direkte Speicherung der Datei in einem Grafikformat nicht so einfach m&ouml;glich ist,
verwenden wir nun die Option <i>Speichern als HTML</i>. Dabei werden wie gesagt unter anderem Diagramme als Gif-Datei abgespeichert.
</p>

<p>
Damit man aber die Excel Datei bequem mit einem Browser betrachten kann, werden auch andere Dateien und ein Verzeichnis erstellt.
Da uns diese Dateien heute aber nicht wirklich interessieren, l&ouml;schen wir sie einfach. Ist zwar nicht die besonders elegante Methode
zu einer Diagrammgrafik zu kommen, aber sie ist einfach und bis jetzt hat noch immer der Zweck die Mittel geheiligt.
</p>

<p>
Der n&auml;chste Punkt der zu erw&auml;hnen ist, ist da&szlig; sich der Web Server verschluckt, wenn mehrere User die ASP Seite gleichzeitig
verwenden wollen (und wir auf die gleiche Datei schreiben). Das l&auml;&szlig;t sich mit der <i>GetTempName</i> Methode von VBScript umgehen. Diese dr&uuml;ckt Ihnen
n&auml;mlich einen einzigartigen Dateinamen in die Hand - somit w&auml;re auch dieses Problem gel&ouml;st. Gehen wir also weiter im Sourcecode.
</p>

<pre style="background='silver';">
Set fso = CreateObject("Scripting.FileSystemObject")
strTempName = fso.GetTempName    
strFileName= Replace(strTempName,".tmp",".htm")

xlBook.Charts("Graph").SaveAs Server.MapPath(strFileName),44

xlApp.Application.Quit
</pre>

<p>
Wir erstellen uns also mit der <i>GetTempName</i> Methode einen zuf&auml;llig generierten Dateinamen, den wir in der Variablen
<i>strTempName</i> speichern. Sagte ich eigentlich &quot;DateiNAME&quot;? Nun, die Methode ist ja an sich ganz praktisch: wir
erhalten einen beliebigen Namen und zus&auml;tzlich aber auch eine <i>.tmp</i> Extension. Dies ist in anderen F&auml;llen nat&uuml;rlich 
praktisch - in unserem Fall aber zuviel des Guten. 
</p>

<p>
Deshalb schreiben wir eine Zeile mehr Code und tauschen mit der <i>Replace</i> Methode die <i>.tmp</i> Erweiterung
mit der ben&ouml;tigten <i>.htm</i>. Nun k&ouml;nnen wir die Datei mit dem zuf&auml;llig generierten Namen speichern. Damit wir
Excel nicht verwirren, da es standardm&auml;&szlig;ig die Endung <i>.xls</i> erwartet, versichern wir Excel, da&szlig; wir wissen
was wir tun. Dies erreichen wir mit der Angabe von <i>44</i> - da&szlig; wir eben im HTML-Format speichern wollen. 
</p>

<p>
<i>44</i> ist das numerische &Auml;quvivalent zur Excel Konstante <i>xlHtml</i>. Diese ist wiederum Member der
<i>XlFileFormat</i> Collection - also nix mit Voodoo, alles legal! Die Dateien, die durch diese Option erstellt
werden, sind nun am Web Server gespeichert. Nun ist es h&ouml;chste Zeit mit <i>Application.Quit</i> Excel zu schlie&szlig;en.
</p>

<p>
Nun k&ouml;nnen wir auch, um ein wenig aufzur&auml;umen, die restlichen Objekte, die von Excel gebraucht wurden getrost
vernichten. Was noch fehlt ist, und diese Schritte sind optional, da&szlig; wir alle generierten Dateien bis auf unsere
GIF Datei l&ouml;schen. F&uuml;r den Fall, da&szlig; Sie auch die generierten Html und anderen Dateien ben&ouml;tigen ist der nun folgende Code
&uuml;berfl&uuml;ssig. Heute wollen wir aber eben nur die Grafik - also m&uuml;ssen wir folgendes programmieren:
</p>

<pre style="background='silver';">
strTempDir =Replace(strFileName,".htm","_files")

If (fso.FileExists(Server.MapPath(strTempDir &amp; "\image001.gif"))) Then
    Set MyFile = fso.GetFile(Server.MapPath(strTempDir &amp; "\image001.gif"))
    strGifName = Replace(strTempDir, "_files",".gif")
    MyFile.Move Server.MapPath(strGifName)
    
    strDelFile=Replace(strTempDir, "_files",".htm")
    Set MyDelFile = fso.GetFile(Server.MapPath(strDelFile))
    MyDelFile.Delete
    fso.DeleteFolder (Server.MapPath(strTempDir))
End If
</pre>

<p>
Die zus&auml;tzlichen Dateien, au&szlig;er der Html-Datei die zum betrachen des Workbooks erforderlich ist, werden
immer in einem Unterverzeichnis gespeichert. Dieses Unterverzeichnis setzt sich aus dem Dateinamen der 
gespeicherten Datei und dem Zusatz <i>&quot;_files&quot;</i> zusammen. In diesem Unterverzeichnis befindet sich auch unsere
hei&szlig; ersehnte Grafik!
</p>

<p>
Standardm&auml;&szlig;ig setzt sich der Dateiname der Grafik aus <i>&quot;image&quot;</i>, einer dreistelligen Zahlenfolge, die als
fortlaufende Numerierung dient und eben der Dateiendung <i>*.gif</i> zusammen. Zuerst suchen wir mit der <i>GetFile</i>
Methode nach dieser Datei. Da wir in diesem Beispiel nur ein Diagramm erstellen, brauchen wir ja auch nur nach einer,
eben dieser zu suchen. Deshalb habe ich hier auch der Einfachheit halber den Dateinamen hardcodiert.
</p>

<p>
Da ja unsere Grafiken einzigartig sein sollen, wenden wir wieder die <i>Replace</i> Methode an, und k&ouml;nnen uns somit 
einen neuen einzigartigen Namen aus dem noch zur Verf&uuml;gung stehenden Variablen <i>strTempDir</i> basteln.
</p>

<p>
Dann verschieben wir die umbenannte Grafik mit der <i>Move</i> Methode eine Ebene h&ouml;her. Nun k&ouml;nnen wir ruhig
das nicht mehr ben&ouml;tigte Verzeichnis samt der Html-Datei l&ouml;schen. Da diese Html-Datei und das dazugeh&ouml;rige
Verzeichnis nach dem generierten Namen der <i>GetTempName</i> Methode benannt wurden, m&uuml;ssen wir das bei den L&ouml;schaktionen
ber&uuml;cksichtigen.
</p>

<p>
Wie erwartet bleibt nach vollst&auml;ndigem Ablauf des Scripts nur mehr die Grafik &uuml;brig. Diese, ich zeige ihnen wieder
beide aus dem Script generierbaren Diagrammtypen, sehen dann hier zweckm&auml;&szlig;g verkleinert so aus:
</p>

<p>
Das S&auml;ulen Diagramm (Original: 800x600x256):
</p>

<p>
<IMG SRC="/artikel/Bilder/200103/20010309_1.png" width="580" height="435" alt="" border="0">
</p>

<p>
Das Kuchen Diagramm (Original: 800x600x256):
</p>

<p>
<IMG SRC="/artikel/Bilder/200103/20010309_2.png" width="580" height="435" alt="" border="0">
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
Nun h&auml;tten wir die wichtigsten Punkte zum Thema Excel-SpreadSheets Generierung besprochen. Sie k&ouml;nnen
nun ein SpreadSheet mit Daten aus einer Datenbank samt dazugeh&ouml;rigen Diagramm und sogar einer Grafik f&uuml;r
Rechner ohne Excel erstellen. Und dies wird alles ohne menschliches Zutun am Web Server generiert.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20010309.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20010309.zip</span></p>
<h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010307.htm">Ein Excel-Diagramm am Server generieren und zum Client schicken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010307.htm</span><br>
<a href="../artikel/20010305.htm">Ein Excel-Sheet am Server generieren und zum Client schicken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010305.htm</span><br>
<a href="../artikel/20001110.htm">Excel Dateien ohne Excel anzeigen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001110.htm</span><br>
<a href="../artikel/20020128.htm">Serverdaten clientseitig in Exceltemplates importieren</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020128.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
