<HTML>
<HEAD>
<TITLE>Installation und Konfiguration von MySQL unter Windows 2000 Professional</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Aus Kostengr&uuml;nden f&auml;llt die Wahl immer &ouml;fter auf MySQL. Im heutigen Artikel m&ouml;chte ich insbesondere auf die Installation von MySQL unter dem Betriebssystem Windows 2000 Professional eingehen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Performance,Datenbankserver,Installationsanleitung,MySQL,Open Source,Gratis,Free">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Installation und Konfiguration von MySQL unter Windows 2000 Professional</H1>
<p>
Geschrieben von: <a href="../autoren/renedrescher-hackel.htm">Rene Drescher-Hackel</a><br>
Kategorie: <a href="../kategorien/Datenbank.htm">Datenbank</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20010618"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Jeder, der im Rahmen der ASP-Programmierung datenbankgest&uuml;tzte Webseiten schon einmal erstellt hat, hat den 
Einstieg dabei mit Microsoft Access Datenbanken realisiert. Schnell ist aber erkennbar, da&szlig; Access (Jet) 
Datenbanken auch klare Grenzen gesetzt sind - in der Anzahl der gleichzeitigen Benutzer, und speziell in der 
Performance. 
</p>

<p>
Dieses Problem zu l&ouml;sen bedeutet meistens den Wechsel der Datenbank, hin zu einem dezidierten 
Datenbank(server)system wie zum Beispiel SQL Server, Oracle, Sybase oder auch MySQL. Aus Kostengr&uuml;nden 
f&auml;llt dabei die Wahl immer &ouml;fter auf MySQL, das auch f&uuml;r kommerzielle Verwendung v&ouml;llig gratis verwendbar ist. 
</p>

<p>
Im heutigen Artikel m&ouml;chte ich insbesondere auf die Installation von MySQL unter dem Betriebssystem 
Windows 2000 Professional eingehen. Weitere Artikel befassen sich dann mit Administration und Verwendung von 
MySQL Datenbanken in ASP.
</p>

<h2>Die Installation unter Windows 2000 Professional</h2>

<p>
Als erstes stellt sich die Frage, wo MySQL denn zu beziehen ist. Da MySQL ein Open-Source Produkt ist 
(ja, neben der Installationsversion kann man auch den Sourcecode gratis beziehen), bietet sich das Internet 
ganz klar als erste Anlaufstelle an. Unter
</p>

<a href="http://www.mysql.com/downloads/index.html" target="_blank">http://www.mysql.com/downloads/index.html</a>

<p>
finden Sie eine &Uuml;bersicht der verf&uuml;gbaren Distributionen. Die Version 3.23 ist dabei die zum Zeitpunkt der 
Artikelerstellung als "Stable Release" verf&uuml;gbare Version, die auch unter Windows (98, NT, 2000) installiert 
werden kann. Wenn Sie die Windows-Version (3.23.38) herunterladen wollen, finden Sie die erforderliche 
ZIP-Datei unter der Adresse
</p>

<a href="http://www.mysql.com/Downloads/MySQL-3.23/mysql-3.23.38-win.zip" target="_blank">http://www.mysql.com/Downloads/MySQL-3.23/mysql-3.23.38-win.zip</a>

<p>
Speichern Sie die ZIP-Datei in ein Verzeichnis Ihrer Wahl z.B
</p>

<pre style="background='silver';">
C:\MySQL_source\
</pre>

<p>
Entpacken Sie die Dateien z.B. in das Verzeichnis
</p>

<pre style="background='silver';">
C:\MySQL_source\setup\
</pre>

<p>
Anschlie&szlig;end erhalten Sie folgende Ansicht:
</p>

<IMG SRC="/artikel/Bilder/200106/20010618_1.png" width="510" height="446" alt="" border="0">

<p>
Starten Sie das Programm "setup.exe" durch Doppelklick, und schon wird der Installationsassistent gestartet. 
Die folgende Meldung erscheint am Bildschirm:
</p>

<IMG SRC="/artikel/Bilder/200106/20010618_2.png" width="519" height="473" alt="" border="0">

<p>
Best&auml;tigen Sie diesen ersten Schritt des Installationsassistenten durch Klicken auf die "Next" Schaltfl&auml;che. 
Auch den n&auml;chsten Bildschirm k&ouml;nnen Sie entsprechend durch einen Klick auf "Next" best&auml;tigen. 
</p>

<p>
In dem nun folgenden Bildschirm w&auml;hlen Sie das Installationsverzeichnis f&uuml;r den MySQL-Datenbankserver aus. 
</p>

<IMG SRC="/artikel/Bilder/200106/20010618_3.png" width="519" height="473" alt="" border="0">

<p>
Standardm&auml;&szlig;ig wird Ihnen hier 
</p>

<pre style="background='silver';">
C:\mysql
</pre>

<p>
vorgeschlagen. &Uuml;ber den Button "Browse" k&ouml;nnen Sie - soweit erforderlich - ein anderes Zielverzeichnis ausw&auml;hlen.
</p>

<p>
Im Anschlu&szlig; entscheiden Sie, welche Installationsform Sie ben&ouml;tigen.
</p>

<IMG SRC="/artikel/Bilder/200106/20010618_4.png" width="519" height="473" alt="" border="0">

<p>
Die "Typical" - Installation ist in der Regel ausreichend. Nach entsprechender Auswahl und Best&auml;tigung durch 
"Next" startet die eigentliche Installation - das Kopieren der Dateien.
</p>

<p>
Nach erfolgreicher Installation &ouml;ffnen Sie den Windows Explorer und wechseln in das 
MySQL-Installationsverzeichnis. Hier finden Sie dann folgende Verzeichnisstruktur:
</p>

<IMG SRC="/artikel/Bilder/200106/20010618_6.png" width="136" height="176" alt="" border="0">

<p>
Im Ordner (sofern "C:\mysql\" Ihr Installationsordner ist)
</p>

<pre style="background='silver';">
C:\mysql\bin\
</pre>

<p>
befindet sich neben den einzelen Administrations- und Zusatzprogrammen das Programm
</p>

<pre style="background='silver';">
mysqld-nt.exe
</pre>

<p>
Das Programm mysqld-nt.exe wird vom DOS-Prompt aufgerufen und kann dabei die folgenden Parameter mit verwenden:
</p>

<pre style="background='silver';">
mysqld-nt.exe --standalone (startet den MySQL-Server)
mysqld-nt.exe --install (installiert den MySQL-Server als Dienst)
mysqld-nt.exe --remove (entfernt den MySQL-Server-Dienst)
</pre>

<p>
Bevor Sie &uuml;berhaupt den MySQL-Server ansprechen k&ouml;nnen, m&uuml;ssen Sie ihn starten - ob als "standalone" 
(sozusagen Start auf Bedarf - unter Windows 98 wird mit der Option -- console gestartet) oder als Dienst 
(Start beim Hochfahren des Servers, wie zB SQL Server). Soweit Sie mit NT/2000 arbeiten, empfiehlt es sich 
den MySQL-Server immer als Dienst zu starten. Wie das &uuml;ber (graphische) administrative Tools realisiert 
werden kann, soll Gegenstand eines folgenden Artikels sein.
<p>

<p>
Daneben finden Sie im selben Verzeichnis die Datei
</p>

<pre style="background='silver';">
mysql.exe
</pre>

<p>
Mit diesem Programm starten Sie den MySQL-Monitor. Dieses Programm ist ebenfalls vom DOS-Prompt aus zu starten. 
&Ouml;ffnen Sie also ein DOS-Fenster (mittels cmd.exe oder &uuml;ber "Start"-"Programme"-"Zubeh&ouml;r"-"Eingabeaufforderung") 
und wechseln Sie in Ihr Verzeichnis, in dem Sie MySQL installiert haben. Wechseln Sie hier in das /bin-Verzeichnis
und rufen Sie das Programm "mysql" auf. Sie erhalten - wenn der MySQL-Server zuvor ordnungsgem&auml;&szlig; gestartet wurde - 
folgenden Bildschirm:
</p>

<IMG SRC="/artikel/Bilder/200106/20010618_7.png" width="516" height="261" alt="" border="0">

<p>
Auf dieser Ebene k&ouml;nnen Sie dann &uuml;ber SQL (Structured Query Language) als Datenbankabfragesprache mit dem 
MySQL-Server kommunizieren. Wollen Sie mehr &uuml;ber einzelne Datenbanken erfahren, so m&uuml;ssen Sie die 
Datenbank per Anweisung erst einmal ausw&auml;hlen, damit auch der Server wei&szlig;, wor&uuml;ber Sie mit ihm reden wollen.
Der Befehl hierzu lautet z.B. f&uuml;r die <b>test</b>-Datenbank:
</p>

<pre style="background='silver';">
mysql > use test;
</pre>

<p>
Der MySQL-Server quittiert Ihnen diese Anweisung mit 
</p>

<pre style="background='silver';">
Database changed
</pre>

<p>
Das, wenn er die Datenbank "test" finden und ausw&auml;hlen konnte - oder Sie bekommen die (Fehler-)Meldung
</p>

<pre style="background='silver';">
ERROR 1049: Unbekannte Datenbank 'bla'
</pre>

<p>
Wobei 'bla' f&uuml;r den Datenbanknamen eingegeben wurde. 
</p>

<p>
Nach diesem einfachen Test kann man bereits getrost sagen, da&szlig; man einen funktionierenden 
MySQL-Datenbankserver in Betrieb genommen hat.
</p>

<h2>Zusammenfassung</h2>
<p>
Die Installation von MySQL unter Windows 2000 Professional (Windows 98/NT4 verl&auml;uft nicht anders) gestaltet 
sich denkbar einfach, und beweist, da&szlig; man einen Wechsel auf eine gr&ouml;&szlig;ere Datenbank wie zum Beispiel 
MySQL nicht zu scheuen braucht. In den folgenden Artikeln werden wir uns mit der Administration von 
MySQL, der ODBC-Anbindung und der Nutzung in ASP-Anwendungen besch&auml;ftigen.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010730.htm">Administration von MySQL unter Windows 2000</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010730.htm</span><br>
<a href="../artikel/20010731.htm">Datenimport von Access nach MySQL</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010731.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emysql%2Ecom%2Fdownloads%2Findex%2Ehtml">MySQL Downloads</a><br>
<SPAN class="content">http://www.mysql.com/downloads/index.html</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emysql%2Ecom%2F">MySQL.com</a><br>
<SPAN class="content">http://www.mysql.com/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
