<HTML>
<HEAD>
<TITLE>Einrichten des Snitz Forums</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="In diesem Artikel stelle ich Ihnen das &quot;Snitz Forum&quot; in der aktuellen Version vor, das als besondere Vorteile zwei hat: es benutzt keine Komponenten (au&szlig;er Email), und es ist gratis.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Snitz,Forum,Access,SQL Server,Import Wizard,DTS,Data Transformation Services,ODBC,DSN">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Einrichten des Snitz Forums</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20010201"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Ein Forum kann man auf einer Community Website als "einfaches" Diskussionsforum, oder
auf einer Firmenhomepage als Supportforum anbieten (nat&uuml;rlich sind das nur 2 willk&uuml;rlich
gew&auml;hlte Anwendungsf&auml;lle). In diesem Artikel stelle ich Ihnen das &quot;Snitz Forum&quot; in 
der aktuellen Version vor, das als besondere Vorteile zwei hat: es benutzt keine
Komponenten (au&szlig;er Email), und es ist gratis.
</p>

<p>
Im heutigen Artikel besch&auml;ftigen wir uns mit dem Einrichten des Snitz Forums:
wir werden die Datenbank des Forums  konfigurieren (Access und SQL Server), und nehmen die n&ouml;tigen Schritte im 
Snap-In der Internet Information Services (IIS) vor. Zuletzt werden wir, nach dem das Setup 
beendet ist, uns einloggen und kurz testen.
</p>

<h2>Das Forum kurz vorgestellt</h2>

<p>
Das <a href="http://forum.snitz.com/" target="_blank">Snitz Forum 2000</a> ist ein Diskussionsforum, in dem registrierte Mitgliedern &uuml;ber 
das Internet oder das Intranet Beitr&auml;ge posten k&ouml;nnen, und auch auf Beitr&auml;ge antworten k&ouml;nnen.
</p>

<p>
Das Forum bietet ein vern&uuml;nftiges Administrations Interface (die genauen Keyfeatures finden Sie
unter <a href="http://forum.snitz.com/specs.asp" target="_blank">Product Specifications</a>) und somit einen 
reibungslosen Betrieb (z.B. Moderation) bzw. einfache Wartung. Nun werden Sie sicher fragen, 
wieviel das Diskussionsforum kostet und welche Systemvoraussetzungen es hat.
</p>

<h3>Anschaffungskosten</h3>

<p>
Zuerst einmal das angenehme: das Forum ist <i>Freeware</i>. Sie m&uuml;ssen lediglich die GPL anerkennen
und den Schriftzug &quot;Powered By: Snitz Forums 2000&quot; auf Ihrer Webseite als Fu&szlig;note einbinden.
</p>

<h3>Systemvoraussetzungen</h3>
<p>
Bei den Systemvoraussetzungen ist das Forum flexibel. Angefangen von den g&auml;ngigen MS Windows 
Plattformen bis zu einem Unix System reicht die Palette. Als Webserver k&ouml;nnen Sie entweder den IIS
(Version 4/5), PWS oder auf Unix Systemen z.B. Chili!Asp verwenden. Zus&auml;tzlich ben&ouml;tigen Sie entweder
MS Access 97/2000 oder MS SQL Server 6.5 oder h&ouml;her oder MySql Version 3.22 oder 3.23.
Die Unterst&uuml;tzung von Oracle 8i wird erst in den n&auml;chsten Versionen des Forums erfolgen.
</p>

<h2>Die Konfiguration</h2>

<p>
Dieser Artikel beschreibt die Einrichtung des Forums auf einem Windows 2000 Server mit IIS 5.
Bei der Datenbankanbindung habe ich mich einmal f&uuml;r den OLE DB-JET 4 Treiber und dann 
f&uuml;r die Einrichtung am SQL Server 2000 entschlossen.
</p>

<p>
Zuallererst downloaden Sie die Zip-Datei von der <a href="http://forum.snitz.com/specs.asp" target"_blank">Downloadseite</a>.
Entzippen Sie die Datei in ein Verzeichnis am Webserver. In diesem Verzeichnis befindet sich noch eine
Zip-Datei, die sich <i>tools.zip</i> nennt. Deren Inhalt entzippen Sie in das &quot;\tools&quot;-
Unterverzeichnis des von Ihnen gew&auml;hlten Forumverzeichnisses.
</p>

<p>
Nachdem Sie die Datei 
heruntergelanden haben, konfigurieren wir zuerst den IIS. Dort richten wir f&uuml;r das Forum eine
neue Website ein. Der Wizard nimmt uns dabei fast dia ganze Arbeit ab. In diesem Fall
m&uuml;ssen wir nur eine Beschreibung f&uuml;r die Website, eine IP-Adresse und den Pfad am Webserver, wo
sich die Dateien aus der entzippten Datei des Forums physikalisch befinden, angeben.
</p>

<p>
Das Finetunig dieser Website am IIS soll nicht Thema dieses Artikels sein, daher gehen wir zur 
Datenbankanbindung &uuml;ber.
</p>

<h3>Die MS Access Variante</h3>

<p>
Dieser Einrichtungsvorgang ist der einfachste und auch zeitm&auml;&szlig;ig schnellste, wenn auch in manchen
F&auml;llen nicht die beste Entscheidung. Besonders bei schnell wachsenden Datenbanken, Sicherheit und
mehreren (gleichzeitigen) Clientzugriffen beweist der SQL Server seine St&auml;rken.
</p>

<p>
In diesem Fall m&uuml;ssen Sie nur die <i>config.asp</i> im Stammverzeichnis, wo sich die Dateien
des Forums befinden an die MS Access Datenbananbindung anpassen. Zuerst w&auml;hlen Sie Access
aus, indem Sie das einfache Hochkomma (') vor der Zeile
</p>

<pre style="background='silver';">
...
strDBType = "access"
...
</pre>

<p>
entfernen. Danach m&uuml;ssen Sie nur noch den Connection-String zur Dantenbank angeben. Dies geschieht durch 
Eintragen der Daten in der Zeile <i>strConnString</i>. Als Beispiel soll hier meine Konfiguration dienen 
(wieder einfaches Hochkomma entfernen):
</p>

<pre style="background='silver';">
...
strConnString = "Provider=Microsoft.Jet.OLEDB.4.0;
   Data Source=e:\forumAcc\tools\snitz_forums_2000.mdb;"
...
</pre>

<p>
That's it for MS Access! Bei der Einrichtung f&uuml;r MS SQL Server sind allerdings ein paar Schritte mehr
notwendig.
</p>

<h3>Die SQL Server Variante</h3>

<p>
Uns steht nur eine MDB-Datei zur Verf&uuml;gung. Da wir die Datei mit Arbeitsgruppeninfromationen
nicht haben ist Essig mit der (einfachen) Konvertierung der MDB-Datei (Security Problem). Mit dem 
<i>Data Transformation Services Import/Export Wizard</i> ist dies aber nicht weiter tragisch.
Ich liefere Ihnen nun eine kleine Anleitung in vielen bunten Bildern (just kiddin').
</p>

<p>
Im ge&ouml;ffneten <i>Enterprise Manager</i> klicken Sie auf <i>Databases</i> und w&auml;hlen im Kontextmen&uuml;
<i>All Tasks | Import Data ...</i> (siehe Screenshot). 
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_1.png" width="413" height="186" alt="" border="0">

<p>
Nun erscheint der gew&uuml;nschte Wizard und mit <i>Next</i> gelangen wir auf die n&auml;chste Seite.
Dort w&auml;hlen wir den Treiber bei <i>Data Source</i> aus, geben den DSN und als
Usernamen <i>Admin</i> sowie das Pa&szlig;wort <i>admin</i> ein. Dieses Pa&szlig;wort ist standardm&auml;&szlig;ig
vorhanden und kann nat&uuml;rlich ge&auml;ndert werden. Der n&auml;chste Screenshot zeigt das ausgef&uuml;llte Wizard-
Formular
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_2.png" width="502" height="389" alt="" border="0">

<p>
Wo kommt der DSN allerdings her? Ich habe ihn selbst erstellt, und zwar mit Hilfe des SQL Server.
Die Erstellung eines neuen DSNs mittels des SQL Servers ist in 3 Schritten (Bildern) schnell erkl&auml;rt.
Klicken Sie zuerst auf den <i>New</i> Button. Danach erhalten Sie folgende Dialogbox:
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_3.png" width="463" height="343" alt="" border="0">

<p>
Hier w&auml;hlen wir den DSN Typ aus. Am n&auml;chsten Screen w&auml;hlen wir den Access Treiber aus:
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_4.png" width="467" height="343" alt="" border="0">

<p>
Um die DSN Erstellung abzuschlie&szlig;en, geben wir noch den Namen (<i>SnitzerForum</i>) und die Beschreibung
(<i>Snitzer Forum DB</i>) an, und best&auml;tigen mit OK:
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_5.png" width="467" height="312" alt="" border="0">

<p>
Nun sind wir wieder zur&uuml;ck im Import Wizard, und k&ouml;nnen mit <i>Next</i> weitermachen.
Am n&auml;chsten Screen sehen wir die Zieleinstellungen des Imports: Die neue Datenbankart, den Server wo sich die
Datenbank dann befinden soll, und die Login Informationen:
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_6.png" width="503" height="395" alt="" border="0">

<p>
Da wir ja eine neue Datenbank erzeugen wollen, w&auml;hlen wir im Dropdownmen&uuml; <i>Database</i> 
&quot;&lt;new&gt;&quot; aus. Wir m&uuml;ssen nun einen Namen f&uuml;r die Datenbank eingeben und ihre Gr&ouml;&szlig;e bestimmen
(n&auml;chster Screenshot):
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_7.png" width="282" height="208" alt="" border="0">

<p>
Im letzten Schritt des Import Wizards w&auml;hlen wir "Copy tables and views", und best&auml;tigen
alles mit Next.
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_8.png" width="503" height="388" alt="" border="0">

<p>
Und that's it - die Access Datenbank ist konvertiert.
</p>

<p>
Wie bei der Konfiguration f&uuml;r Access m&uuml;ssen wir in <i>config.asp</i> Datei in der
Zeile
</p>

<pre style="background='silver';">
strDBType = "sqlserver"
</pre>

<p>
das davorstehende einfache Hochkomma (') entfernen. Der Connection-String mu&szlig; nat&uuml;rlich 
auch noch angepa&szlig;t werden. Ein typisches Beispiel ist folgender Eintrag:
</p>

<pre style="background='silver';">
...
strConnString = "driver={SQL Server};server=localhost;uid=Admin;pwd=admin;database=SnitzerForum"
...
</pre>

<p>
Wieder Hochkomma vor der Zeile entfernen, die Datei speichern - fertig. 
</p>

<h2>Letzte Schritte</h2>
<p>
Nun m&uuml;ssen wir noch die <i>setup.asp</i> Datei mit dem Browser &ouml;ffnen. Wenn alles richtig 
konfiguriert wurde, sehen Sie dann diesen Screen:
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_9.png" width="444" height="584" alt="" border="0">

<p>
Im Forum sieht es dann bereits sehr komfortabel aus: 
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_10.png" width="640" height="633" alt="" border="0">

<p>
Der folgende Screenshot zeigt, da&szlig; es alles gibt, was man zum Administrieren und Beitrag
posten braucht. Und sollte etwas unklar sein - ToolTips sind &uuml;berall zu finden.
</p>

<IMG SRC="/artikel/Bilder/200102/20010201_11.png" width="475" height="405" alt="" border="0">

<h2>Schlu&szlig;bemerkung</h2>

<p>
Mit diesem Artikel hoffe ich Ihnen das &quot;Snitz Forums 2000&quot; ein wenig n&auml;hergebracht 
zu haben. Es ist eine Freeware die leicht zu konfigurieren ist, professionelle Funktionen bietet und
auch in den Systemvoraussetzungen flexibel ist. Die User Interfaces sind intuitiv und daher leicht
beherrschbar.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010207.htm">ASPForums 2.1 installieren und anpassen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010207.htm</span><br>
<a href="../artikel/19990826.htm">ODBC und ASP - Eine DSN zur Verwendung mit ASP definieren</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/19990826.htm</span><br>
<a href="../artikel/20020502.htm">Yet Another Forums Software</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020502.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fforum%2Esnitz%2Ecom%2F">Snitz Forum 2000</a><br>
<SPAN class="content">http://forum.snitz.com/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
