<HTML>
<HEAD>
<TITLE>Broken Links mit Link Sleuth erfassen</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="URLs auf eigenen oder fremden Sites k&ouml;nnen mit der Zeit durch Content&auml;nderung oder Restrukturierung der Site ung&uuml;ltig werden. Mit Link Sleuth kommen Sie diesen auf die Schliche.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,URL-Check,Überprüfung,Link Sleuth,404,Linktracking">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Broken Links mit Link Sleuth erfassen</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/Server.htm">Server</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20010518"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
URLs auf eigenen oder fremden Sites k&ouml;nnen mit der Zeit durch Content&auml;nderung oder Restrukturierung der Site ung&uuml;ltig 
werden. Dann erh&auml;lt man beim Anklicken meist den 404 Fehler. Da&szlig; das &Uuml;berpr&uuml;fen der einzelnen Links bei 
umfangreichen Websites eine unn&ouml;tige Tortur ist, brauche ich Ihnen nicht zu beweisen. Daf&uuml;r gibt es spider&auml;hnliche 
Software, die solche Aufgaben per Konpfdruck und ohne viel m&uuml;hsames Zutun erledigen. Da man nach der &Uuml;berpr&uuml;fung 
(meist) einen &uuml;bersichtlichen Report erh&auml;lt, gestaltet sich das Aufsp&uuml;ren solcher fehlerhaften Links als Kinderspiel.
Eine solche Applikation ist Xenu's Link Sleuth - und diese ist kostenlos.
</p>

<p>
Unter den vielen Angeboten von Broken-Links Reportern befinden sich auch einige, die kostenlos sind. Eines davon -
<a href="http://home.snafu.de/tilman/xenulink.html" target="_blank"><i>Xenu's Link Sleuth</i></a> - ist nicht nur kostenlos 
erh&auml;ltlich, sondern auch funktionell und flott bei der Arbeit. Die Einarbeitungszeit ist, obwohl eine Dokumentation
bis dato fehlt, relativ kurz, da die Men&uuml;f&uuml;hrung fast selbsterkl&auml;rend ist.
</p>

<p>
Link Sleuth l&auml;&szlig;t sich leicht konfigurieren, l&auml;uft auf jeder Windows Plattform, unterst&uuml;tzt SSL verschl&uuml;sselte Seiten, 
ist unter gewissen Einschr&auml;nkungen auch f&uuml;r FTPs und Gopher Seiten geeignet, erkennt auch Redirects und man hat die 
M&ouml;glichkeit als broken Links markierte URLs sp&auml;ter noch einmal zu &uuml;berpr&uuml;fen, ohne die gesamte Seite 
noch einmal testen zu m&uuml;ssen.
</p>

<p>
Auch bei der Art der &Uuml;berpr&uuml;fung k&ouml;nnen Einstellungen getroffen werden. Zum Beispiel k&ouml;nnen Sie bestimmte Unterseiten 
aus dem Check ausschlie&szlig;en, oder auch Intranetseiten oder nur bestimmte Webunterverzeichnisse &uuml;berpr&uuml;fen lassen.
</p>

<p>
Am Ende jeder &Uuml;berpr&uuml;fung kann man einen Report erstellen lassen, der im Html Format erstellt wird. Dieser Report
ist &uuml;bersichtlich in einzelne Kategorien unterteilt, und es besteht auch die M&ouml;glichkeit den Report nach Beendigung 
des Checks per Email zu verschicken. Dadurch da&szlig; die Applikation multithreaded ist, k&ouml;nnen Sie 
mehrere Websites auf einmal effizient testen. Je nach gesetztem Threadcount geht dies auch zackig. 
</p>

<p>
Der Zweck des heutigen Artikels besteht darin, Ihnen eine kurze Anleitung f&uuml;r Link Sleuth zu geben.
Beginnen wir mit der Installation. Nach dem <a href="http://home.snafu.de/tilman/xenulink.html" target="_blank">Download</a>
extrahieren Sie das Zip-Archiv in ein beliebiges Verzeichnis. Danach starten Sie das Programm, indem Sie entweder auf
den vorher erstellten Shortcut zur <b>xenu.exe</b> Datei doppelklicken oder es direkt mit der Executable starten.
</p>

<p>
In Link Sleuth wollen wir uns nun als erstes das Konfigurationsmen&uuml; ansehen, welches wir &uuml;ber <i>Options</i> und 
dann <i>Preferences</i> erreichen:
</p>

<IMG SRC="/artikel/Bilder/200105/20010518_1.png" width="222" height="374" alt="" border="0">

<p>
Dort lassen sich dann per Schieberegler die Threads einstellen, welche gleichzeitig f&uuml;r dieses Programm erlaubt sind. Zus&auml;tzlich
k&ouml;nnen
auch einige Voreinstellungen f&uuml;r den nach dem Check zu erstellenden Report getroffen werden. Die Einstellungen
best&auml;tigen wir mit <i>OK</i> - und nun k&ouml;nnen wir mit dem Linkcheck beginnen.
</p>

<p>
Hierf&uuml;r klicken Sie einfach auf den <IMG SRC="/artikel/Bilder/200105/20010518_2.png" width="23" height="20" alt="" border="0"> Button oder
navigieren im Men&uuml; <i>File</i> auf <i>Check URL</i>. Sogleich &ouml;ffnet sich das Dialogfenster in dem Sie die
n&ouml;tigen Angaben und Einstellungen f&uuml;r den Check angeben m&uuml;ssen:
</p>

<IMG SRC="/artikel/Bilder/200105/20010518_3.png" width="356" height="442" alt="" border="0">

<p>
Zuerst geben wir wie im Screenshot gezeigt den URL der Site an, welche &uuml;berpr&uuml;ft werden soll. Bei dieser Angabe haben 
Sie mehrere M&ouml;glichkeiten:
</p>

<ul>
<li>Gesamte Site &uuml;berpr&uuml;fen: http://www.yourdomain.com</li>
<li>Nur spezielles Webseitenunterverzeichnis: http://www.yourdomain.com/sales2k/ - wichtig dabei ist die Angabe 
des Forwardslashes (/) nach dem Unterverzeichnis, da man sonst einen Backlash erh&auml;lt, der sich in der Erfassung
der gesamten Struktur &auml;u&szlig;ert.</li>
<li>Mit <i>Browse</i> k&ouml;nnen Sie lokale Seiten &uuml;berpr&uuml;fen, die sich z.B. noch in der Entwicklung befinden</li>
</ul>

<p>
Zus&auml;tzlich k&ouml;nnen Sie noch einige Erweiterungen bzw. Einschr&auml;nkungen treffen. Bei dem Eintrag "Consider these URLs
as internal" k&ouml;nnen Sie Intranetseiten angeben. URLs die bei "Do not check with these URLs" eingetragen sind, werden 
nicht &uuml;berpr&uuml;ft. Der <i>More Options</i> Button &ouml;ffnet das bereits oben beschriebene Konfigurationsmen&uuml;.
</p>

<p>
Mit dem <i>email</i> Button k&ouml;nnen Sie den erstellten Report bequem per Email auch an mehrere Empf&auml;nger verschicken:
</p>

<IMG SRC="/artikel/Bilder/200105/20010518_4.png" width="333" height="258" alt="" border="0">

<p>
Nachdem alle notwendigen Angaben getroffen worden sind, wird der Linkcheck mit <i>OK</i> gestartet. 
Schon im Applikationsfenster kann man mitverfolgen, welche Links in Ordnung (gr&uuml;n) und welche fehlerhaft sind (rot).
Bei gro&szlig;z&uuml;gig eingestellter parallelen Threadzahl k&ouml;nnen Sie nun zus&auml;tzlich weitere Webseiten &uuml;berpr&uuml;fen lassen.
</p>

<p>
Sobald der Check fertig ist, erhalten Sie die Meldung ob nun lokal ein Html formatierter Bericht erstellt werden soll:
</p>

<IMG SRC="/artikel/Bilder/200105/20010518_5.png" width="590" height="337" alt="" border="0">

<p>
Dieser wird dann aus den gewonnenen Informationen erstellt und tempor&auml;r im Verzeichnis 
<i>LW:\Documents and Settings\%Username%\Local Settings\Temp\</i> abgelegt, oder, wenn angegeben, per Email 
an die Empf&auml;nger verschickt:
</p>

<IMG SRC="/artikel/Bilder/200105/20010518_6.png" width="569" height="538" alt="" border="0">

<p>
Der Report ist ordentlich nach Kategorien strukturiert und gibt daher schnell Aufschlu&szlig; auf fehlerhafte Links.
</p>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Der Link Sleuth &uuml;berzeugt durch die einfache Konfiguration und Geschwindigkeit. Sie haben viele
Einstellungsm&ouml;glichkeiten, die es z.B. erm&ouml;glichen umfangreiche &Uuml;berpr&uuml;fungskriterien zu erstellen. 
Die Reports sind schlicht aber 
ausreichend und auch f&uuml;r umfangreiche Sites wegen der einstellbaren Strukturierung zu gebrauchen. Alles in allem
eine sehr gute Alternative zu kostenpflichtigen Applikationen.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20030428.htm">Mailadressen sch&uuml;tzen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20030428.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fhome%2Esnafu%2Ede%2Ftilman%2Fxenulink%2Ehtml">Link Sleuth</a><br>
<SPAN class="content">http://home.snafu.de/tilman/xenulink.html</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
