<HTML>
<HEAD>
<TITLE>XTune Revisited</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Mit XTune wird das Einstellen von Performance-relevanten Parametern des Webserver und einzelner Websites erheblich erleichtert. Vor mehr als einem Jahr haben wir uns auf AspHeute bereits einmal mit dem XTune Tool besch&auml;ftigt...">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Xtune,Performance,Tuning,Einstellungen,Optimierung,Speed,Parameter">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>XTune Revisited</H1>
<p>
Geschrieben von: <a href="../autoren/christophwille.htm">Christoph Wille</a><br>
Kategorie: <a href="../kategorien/Optimierung.htm">Optimierung</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20011002"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Mit XTune wird das Einstellen von Performance-relevanten Parametern des Webserver und einzelner 
Websites erheblich erleichtert.
Vor mehr als einem Jahr haben wir uns auf AspHeute bereits einmal mit dem XTune Tool besch&auml;ftigt,
im Artikel <a href="../artikel/20000814.htm">Webserver-Tuning mit XTune</a>. Damals war es
die Version 1.0, heute werden wir uns die neu herausgegebene Version 2.0 ansehen.
</p>
<p>
Was also bringt <a href="http://www.xcache.com/home/xtune_xtune_overview.htm" target="_blank">Version 2.0</a> Neues?
Nun, zun&auml;chst einmal die schlechte Nachricht: XTune ist nicht mehr gratis. Das neue User Interface
und die folgenden Features sollten aber die Firmenanwender freuen, und den Schmerz des Preises
deutlich lindern:
</p>

<ul>
    <li>Mehr Performance Parameter k&ouml;nnen eingestellt werden (ungef&auml;hr doppelt so viele als in 
    Version 1.0)
    <li>COM Objekte erlauben das direkte Programmieren der Performanceeinstellungen. Wer also
    lieber ein Script schreibt, um den Server zu tunen, ist mit der neuen Version sicherlich gut bedient.
    <li>Backup und Restore: Performanceeinstellungen eines Servers / einer Site k&ouml;nnen zwischen Maschinen
    und Sites &uuml;bernommen werden (als "normales" Backup funktioniert es klarerweise auch).
    <li>Wizards: mit Absicht als letztes Feature gereiht, weil Administratoren eher wenig Freude damit
    haben - allerdings sind die Wizards von XTune keineswegs zu verachten.
</ul>

<p>
Man m&ouml;ge es mir im heutigen Artikel verzeihen, da&szlig; ich nicht auf die scriptm&auml;&szlig;ige Programmierung
der Performanceeinstellungen mittels XTune eingehe. Ich werde mich mit den M&ouml;glichkeiten des User
Interfaces befassen. &Uuml;brigens, wer mehr &uuml;ber die getunten Parameter lernen will, kann entweder im
Artikel <a href="../artikel/20000814.htm">Webserver-Tuning mit XTune</a> nachlesen, oder
f&uuml;r dort nicht aufgef&uuml;hrte (weil neue) Parameter in der Hilfe von XTune Nachschau halten (oder bei
den am Ende dieses Artikels aufgef&uuml;hrten Websites).
</p>

<h2>Ein Rundgang im User Interface</h2>
<p>
Nach der Installation hat man einen neuen Folder im Startmen&uuml;, und dort findet sich neben der Hilfe
der <i>XTune Manager</i>. Nach dem Start glaubt man sich in der normalen ISM wiederzufinden:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_1.png" width="591" height="335" alt="" border="0">

<p>
Dem ist auch fast so, nur mit dem Unterschied, da&szlig; es sich um eine mit XTune Features erweiterte ISM
handelt. Ein Blick auf die Eigenschaften des Web Server enth&uuml;llt die neuen XTune Features f&uuml;r das
Tuning des Webservers:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_2.png" width="404" height="468" alt="" border="0">

<p>
Wer sich die Screenshots in <a href="../artikel/20000814.htm">Webserver-Tuning mit XTune</a> 
ansieht, wird merken, da&szlig; sich hier einiges getan hat. Aus der Liste der m&ouml;glichen Tuningparameter
habe ich mir  die Caching Features herausgepickt:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_3.png" width="354" height="422" alt="" border="0">

<p>
Wer viel statischen Content served, kann hier so richtig Performance schinden. Und "normale"
Entwickler von Komponenten finden hier auch ein Goodilie: <i>Cache Type Libraries</i>. Diese
Einstellung ist der Grund, warum bei der Komponentenentwicklung sich der IIS so unnachgiebig
gegen das &Uuml;berschreiben einer DLL wehrt - sie ist aus Performancegr&uuml;nden gecacht.
</p>

<p>
Von den Webserver-Tuningm&ouml;glichkeiten nun zu den Sites. Auch hier gibt es den zus&auml;tzlichen XTune
Tab:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_4.png" width="464" height="487" alt="" border="0">

<p>
Hier kann man dann so richtig an den Einstellungen einer Site basteln. Sowohl die Dokumentation
als auch der Artikel <a href="../artikel/20000814.htm">Webserver-Tuning mit XTune</a> geben Aufschlu&szlig; welcher 
Parameter was bewirkt - so auch f&uuml;r die ASP Einstellungen:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_5.png" width="354" height="513" alt="" border="0">

<h2>Wozu die Wizards?</h2>
<p>
Nun, nach dieser kleinen Tour durch das User Interface wird klar, da&szlig; es sich dabei um etliche
sehr wichtige Einstellungen handelt, mit denen man in Ber&uuml;hrung kommt. Also warum nicht die Web
Site automatisch optimieren lassen? Genau daf&uuml;r sind die Wizards gedacht.
</p>
<p>
Es gibt zwei Wizards - einen f&uuml;r die Optimierung des Web Servers, und einen f&uuml;r die Optimierung der Web Sites. Beide
sind mittels All Tasks / XTune Wizard aufzurufen. Ich werde jetzt den Web Site Tuning Wizard
kurz vorf&uuml;hren, der Wizard des Web Servers funktioniert sehr &auml;hnlich.
</p>
<p>
Der erste Schritt ist wie immer ein kleiner Begr&uuml;&szlig;ungsbildschirm, den wir ignorieren (pardon,
ich wollte "aufmerksam durchlesen" schreiben). Danach wird man dankenswerterweise gefragt, ob man
die aktuellen Einstellungen nicht vielleicht sichern ("Backup") m&ouml;chte. Dringende Empfehlung: ja,
sichern. Weil geht bei der Optimierung etwas schief, kann man immer wieder zum voherigen
Zustand zur&uuml;ckkehren.
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_6.png" width="503" height="386" alt="" border="0">

<p>
Danach folgen einige (Achtung: Untertreibung) Fragen, unter anderem, ob man nicht In-Process 
statt Pooled fahren m&ouml;chte:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_7.png" width="503" height="386" alt="" border="0">

<p>
Es folgt ein Scan nach Dateien in den Foldern der Website. Sinn und Zweck ist es herauszufinden,
welche Script Mappings &uuml;berhaupt verwendet werden. Hier wird man wieder gefragt, ob man die 
Empfehlung annehmen will:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_8.png" width="503" height="386" alt="" border="0">

<p>
Man wird &uuml;ber jedes Script Mapping gefragt. Man sollte sich die Zeit daf&uuml;r nehmen, und nicht
blindlings einfach Next klicken. Auf einem Rechner mit ASP.NET kann das schon eine l&auml;ngere
Liste an Script Mappings werden.
</p>

<p>
Dann geht's an den Session State, der wenn abgeschaltet, auch Performance bringt:
</p>

<IMG SRC="/artikel/Bilder/200110/20011002_9.png" width="503" height="386" alt="" border="0">

<p>
Weiter geht es mit Abfragen zum Abschalten von NTLM Authentifizierung, dem AspQueueTimeout
und vielen weiteren Performance-verbessernden Vorschl&auml;gen. Das Sch&ouml;ne an diesem Wizard ist,
da&szlig; jeder Vorschlag mit dem technischen Hintergrund begr&uuml;ndet wird, man sich also vorher nicht
unbedingt durch seitenweise Tuningartikel durchlesen mu&szlig;. Eine Zeitersparnis auch f&uuml;r den
erfahrenen Administrator.
</p>

<h2>Backup und Restore</h2>
<p>
Die von XTune vorgenommenen Performanceeinstellungen k&ouml;nnen mit dem XTune Manager gesichert und
auch r&uuml;ckgesichert werden. Die Sicherungsdatei ist eine XML Datei, man kann also jederzeit
h&auml;ndisch dort &Auml;nderungen vornehmen. Hier ein verk&uuml;rzter Blick auf so eine Sicherungsdatei:
</p>

<pre style="background='silver';">
&lt;?xml version="1.0" encoding="windows-1252"?&gt;
&lt;XTUNE  xmlns:dt="urn:schemas-microsoft-com:datatypes"&gt;
  &lt;VERSION&gt;2.0.5721.4&lt;/VERSION&gt;
  &lt;XMLVERSION&gt;1&lt;/XMLVERSION&gt;
  &lt;DATE&gt;Mon Oct 01 20:50:30 2001&lt;/DATE&gt;
  &lt;WEBSITEDATA&gt;
    &lt;SYSTEMINFO&gt;
      &lt;COMPUTER&gt;sleeper&lt;/COMPUTER&gt;
      &lt;WEBSITE&gt;5&lt;/WEBSITE&gt;
      &lt;SYSTEMVERSION&gt;2&lt;/SYSTEMVERSION&gt;
      &lt;PROCESSORCOUNT&gt;1&lt;/PROCESSORCOUNT&gt;
    &lt;/SYSTEMINFO&gt;
    &lt;ASPPROCESSORTHREADMAX xtType="18" dt:dt="number"&gt;25&lt;/ASPPROCESSORTHREADMAX&gt;
    &lt;ASPENABLECHUNKEDENCODING xtType="19" dt:dt="number"&gt;1&lt;/ASPENABLECHUNKEDENCODING&gt;
    &lt;ASPTHREADGATEENABLED xtType="20" dt:dt="number"&gt;0&lt;/ASPTHREADGATEENABLED&gt;
        ...
    &lt;SCRIPTMAPS xtType="17"&gt;
      &lt;SCRIPTMAPPING mapID="0"&gt;
        &lt;EXTENSION smType="2"&gt;.htw&lt;/EXTENSION&gt;
        &lt;ORIGINAL smType="1"&gt;.htw,F:\WINNT\System32\webhits.dll,3,GET,HEAD,POST&lt;/ORIGINAL&gt;
        &lt;ASPMAPPING smType="3" dt:dt="number"&gt;0&lt;/ASPMAPPING&gt;
      &lt;/SCRIPTMAPPING&gt;
        ...
    &lt;/SCRIPTMAPS&gt;
  &lt;/WEBSITEDATA&gt;
&lt;/XTUNE&gt;
</pre>

<p>
H&auml;ndischen &Auml;nderungen steht also nichts im Wege, bevor man das Backup wieder restored.
Neben dem normalen Aspekt einer Sicherungskopie ist gerade das einfache deployen von Performanceeinstellungen
auf mehrere Maschinen ein sehr guter Grund f&uuml;r die Verwendung von XTune - es erspart Arbeit.
</p>


<h2>Schlu&szlig;bemerkung</h2>
<p>
Die schlechte Nachricht des heutigen Artikels ist, da&szlig; ein weiteres gutes Tool ab sofort nur noch
gegen gutes Geld zu haben ist. Was man f&uuml;r sein Geld bekommt, rechnet sich aber f&uuml;r einen (oder
speziell mehrere) Produktionsserver definitiv: einfachstes Performancetuning mit der Option die
Tuninginformation auf mehrere Maschinen und Sites anzuwenden.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20011008.htm">Output Caching 101</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20011008.htm</span><br>
<a href="../artikel/20020731.htm">Trafficreduzierung mit XCompress</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020731.htm</span><br>
<a href="../artikel/20030911.htm">Virtuelle Verzeichnisse umbenennen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20030911.htm</span><br>
<a href="../artikel/20000814.htm">Webserver-Tuning mit XTune</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000814.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emicrosoft%2Ecom%2FTechNet%2Fiis%2Fiis5tune%2Easp">The Art and Science of Web Server Tuning with Internet Information Services 5.0</a><br>
<SPAN class="content">http://www.microsoft.com/TechNet/iis/iis5tune.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Excache%2Ecom%2Fhome%2Fxtune%5Fxtune%5Foverview%2Ehtm">Xtune 2.0 Overview</a><br>
<SPAN class="content">http://www.xcache.com/home/xtune_xtune_overview.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
