<HTML>
<HEAD>
<TITLE>Das TableEditor Datenbank Administrationstool</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Eine Datenbank mittels ASP zu administiereren ist sehr aufwendig und erfordert einiges an Programmierarbeit. Als eine Abhilfem&ouml;glichkeit hierf&uuml;r stellt Ihnen der heutige Artikel das TableEditor Administrations Tool vor.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,TableEditor,Tool,Administration,Datenbankwartung,Datenbankadministration,Remoteadministration,Remote administration,Fernwartung">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Das TableEditor Datenbank Administrationstool</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/Datenbank.htm">Datenbank</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20010418"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Eine Datenbank mittels ASP zu administiereren ist sehr aufwendig und erfordert einiges an Programmierarbeit.
Als eine Abhilfem&ouml;glichkeit hierf&uuml;r stellt Ihnen der heutige Artikel das TableEditor Administrations Tool vor. Mit diesem k&ouml;nnen Sie Datenbankbenutzer verwalten,
vorhandene Tabellen, Abfragen, Stored Procedures einer Datenbank einsehen und Datenbankoperationen t&auml;tigen. Zus&auml;tzlich k&ouml;nnen
Sie innerhalb des Tools SQL Statements ausf&uuml;hren. Ein weiteres Plus ist, da&szlig; dieses Tool kostenlos downloadbar ist.
</p>

<p>
Das <i>TableEditor</i> Datenbank Administrations Tool k&ouml;nnen Sie <a href="http://www.2enetworx.com/dev/projects/tableeditor.asp" target="_blank">hier</a>
nach einer Registrierung von der <a href="http://www.2enetworx.com/dev" target="_blank">2enetworx.com</a> Website kostenlos downloaden.
Das in ASP geschriebene Tool unterliegt der General Public License (GPL). Der Vorteil? Man kann es auf jeden Webserver
uploaden, und zus&auml;tzlich kann man vom Sourcecode einiges lernen!
</p>

<p>
Nach dem Download und dem Entpacken des Zip-Archives in eine zuvor erstellte Web Site beginnen wir mit dem Einloggen.
Dies erfolgt &uuml;ber das Aufrufen der <b>index.asp</b> Datei. Ausgehend von dieser Seite werde ich Ihnen heute
die verschiedenen Features des TableEditors n&auml;her bringen.
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_1.png" width="483" height="432" alt="" border="0">

<p>
Das voreingestellte Konto mit Administratorrechten besitzt den Usernamen <i>admin</i> und das Pa&szlig;wort <i>admin</i>
(<i>case sensitiv!</i>). 
Dieses Konto ist dann im mission-critical Einsatz des Tools nat&uuml;rlich zu &auml;ndern. Die Benutzerkonten werden &uuml;ber eine MS Access
Datenbank verwaltet, die entweder mit Access selbst oder bequemer innerhalb des Tools bearbeitet werden k&ouml;nnen.
</p>

<p>
Nach erfolgreichem Login haben Sie die Auswahl die Benutzerkonten zu verwalten, eine Datenbank mittels der voreingestellten
Verbindungsoptionen auszuw&auml;hlen oder sich einfach das Schema (Auflistung der System- und Benutzertabellen sowie
der Views (Ansichten der Tables durch definierte Filterungen)) der Datenbank anzeigen zu lassen. Besch&auml;ftigen wir uns aber
vorerst mit der Benutzerkontenverwaltung. Hierf&uuml;r klicken Sie auf <i>Administer Table Editor Users</i> Link. 
Sie erhalten nun folgendes Interface:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_3.png" width="553" height="433" alt="" border="0">

<p>
Standardm&auml;&szlig;ig ist das Administratorkonto (Username <i>admin</i>) und ein (Gast-) Benutzerkonto (Username <i>guest</i>)
eingerichtet. Sie k&ouml;nnen hier die Zugriffsrechte mittels Checkboxen zuweisen, oder mit dem <i>Add Record</i> Link ein
Konto hinzuf&uuml;gen.
</p>

<p>
Die obere Linkleiste dient der Navigation und zeigt immer die aktuelle Position. Durch einen Klick auf den <i>Connections</i>
Link gelangen Sie wieder eine Ebene hinauf, wo wir, wie vorher schon erw&auml;hnt eine Datenbank ausw&auml;hlen k&ouml;nnen:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_2.png" width="486" height="432" alt="" border="0">

<p>
F&uuml;r diesen Artikel habe ich die Northwind Datenbank herangezogen. Um diese f&uuml;r den Table Editor zugreifbar zu machen, ist in
der <b>te_config.asp</b> Datei, welche sich im Rootverzeichnis der Web Site befindet, beim Abschnitt 
<i>Define database locations</i> folgendes f&uuml;r einen Datenbankzugriff f&uuml;r Testzwecke (User ID <i>sa</i>, kein Pa&szlig;wort) 
einzutragen:
</p>

<pre style="background='silver';">
'--[&raquo;]--- Define database locations -------------------------
'For SQL Server
arrDBs(2) = "northwind;bluescreen;sa; "
</pre>

<p>
Die Verbindungsdaten werden hier in einem Array gespeichert. Die Eingabereihenfolge der Informationen ist:
</p>

<pre style="background='silver';">
arrDBs(2) = "DatenbankName;ComputerName;BenutzerName;Pa&szlig;wort"
</pre>

<p>
Nach der Speicherung der &Auml;nderungen k&ouml;nnen wir daher auch auf den Link <i>SQL Server - Northwind</i>
klicken oder uns durch Klicken auf den <i>Schema</i> Link uns das Schema der Datenbank ansehen. Wir wollen aber auch 
u.a. &Auml;nderungen in der Datenbank vornehmen. Daher klicken wir auf ersteres und erhalten folgende Ansicht:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_4.png" width="552" height="530" alt="" border="0">

<p>
Unter dem Punkt <i>Tables</i> kann man entweder einen neuen Table erstellen (<i>Create a new Table</i>) oder einen vorhandenen
bearbeiten. Bei vorhandenen Tables k&ouml;nnen Sie durch Anklicken auf den Tablenamen den Inhalt anzeigen, mit <i>search</i>
innerhalb der Felder des Tables nach Datens&auml;tzen suchen oder mittels <i>edit</i> die Struktur des Tables ver&auml;ndern.
<i>Remove</i> bedeuted logischerweise die L&ouml;schung des Tables, die nach einer Sicherheitsabfrage durchgef&uuml;hrt wird.
</p>

<p>
Um Datens&auml;tze einem Table hinzuzuf&uuml;gen klicken Sie also auf den Tablenamen. Sie erhalten nun eine &Uuml;bersicht &uuml;ber die
gesamten Datens&auml;tze:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_5.png" width="553" height="532" alt="" border="0">

<p>
Die Navigation durch mehrseitige Datens&auml;tze bzw. Ansichten erfolgt einfach &uuml;ber die entsprechend der Richtung (<i>previous</i>, <i>next</i>)
angegebenen Links. Zus&auml;tzlich k&ouml;nnen Sie an den Anfang der Tabelle mit <i>first</i> oder mit <i>last</i> zum Ende springen.
Als Information wird auch die Anzahl der Seiten angezeigt. Die Anzahl der darzustellenden Datens&auml;tze pro Seite k&ouml;nnen
Sie in der <b>te_config.asp</b> Datei nach dem Kommentar <i>How many records in a page?</i> als Konstante bestimmen:
</p>

<pre style="background='silver';">
const cPerPage = 10
</pre>

<p>
Durch Klicken auf <i>Add Record</i> erhalten Sie dann eine - je nach Tablestruktur angepa&szlig;te - Eingabemaske f&uuml;r den
neuen Datensatz. Nat&uuml;rlich k&ouml;nnen Sie auch einen vorhandenen Datensatz &auml;ndern. Hierf&uuml;r klicken Sie auf das Edit
Symbol (Textdokumentsymbol) vor dem zu &auml;ndernden Datensatz und Sie 
erhalten die Daten des gew&auml;hlten Datensatzes:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_7.png" width="553" height="531" alt="" border="0">

<p>
Beim Punkt <i>Queries</i> k&ouml;nnen Sie entweder eine neue Abfrage erstellen (<i>Create new query</i>) oder durch Klicken auf 
den Abfragenamen eine Query ausf&uuml;hren. Beim Ausf&uuml;hren einer Query erhalten Sie dann die entsprechenden Datens&auml;tze die Sie wiederum bearbeiten 
oder auch l&ouml;schen k&ouml;nnen.
</p>

<p>
Um eine neue Abfrage zu erstellen klicken Sie auf <i>Create new query</i>. Danach m&uuml;ssen Sie den Abfragenamen sowie 
das SQL Statment bekannt geben und best&auml;tigen dann mit <i>Save</i>:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_8.png" width="551" height="393" alt="" border="0">

<p>
Wollen Sie eine Query direkt ausf&uuml;hren, aber nicht speichern so klicken Sie auf <i>Run a query</i>. Sie erhalten dann
folgendes Eingabefeld:
</p>

<IMG SRC="/artikel/Bilder/200104/20010418_9.png" width="549" height="351" alt="" border="0">

<p>
Sie m&uuml;ssen nun ein SQL Statement eingeben und danach die Abfrage mit <i>Execute</i> ausf&uuml;hren. Sie erhalten je nach 
SQL Statement die retour gelieferten Records.
</p>

<p>
Beim <i>Procedures</i> Abschnitt k&ouml;nnen Sie im Moment nur die vorhandenen Stored Procedures und ihre Eigenschaften 
(&Uuml;bergabeparamerter, Beschreibung) ablesen. Mehr geht in der aktuellen Betaversion noch nicht.
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
Diese Einf&uuml;hrung in das TableEditor Tool in vielen bunten Bildern sollte Ihnen die Einfachheit und vielen M&ouml;glichkeiten der 
Datenbankoperationen zeigen. Weiters gl&auml;nzt dieses Tool durch eine einfache Konfiguration bzw. Administration sowie durch
die Vielseitigkeit der verwendbaren Verbindungsoptionen - und obendrein ist das Tool kostenlos zu beziehen.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010522.htm">Die SQL2Table Komponente</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010522.htm</span><br>
<a href="../artikel/20020322.htm">Query Express f&uuml;r MSDE</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020322.htm</span><br>
<a href="../artikel/20020410.htm">Yet Another Access Database Administration Tool</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020410.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2E2enetworx%2Ecom%2Fdev">2enetworx.com</a><br>
<SPAN class="content">http://www.2enetworx.com/dev</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2E2enetworx%2Ecom%2Fdev%2Fprojects%2Ftableeditor%2Easp">TableEditor Download</a><br>
<SPAN class="content">http://www.2enetworx.com/dev/projects/tableeditor.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ecostodia%2Ecom%2Fdev%2Fprojects%2Ftableeditor%2Easp">TableEditor Download (2)</a><br>
<SPAN class="content">http://www.costodia.com/dev/projects/tableeditor.asp</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
