<HTML>
<HEAD>
<TITLE>IIS, was machst du gerade?</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Sicher wollten Sie schon immer wissen, was so auf Ihrem Web Server l&auml;uft - und zwar genau jetzt. Zwar liefern IIS Tools ein wenig Information, aber so richtig ins Detail können Sie erst mit IIS Tracer gehen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,IISTracer,IIS Tracer,Logging,Auswertung,Sicherheit,aktive Requests,Installation,ISAPI,ISAPI Filter">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>IIS, was machst du gerade?</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/Server.htm">Server</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20011204"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Sicher wollten Sie schon immer wissen, was so auf Ihrem Web Server l&auml;uft - und zwar genau jetzt. Zwar liefern IIS Tools ein wenig Information,
aber so richtig ins Detail können Sie erst mit IIS Tracer gehen. Sie erhalten wichtige Informationen &uuml;ber Ihre 
Web Site(s), wie z.B. den State einer Web Site, aktive Client IP Adressen, die Anzahl der Requests und mehr.
Der IIS Tracer installiert sich als ISAPI Filter und kann bequemst &uuml;ber ein &uuml;bersichtliches Html Interface
konfiguriert werden.
</p>

<p>
Bevor Sie die sprichw&ouml;rtliche Katze im Sack kaufen, k&ouml;nnen Sie den IISTracer von 
<a href="http://www.pstruh.cz/help/iistrace/" target="_blank">http://www.pstruh.cz/help/iistrace/</a> downloaden und f&uuml;r 60 Tage 
unlimitiert testen. Die Installation gestaltet sich denkbar einfach. Nach dem Download einfach die <b>iistrace.exe</b> 
Datei ausf&uuml;hren und den Anweisungen am Bildschrim folgen.
</p>

<p>
Nach diesem Kopiervorgang gilt es den ISAPI Filter auf dem Web Server zu registrieren. Dazu navigieren Sie 
zu der neu erzeugten Programmgruppe im Programs Men&uuml; und klicken auf <i>IIS Tracer configuration</i>. Nun
&ouml;ffnet sich ein VBA Dialog in dem Sie den Filter auf dem Web Server registrieren k&ouml;nnen.
</p>

<p>
Zun&auml;chst verbinden Sie sich auf den jeweiligen Computer auf dem der Web Server l&auml;uft oder am einfachsten,
wenn Sie sich schon auf der Web Server Maschine befinden, tippen Sie einfach <i>localhost</i>. Nach Verbindung
mit dem Web Server &uuml;ber den <i>Connect</i> Button, k&ouml;nnen Sie nun den IIS Tracer (sprich: die DLL) registrieren, indem Sie
in der Sektion <i>ISAPI filter Installation</i> auf den Button <i>Install this DLL to IIS</i> klicken.
</p>

<p>
Nun soll aber nicht jeder Zugriff auf die IIS Tracer Daten haben - deshalb konfigurieren Sie eine Instanz des IIS
die f&uuml;r das Monitoring des Web Servers verwendet werden soll. Diese Einstellungen treffen Sie in der Sektion
<i>IIS Tracer main configuration</i>. Dort geben Sie den Teil der URL an, mit dem Sie das webbasierende
Interface erreichen wollen. Sie sollten hier aus Sicherheitsgr&uuml;nden auf jeden Fall einen anderen Eintrag als
<i>/IISTrace</i> verwenden.
</p>

<p>
Weiters geben Sie die IP-Adresse und die IIS-Instanz des Konfigurations-Skriptes an. Zus&auml;tzlich k&ouml;nnen Sie
die Konfigurationsseite mit einem Pa&szlig;wort sch&uuml;tzen, damit niemand sonst zu einfach herumpfuschen kann. Wenn dies alles 
geschehen ist, sollte das Dialogfenster so aussehen:
</p>

<IMG SRC="/artikel/Bilder/200112/20011204_1.png" width="366" height="461" alt="" border="0">

<p>
Den Erfolg sehen sie auch im <i>ISAPI Filters</i> Tab des ISMs f&uuml;r die Master Properties des Web Servers:
</p>

<IMG SRC="/artikel/Bilder/200112/20011204_2.png" width="455" height="342" alt="" border="0">

<p>
Bevor wir uns aber mit der erweiterten Konfiguration befassen, noch ein paar kleine Hinweise: Die Eingaben 
<i>Config script</i> und <i>Config password</i> sind <i>beide</i> case-sensitive und erfordern daher
die genaue Schreibweise (gro&szlig;/klein). Mit dem Pa&szlig;wort k&ouml;nnen Sie also die Configuration Settings vor unerlaubtem 
Zugriff sch&uuml;tzen. Dies geht aber nur solange, solange Ihnen beim Konfigurieren keiner &uuml;ber die Schulter sieht, da
das Pa&szlig;wort als clear-text im URL steht - also Vorsicht.
</p>

<p>
Nun k&ouml;nnen wir den IIS Tracer aufrufen, indem wir sein Html-Interface mit einem Browser &ouml;ffnen. Mit den
Einstellungen aus dem Screenshot, der den Konfigurations-Dialog zeigte, geben wir im Addressbar folgendes ein:
</p>

<pre style="background='silver';">
192.168.4.240/StrongName
</pre>

<p>
Kurze Zeit sp&auml;ter landen wir beim IIS Tracer Html Interface. Wir gehen gleich zur Configuration Sektion
und sehen dort eine F&uuml;lle von Einstellungen (nach Eingabe des Pa&szlig;wortes):
</p>

<IMG SRC="/artikel/Bilder/200112/20011204_3.png" width="590" height="435" alt="" border="0">

<p>
Angefangen von den Grundeinstellungen, die Sie nun auch hier &auml;ndern k&ouml;nnen, k&ouml;nnen Sie die Content length,
Method (GET, POST, etc.), Request State, Logging  Einstellungen, etc. mitloggen.
</p>

<p>
Die Auswertung bzw. Ansicht der aktuellen Tasks erfolgt dann durch Klick auf die <i>Select View</i>
Sektionen <i>Active - Active/Completed - All</i>:
</p>

<IMG SRC="/artikel/Bilder/200112/20011204_4.png" width="640" height="163" alt="" border="0">

<p>
Durch die genauen Aufschl&uuml;sselungs-Optionen in der URL Sektion lassen sich auch Attacken gegen den Web Server 
identifizieren, vorausgesetzt man wertet die Logs auch aus. Da Sie wahrscheinlich nicht immer einen Browser mit dem 
Log Window offen haben werden, k&ouml;nnen Sie die Eintr&auml;ge auch in ein Verzeichnis schreiben lassen. Damit
k&ouml;nnen Sie dann die Werte bequem in einer Gesamt&uuml;bersicht auswerten.
</p>

<p>
Der Komfort dieser Server&uuml;berwachung fordert auch einiges. Erstens ben&ouml;tigt der IIS Tracer &auml;hnlich wie der 
TaskManager zus&auml;tzliche Resourcen, die nach Einstellungen und geforderter Detailgenauigkeit variieren. Weiters
ist der IIS Tracer nicht gratis, sondern in zwei unterschiedlichen 
<a href="http://www.pstruh.cz/help/iistrace/" target="_blank">Lizenzm&ouml;glichkeiten</a> erh&auml;ltlich.
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
In der zur Zeit des Artikels erschienenen Version des IIS Traces hat sich dieses Tool als komfortabel und einfach zu 
bedienen erwiesen. Die Genauigkeit des Loggings kann je nach Resourcen des Web Servers angepa&szlig;t werden. Einzig
was zu bem&auml;ngeln ist, ist die Security. Da sensitive Daten und Einstellungen im Html Interface per Querystring &uuml;bergeben 
werden, kann man, wenn man das Programm kennt, diese leicht einsehen bzw. &auml;ndern.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20020412.htm">Der Microsoft Baseline Security Analyzer (MBSA) 1.0</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020412.htm</span><br>
<a href="../artikel/20040517.htm">Filesystem-Watcher leicht gemacht</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20040517.htm</span><br>
<a href="../artikel/20021030.htm">Logfiles auswerten mit Webalizer</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20021030.htm</span><br>
<a href="../artikel/20010502.htm">Logfiles mit Access auswerten</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010502.htm</span><br>
<a href="../artikel/20010504.htm">Script-basierte IIS Administration</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010504.htm</span><br>
<a href="../artikel/20020503.htm">Show me the source - Includes aufgel&ouml;st</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020503.htm</span><br>
<a href="../artikel/20010419.htm">Site&uuml;berwachung mit Scheduled Tasks</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010419.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Epstruh%2Ecz%2Fhelp%2Fiistrace%2F">IIS Tracer</a><br>
<SPAN class="content">http://www.pstruh.cz/help/iistrace/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
