<HTML>
<HEAD>
<TITLE>.NET My Services Sneak Peek</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Auf der PDC 2001 in Los Angeles wurde das erste Mal offiziell eine Testversion der .NET My Services vorgestellt. Die .NET MyServices sind XML-basierende Web Services, die in (naher) Zukunft f&uuml;r Enduser zur Verf&uuml;gung gestellt werden.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,XML,.NET My Services,DIME,SOAP,Web Services,PDC,Los Angeles,.NET Passport,.NET Alerts">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>.NET My Services Sneak Peek</H1>
<p>
Geschrieben von: <a href="../autoren/christianholm.htm">Christian Holm</a><br>
Kategorie: <a href="../kategorien/dotNET%20Allgemein.htm">.NET Allgemein</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20011029"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Auf der PDC 2001 in Los Angeles wurde das erste Mal offiziell eine Testversion der .NET My Services vorgestellt.
Die .NET MyServices sind XML-basierende Web Services, die in (naher) Zukunft f&uuml;r Enduser zur Verf&uuml;gung gestellt 
werden. Mit diesen soll das Informationsmanagement einer Person (oder Gruppe von Personen)
vereinfacht werden, und die Produktivit&auml;t gesteigert werden. Dieser Informationspool soll f&uuml;r alle
berechtigten User auf jedem Clientger&auml;t &uuml;berall verf&uuml;gbar sein. Was die .NET My Services
f&uuml;r Enduser bzw. Entwickler bedeuten, soll dieser Artikel &uuml;berblicksm&auml;&szlig;ig vorstellen.
</p>

<p>
Die .NET My Services (vormals Codename 'Hailstorm') sollten sp&auml;testens seit der 
<a href="http://msdn.microsoft.com/theshow/" target="_blank">.NET Show</a> "Introducing Hailstorm" ein Begriff sein. .NET My Services sind
auf XML Web Services basierende benutzerorientierte (Internet)Dienste. Auf der PDC (Professional Developers
Converence) 2001 in Los Angeles wurden die My Services erstmals mit zahlreichen Sessions in technischem Detail vorgestellt. Sehen wir uns 
nun die .NET My Services aus zwei verschiedenen Blickpunkten an - dem Client und dem Entwickler.
</p>

<h2>Aus der Sicht des Clients</h2>

<p>
Von au&szlig;en betrachtet sehen die neuen, einzelnen Services die im .NET My Services Projekt enthalten sind, eigentlich ganz 
praktisch aus. Anstatt Informationen wie Termine, Projekte, Email, etc. in verschiedenen Applikationen zu verwalten,
werden diese nun in einem einzigen Repository zentral verwaltet - und dieses Repository ist nur durch vom User autorisierte
Applikationen benutzbar (und hier ist der Grad genau definierbar). Dies geschieht, so auch
die Grundidee der My Services, egal wo: im B&uuml;ro, zu Hause oder unterwegs. Da es sich um XML basierende Daten handelt
die via SOAP verschickt werden, k&ouml;nnen diese auch an beliebigen Orten bzw. Ger&auml;ten (z.B PC, PDA, Tablet PC) 
eingesehen werden - und die Informationen sind immer am aktuellen Stand. Und je nach Zugangsberechtigung k&ouml;nnen diese 
Daten auch von Teamkollegen eingesehen werden.
</p>

<p>
Die schematische Struktur von .NET My Services sieht so aus (mit Erstentw&uuml;rfen von Services):
</p>

<IMG SRC="/artikel/Bilder/200110/20011029_1.png" width="590" height="442" alt="" border="0">

<p>
Auf der PDC 2001 wurden folgende Core-Services vorgestellt:
</p>

<ul>
<li><b>.NET Categories:</b> Gruppiert gleichartige Daten der dem einzelnen User verf&uuml;gbaren Dienste, Informationen, etc.</li>
<li><b>.NET Profile:</b> Hier k&ouml;nnen Daten &uuml;ber die eigene Person gespeichert werden (Adresse, Telefonnummer, Geburtsdatum etc.) Diese 
k&ouml;nnen je nach Berechtigung auch von anderen eingesehen werden</li>
<li><b>.NET Devices:</b> Hier liegen die Informationen &uuml;ber die vom Benutzer verwendeten Ger&auml;te - z.B. Bildschirmaufl&ouml;sung,
&Uuml;bertragungsrate, etc.</li>
<li><b>.NET Application Settings:</b> Hier werden die Einstellungen der jeweiligen Anwendungen gespeichert. Da diese Infos zentral 
online verf&uuml;gbar sind, konfigurieren sich die Ger&auml;te des Benutzers automatisch nach den aktuellen Einstellungen</li>
<li><b>.NET Presence:</b> Hier bestimmt der User seine Verf&uuml;gbarkeit - &auml;hnlich wie im MSN Messenger, also z.B. Online,
Offline, Busy, etc.</li>
<li><b>.NET Documents:</b> zentraler, gesicherter Speicherort von Dokumenten. Da es im Sinn der My Services ist, diese
von einem beliebigen Ort auf einem beliebigen Ger&auml;t einzusehen, ist dieser sicher nicht die lokale Festplatte!</li>
<li><b>.NET Location:</b> Enth&auml;lt Informationen &uuml;ber den jeweiligen Standort und seine Eigenschaften</li>
<li><b>.NET Services:</b> Enth&auml;lt Informationen &uuml;ber die dem User benutzbaren Services bzw. f&uuml;r die er 
sich registriert hat</li>
<li><b>.NET Lists:</b> Einfache Online-Liste: also zB eine "Anh&auml;ufung Daten" &uuml;ber To-Dos, Einkaufsliste, etc.</li>
<li><b>.NET Contacts:</b> Kontaktliste; Speichert Informationen &uuml;ber andere Personen, &auml;hnlich der Buddylist im MSN 
Messenger.</li>
<li><b>.NET Inbox:</b> Stellt den Emaileingang (standardm&auml;&szlig;ig des Hotmail Accounts) dar</li>
<li><b>.NET Favorite Web Sites:</b> Entspricht den Favoriten Ordner des Internet Explorers. Da diese zentral liegen k&ouml;nnen
diese auch von jedem Ger&auml;t &uuml;bernommen werden</li>
<li><b>.NET Calendar:</b> Dies ist der allgemeine Terminkalender eines Users. Dort werden alle wichtigen Termine, etc.
eingetragen, z.B. Projektdeadlines, Meetings, Geburtstage, etc. . Je nach Berechtung k&ouml;nnen andere Benutzer (oder Dienste) die freigegebenen
Daten einsehen</li>
<li><b>.NET Alerts:</b> Hier k&ouml;nnen Events, Benachrichtigungen, von Diensten ausgel&ouml;st werden (die vom MSN Messenger
bekannten "Blue Toasts", z.B. wenn ein anderer, in der Buddylist registrierter User gerade online ist)</li>
<li><b>.NET Wallets:</b> Hier k&ouml;nnen (wieder zentral, nicht lokal) gesichert Bezahlungsoptionen bzw. -informationen
gespeichert werden. Mit Hilfe von .NET Passport soll hier der Einkauf im Internet erleichtert werden</li>
<li><b>.NET Notification:</b> Benachrichtigungs-Dienst. Durch diesen wird der Benutzer von anderen Web Sites, Applikationen
oder anderen Web Sites &uuml;ber f&uuml;r ihn wichtige Events benachrichtigt (z.B. neue Stockquotes, Email, etc.)</li>
</ul>

<p>
Alle Services haben eines gemeinsam: sie und die in ihnen enthaltenen Informationen sind alle online verf&uuml;gbar. D.h.
sie m&uuml;ssen daher zentral an einem online verf&uuml;gbaren Ort gespeichert werden, also auf einem irgendwo hoffentlich gesicherten
Server auf den dann die User zugreifen k&ouml;nnen. Da einige Services auch heikle Daten wie Kreditkartennummern, pers&ouml;nliche Eintr&auml;ge
enthalten k&ouml;nnen, ist Mi&szlig;trauen angesagt. So ein Server ist n&auml;mlich (fast sicher) das Ziel f&uuml;r illegale Datenmineure (Cracker), oder auch staatliche
Institutionen: das Finanzamt, Sicherheitsbeh&ouml;rden
etc., die sich legal auf diese Daten Zugriff verschaffen k&ouml;nnen (Zweck sei offengelassen) - das Ende der Privatsph&auml;re, und alles hängt
an einem Service.
</p>

<p>
Da man auch eine Sicherheitsstruktur implementieren mu&szlig;, sind nun die Entwickler gefragt, 
die diese dann auch wirklich einbauen bzw. die Services f&uuml;r den User anpassen sollen:
</p>

<h2>Aus der Sicht des Entwicklers</h2>

<p>
Um Anwendungen, die die My Services benutzen sollen erstellen zu k&ouml;nnen ben&ouml;tigt man einiges an
Wissen &uuml;ber XML, Web Services und Sicherheitsmechanismen. Das kommende SDK f&uuml;r My Services soll ausreichend Dokumentation 
und Beispiele bieten. Prinzpiell ist der Aufbau eines Services folgenderma&szlig;en:
<p>

<h3>Struktur eines Services</h3>

<ul>
<li><b>Kommunikation:</b> erfolgt &uuml;ber SOAP (via HTTP bzw. DIME)</li>
<li><b>Authentifizierung:</b> erfolgt &uuml;ber .NET Passport</li>
<li><b>Datenstruktur bzw. Formatierung der Daten:</b> XML bzw. Schemas (XSD)</li>
</ul>

<p>
Die Abl&auml;ufe eines My Service Requests/Response sehen schematisch so aus:
</p>

<IMG SRC="/artikel/Bilder/200110/20011029_2.png" width="590" height="255" alt="" border="0">

<p>
Da sich diese Technologie noch in einem sehr fr&uuml;hen Entwicklungsstadium befindet, soll die Programmierung hier nicht weiter erl&auml;utert
werden.
</p>

<h2>Schlu&szlig;bemerkung</h2>

<p>
Prinzipiell ist die Idee der .NET My Services anf&auml;nglich &uuml;berzeugend. Man hat seine Daten (und auch die von anderen,
sofern berechtigt) immer aktuell und griffbereit - und das egal wo man sich befindet und welches Ger&auml;t man verwendet.
Diese Infrastruktur erfordert aber, da&szlig; die Daten nicht lokal, sondern auf irgend einem Server abgelegt werden m&uuml;ssen um diese
zug&auml;nglich zu machen. Dies ist aber auch schon der Knackpunkt, wo sich die Geister der um ihre Daten Besorgten scheiden werden.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fmsdn%2Emicrosoft%2Ecom%2Fnet%2F">.NET information on MSDN</a><br>
<SPAN class="content">http://msdn.microsoft.com/net/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fmsdn%2Emicrosoft%2Ecom%2Fnetmyservices%2F">.NET My Services on MSDN</a><br>
<SPAN class="content">http://msdn.microsoft.com/netmyservices/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fmsdn%2Emicrosoft%2Ecom%2Ftheshow%2F">The .NET Show</a><br>
<SPAN class="content">http://msdn.microsoft.com/theshow/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
