<HTML>
<HEAD>
<TITLE>Erstellen von HTML Help Dateien</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Dieser Artikel beschreibt kompakt worum es sich dabei handelt, wo die Vor- und Nachteile liegen und wie Sie es nutzen k&ouml;nnen. Und er zeigt wie Sie im Schnellgang eine eigene kompilierte Windows HTML Hilfedatei erstellen k&ouml;nnen.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,hhc,HTML Help,Hilfedatei,Hilfe,Programmieren,CHM,HTML Help Compiler,HTML Help Workshop">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Erstellen von HTML Help Dateien</H1>
<p>
Geschrieben von: <a href="../autoren/hubertdaubmeier.htm">Hubert Daubmeier</a><br>
Kategorie: <a href="../kategorien/Dokumentation.htm">Dokumentation</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20020617"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Dieser Artikel beschreibt kompakt worum es sich dabei handelt, wo die Vor- und Nachteile liegen 
und wie Sie es nutzen k&ouml;nnen. Und er zeigt wie Sie im Schnellgang eine eigene kompilierte 
Windows HTML Hilfedatei erstellen k&ouml;nnen.  
</p>

<h2>Was sind HTML Help Dateien?</h2>
<p>
HTML Help (*.chm) ist das Nachfolgeformat der allseits bekannten HLP Hilfedateien. CHM Dateien sind 
komprimierte HTML Dateien, welche in einem Archiv gespeichert werden. Im CHM sind neben den HTML 
Dateien auch die abh&auml;ngigen Objekte wie zB Grafiken gespeichert. Meist haben HTML Help Dateien 
einen Verzeichnisbaum der automatisch oder manuell erstellt und gepflegt werden kann. Weitere 
optionale Elemente sind ein Index (Schl&uuml;sselwortliste) und die notwendigen Daten zur Volltextsuche. 
Zahlreiche Beispiele finden Sie beispielweise im Verzeichnis c:\windows\help oder c:\winnt\help. 
</p>

<h2>Warum HTML Help einsetzen?</h2>
<p>
HTML Help ist f&uuml;r Programmierer gedacht, die ihr eigenes Programm um ein Hilfesystem erg&auml;nzen 
oder eine Komponente dokumentieren wollen. Neben der klassischen Programmierung bieten sich 
CHM Dateien an, um einfach Offline Inhalte jenseits von Programmdokumentation bereitzustellen, 
um Zusammengeh&ouml;rendes, wie etwa eine Projektdokumentation, zusammenzupacken und als eine Datei 
ausliefern zu k&ouml;nnen. Die Komprimierung spart Platz und die eingebaute Navigation erleichtert 
den Einstieg. 
</p>
<p>
Alternativen zu HTML Help sind PDF Dokumente, die neben dem Umstieg auf ein anderes Werkzeug 
nicht die M&ouml;glichkeiten von HTML bieten: zum Beispiel wird in CHM Dateien Scripting und 
Multimedia unterst&uuml;tzt. Ein Nachteil der HTML Hilfe ist die Plattformabh&auml;ngigkeit.
</p>

<h2>Grundz&uuml;ge der Erstellung von HTML Hilfe</h2>
<p>
Die Inhalte der Hilfe werden in HTML Seiten erstellt. Zum Erstellen der Seiten kann jeder HTML 
Editor eingesetzt werden.  Eine (sehr) einfache Editor-Funktion ist im HTML Help Workshop selbst 
eingebaut.
</p>
<p>
Der oben erw&auml;hnte HTML Help Workshop ist das wichtigste Werkzeug bei der Erstellung von HTML 
Help Dateien. Es ist ein kostenlos ladbares Programm von Microsoft, das die folgenden 
Grundfunktionen und einiges darum herum beinhaltet:
</p>

<ul>
	<li>HTML Seiten hinzuf&uuml;gen und entfernen
	<li>Inhaltsverzeichnis erstellen und verwalten
	<li>Schl&uuml;sselwortliste erstellen und pflegen
	<li>Optionen setzen, zB Volltextsuche ein- oder ausschalten
	<li>Integriert den Hilfe Compiler, das Werkzeug, das alles zusammenmontiert, die Daten 
	komprimiert und letztlich die endg&uuml;ltige Hilfedatei erstellt. Hinweis f&uuml;r alte 
	Hilfeschreiber: es gibt keinen separaten HC.EXE mehr. 
</ul>

<p>
Zur Unterst&uuml;tzung des Autors gibt es mehrere kommerzielle Pakete wie z.B. RoboHelp oder 
HelpMagician, (mehr dazu auch unter <a href="http://www.microsoft.com/mind/0297/htmlhelpsidebar.htm" target="_blank">HTML Help Sidebar</a>)
die komplexere Projekte erm&ouml;glichen. In diesem Artikel geht es um den Schnellstart ohne diese 
Hilfsmittel. 
</p>

<p>
Zur Anzeige der HTML Help Datei werden Komponenten des Internet Explorers verwendet. Auf den 
Betriebssystemversionen nach Windows 95 sind &uuml;blicherweise alle Komponenten standardm&auml;&szlig;ig 
installiert. Die Internet-Einstellungen des Client-Rechners, wie Zeichensatz, Schriftgr&ouml;&szlig;en 
oder Sicherheitseinstellungen werden vom Hilfesystem &uuml;bernommen. Wer sich beispielsweise &uuml;ber 
zu gro&szlig;e oder zu kleine Schrift wundert, wei&szlig; hiermit wo sich die Einstellung &auml;ndern l&auml;sst. 
</p>

<h2>Legen wir los</h2>
<p>
Der HTML Help Workshop, den es &uuml;brigens nur in englischer Sprachversion gibt, kann von 
<a href="http://msdn.microsoft.com/library/en-us/htmlhelp/html/hwMicrosoftHTMLHelpDownloads.asp" target="blank">hier</a>
geladen werden (zum Zeitpunkt der Erstellung dieses Artikels war die HTML Help Version 1.32 
aktuell). Beim Setup kann die Meldung "This Computer already has a newer version of HTML Help" 
erscheinen, die getrost ignoriert und &uuml;bersprungen werden kann. Dahinter steht der Versuch die 
Windows Hilfe - das reine Anzeigewerkzeug, nicht das Autorenwerkzeug - in Form der HH.EXE zu 
aktualisieren; was sich etwa im Fall von Windows 2000 und h&ouml;her er&uuml;brigt.
</p>

<p>
Nach der Installation findet sich im Startmen&uuml; eine Gruppe HTML Help Workshop, von der das 
gleichnamige Tool gestartet wird. Los geht es mit einer neuen Projektdatei &uuml;ber File - New - 
Project. Es wird ein Assistent mit den folgenden Schritten gestartet:
</p>

<ul>
	<li>Zuerst kommt der Vorschlag, ein altes Hilfeprojekt zu konvertieren. Wir gehen davon aus, 
	da&szlig; kein altes HPJ Projekt der Vorg&auml;ngerversion vorliegt und kreuzen das entsprechende Feld
	nicht an. 
	<li>Dann will der Wizard den Namen der Projektdatei wissen. Wechseln Sie per Browse-
	Schaltfl&auml;che in Ihr Arbeitsverzeichnis und geben als Namen "Demo" an. Die passende 
	Erweiterung wird automatisch eingesetzt. 
	<li>Als weitere Annahme sind HTML Dateien bereits vorhanden und sollen eingebunden werden; die 
	entsprechende Option aktivieren. Inhaltsverzeichnis und Index werden sp&auml;ter erstellt, deshalb 
	die zugeh&ouml;renden Optionen leer lassen.
	<li>Im letzten Dialog werden die HTML Seiten hinzugef&uuml;gt. Der bekannte File Dialog unterst&uuml;tzt 
	Mehrfachauswahl mit Umschalt- und/oder Steuerungstasten. Dateien aus verschiedenen 
	Verzeichnissen werden durch Mehrfachklick auf Add hinzugef&uuml;gt. 
</ul>

<p>
Nach Abschlu&szlig; des Assistenten sollte es etwa so aussehen. 
</p>

<IMG SRC="/artikel/Bilder/200206/20020617_1.png" width="511" height="436" alt="" border="0">

<p>
Ein Doppelklick auf einen beliebigen Eintrag im Options-Bereich oder das erste Icon in der 
vertikalen Symbolleiste am linken Rand &ouml;ffnet den Eigenschaften Dialog des Projekts. Interessant 
hier: dem "Kind" unter <i>Title</i> einen Namen geben. Den Reiter wechseln zu <i>Files</i> und dort die 
Inhaltsverzeichnisdatei (contents file), automatische Erstellung es Inhaltsverzeichnis und die 
&Uuml;berschriftentiefe (head level) auf vern&uuml;nftigere 2 oder 3 stellen.
</p>
<p>
Damit k&ouml;nnte der erste Compilelauf stattfinden. Die Schaltfl&auml;che dazu findet sich auf der 
horizontalen Symbolleiste als drittes Symbol oder als Befehl im <i>File</i> Men&uuml;.  Zum Betrachten der 
eben kompilierten Datei dient das vierte Symbol auf derselben Symbolleiste (neben dem 
Compilerknopf) oder als Befehl im <i>View</i>-Men&uuml;.
</p>

<h2>Projektdateien von Hand verwalten</h2>
<p>
Neugierig geworden? Nach den oben beschriebenen Schritten sieht die Projekt-Datei (Endung HHP f&uuml;r 
HTML Help Project) beispielsweise wie folgt aus:
</p>

<pre style="background='silver';">
[OPTIONS]
Auto TOC=2
Compatibility=1.1 or later
Compiled file=MeinProjekt.chm
Default topic=Demo.htm
Display compile progress=No
Language=0x407 Deutsch (Deutschland)
Title=Mein erstes Projekt


[FILES]
Demo3.htm
Demo2.htm
Demo1.htm

[INFOTYPES]
</pre>

<p>
Interessant ist die Liste der eingebundenen HTML Seiten. Wer m&ouml;chte, kann hier durchaus von Hand 
weitere Dateien einpflegen oder die Liste auf Vollst&auml;ndigkeit pr&uuml;fen. Die Optionen werden 
praktischerweise besser im Workshop eingestellt. Selbstverst&auml;ndlich lassen sich auch die Dateien 
im HTML Help Workshop vollst&auml;ndig verwalten. 
</p>

<h2>Inhaltsverzeichnis pflegen</h2>
<p>
Nach dem ersten Kompilierlauf findet sich das automatisch erzeugte Inhaltsverzeichnis als xxx.HHC 
Datei auf der Platte. Ab hier stellt sich die Frage, will ich die Datei weiterhin vom Workshop 
bei jedem Kompilierlauf neu erzeugen lassen oder stelle ich die automatische Generierung ab und 
pflege sie von Hand weiter. Es handelt sich um "handels&uuml;bliches HTML" ohne besondere Tricks, wie 
das folgende Beispiel verdeutlicht. Letztlich entscheidet pers&ouml;nliche Pr&auml;ferenz und die 
Erfordernisse des Projekts, soda&szlig; es hier keinen allgemeing&uuml;ltigen Rat geben kann. 
</p>

<pre style="background='silver';">
&lt;!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN"&gt;
&lt;HTML&gt;
&lt;HEAD&gt;
&lt;meta name="GENERATOR" content="Microsoft&amp;reg; HTML Help Workshop 4.1"&gt;
&lt;!-- Sitemap 1.0 --&gt;
&lt;/HEAD&gt;&lt;BODY&gt;
&lt;UL&gt;
  &lt;LI&gt; &lt;OBJECT type="text/sitemap"&gt;
    &lt;param name="Name" value="Einf&uuml;hrung"&gt;
    &lt;param name="Local" value="Demo1.htm"&gt;
    &lt;param name="ImageNumber" value="1"&gt;
    &lt;/OBJECT&gt;
  &lt;LI&gt; &lt;OBJECT type="text/sitemap"&gt;
    &lt;param name="Name" value="Funktionen"&gt;
    &lt;param name="Local" value="Demo2.htm"&gt;
    &lt;param name="ImageNumber" value="1"&gt;
    &lt;/OBJECT&gt;
&lt;/UL&gt;
&lt;/BODY&gt;&lt;/HTML&gt;
</pre>

<p>
Der Workshop ist hilfreich beim Arrangieren der einzelnen &Uuml;berschriften. Reihenfolge und 
Gliederungstiefe lassen sich im Contents-Tab verschieben und anpassen. Per Doppelklick auf 
einen Inhaltseintrag &ouml;ffnet sich die Eigenschaftenseite eines Eintrags. Im Tab <i>Advanced</i> k&ouml;nnen 
Sie den Image Index (gewisserma&szlig;en die &Uuml;berschriftenebene) &auml;ndern. Wird dort die 
standardm&auml;&szlig;ige <i>auto</i> Einstellung abgew&auml;hlt, lassen sich mit den Pfeilkn&ouml;pfen alle Eintr&auml;ge 
beliebig verschieben. 
</p>

<h2>Index erstellen</h2>
<p>
Ein Wort der Warnung: beim ersten Erkunden der M&ouml;glichkeiten bleibt es nicht aus, da&szlig; der Tab 
Index Interesse findet. Wenn Sie nicht jetzt gleich beabsichtigen die weitere erforderliche 
Arbeit in die Erstellung der Indexes zu investieren, brechen Sie beim Angebot einen 
automatischen Index zu erstellen besser ab, denn sonst ist Ihnen der erzeugte leere Index 
st&auml;ndig im Weg und in der Ergebnisdatei st&ouml;rt ein leerer Index auch.
</p>
<p>
Was ist ein Index?  Als sichtbares Ergebnis hat die fertige CHM Datei einen neuen Tab in der 
linken Navigationsleiste. Falls die Navigationsleiste nicht sichtbar ist, kann man diese per 
Klick auf den Einblenden-Button im Toolbar einschalten. 
</p>

<IMG SRC="/artikel/Bilder/200206/20020617_2.png" width="63" height="40" alt="" border="0">

<p>
Der Index ist  eine Liste von Begriffen, die nicht direkt mit dem Inhaltsverzeichnis zu tun 
haben m&uuml;ssen.  Ein Doppelklick auf einen Indexeintrag zeigt die zugeh&ouml;rige Seite an (oder 
Seiten). Der Index macht es letztlich dem Leser leicht, auf unterschiedlichen Wegen zur  
gew&uuml;nschten Information zu finden. Leider erfordert die Erstellung einiges an Arbeit; und mehr
noch viel Nachdenken &uuml;ber gute Begriffe zur Aufnahme in den Index. Dem steht gegen&uuml;ber, da&szlig; der 
Index von der Mehrheit der Benutzer als bevorzugte Suchmethode verwendet wird.. 
</p>
<p>
Der klassische Ansatz ist 
</p>

<ul>
	<li>Im Projekt-Fenster den Tab Index aktivieren.  
	<li>Ein Klick auf das Schl&uuml;sselsymbol in der vertikalen Symbolleiste &ouml;ffnet den Indexdialog.
	<li>Unter Keyword eben dieses (ein Schl&uuml;sselwort) eintippen 
	<li>&Uuml;ber die Add-Schaltfl&auml;che wird die zugeh&ouml;rige Datei angegeben. Enthalten mehrere Dateien 
	einen Bezug zu diesem Schl&uuml;sselwort, werden alle zutreffenden Dateien angegeben.
</ul>

<IMG SRC="/artikel/Bilder/200206/20020617_3.png" width="491" height="400" alt="" border="0">

<p>
Als andere Variante k&ouml;nnen die Keywords direkt im HTML Code eingebettet werden, wie das folgende 
Beispiel zeigt. 
</p>

<pre style="background='silver';">
&lt;Object type="application/x-oleobject" classid="clsid:1e2a7bd0-dab9-11d0-b93a-00c04fc99f9e"&gt;
  &lt;param name="Keyword" value="Accept"&gt;
  &lt;param name="Keyword" value="ConnectionTimeout"&gt;
  &lt;param name="Keyword" value="TrustUnknownCA"&gt;
  &lt;param name="Keyword" value="UserAgent"&gt;
&lt;/OBJECT&gt;
</pre>

<p>
Eine dritte Variante, die sich bei gr&ouml;&szlig;eren Projekten empfiehlt, ist die Pflege des Index 
au&szlig;erhalb des HTML Help Workshops.  Denn in der Praxis passiert folgendes: in verschiedenen 
Seiten taucht der gleiche Begriff mehrmals unter unterschiedlichen Keywords auf. Beispiel:  
"Anlage", "Anlagen" und "Attachment". So etwas sehe ich teilweise in der fertigen Hilfedatei. 
Die Pflege wird jedoch umst&auml;ndlich. Hinzu kommt, da&szlig; bei der Durchsicht der Schl&uuml;sselw&ouml;rter 
einfacher auff&auml;llt, da&szlig; der Benutzer m&ouml;glicherweise gar nicht an "Anlagen" denkt und folglich 
der Sucherfolg ganz einfach gesteigert werden kann mit zus&auml;tzlichen Schl&uuml;sselw&ouml;rter wie etwa 
"Datei anf&uuml;gen" und "Anh&auml;ngen". 
</p>

<p>
Praktischer ist es, in diesem Fall den Index in einer Excel-Datei zu pflegen. Beim Erstellen 
des Indexes hilft ein kleines Script. 
</p>

<p>
Als Vorbereitung braucht es eine Exceltabelle mit zwei Spalten. In der ersten steht der Dateiname 
der HTML-Seite und in der zweiten Spalte wird das Schl&uuml;sselwort eingetragen. Je Seite k&ouml;nnen 
mehrere Schl&uuml;sselworte eingetragen werden. Es wird einfach der Dateiname wiederholt und das 
neue Schl&uuml;sselwort eingetragen. Auf diese Art kann man einfach nach Schl&uuml;sselworten sortieren und 
sich die Pflege deutlich erleichtern. Das Beispiel im Download verdeutlicht das Prinzip noch 
einmal. 
</p>

<pre style="background='silver';">
  Option Explicit
  Const CDATABASE = "keywords.xls"
  Const OUTPUTDATEI = "meinprojekt.hhk"
  Const OVERWRITE = True
  Dim oRS, oConn, fso, KeyDatei, strOutput
  strOutPut = vbTab &amp; "&lt;LI&gt; &lt;OBJECT type=""text/sitemap""&gt;" &amp; vbCrLf &amp; _
    vbTab &amp; vbTab &amp; "&lt;param name=""Name"" value=""yyyy""&gt;" &amp; vbCrLf &amp; _
    vbTab &amp; vbTab &amp; "&lt;param name=""Local"" value=""xxxx""&gt;" &amp; vbCrLf &amp; _
    vbTab &amp; vbTab &amp; "&lt;/OBJECT&gt;" &amp; vbCrLf

  Set fso = CreateObject("Scripting.FileSystemObject")
  Set KeyDatei = fso.CreateTextFile(OUTPUTDATEI, OVERWRITE)
  WriteHead()
  Readdb
  WriteFooter()
  KeyDatei.Close
  MsgBox "Fertig"


  Sub Readdb()
    Set oConn = CreateObject("ADODB.Connection")
    oConn.Open "Provider=Microsoft.Jet.OLEDB.4.0;Excel 8.0;DATABASE=" &amp; CDATABASE
    Set oRs = oConn.Execute("SELECT * FROM Datenbank ORDER BY 2")
    Do Until oRs.eof
      KeyDatei.write Replace(Replace(strOutPut, "xxxx", oRS(0)), "yyyy", oRS(1))
      oRs.MoveNext 
    Loop 
    oRs.close
    oConn.close 
  End Sub


  Sub WriteHead()
    KeyDatei.Write "&lt;HTML&gt;" &amp; vbCrLf &amp; "&lt;HEAD&gt;" &amp; vbCrLf &amp; _
      "&lt;!-- Sitemap 1.0 --&gt;" &amp; vbCrLf &amp; "&lt;/HEAD&gt;" &amp; vbcrlf &amp; _
      "&lt;BODY&gt;" &amp; vbCrLf &amp; "&lt;UL&gt;" &amp; vbCrLf
  End Sub


  Sub WriteFooter()
  	KeyDatei.Write "&lt;/UL&gt;" &amp; vbCrLf &amp; "&lt;/BODY&gt;&lt;/HTML&gt;"  	
  End Sub
</pre>

<h2>Volltextsuche</h2>
<p>
Nach der Arbeit mit dem Index ist die Volltextsuche ziemlich einfach zu implementieren.  Das 
Eigenschaftenfenster des Projekts &ouml;ffnen und im Tab <i>Compiler</i>  die Checkbox "Compile fulltext 
search information" einschalten. Aber Vorsicht, die Dateigr&ouml;&szlig;e wird deutlich gr&ouml;&szlig;er. Ist Platz 
bzw. &Uuml;bertragungsgeschwindigkeit ein Thema, w&auml;re zu &uuml;berlegen, ob es das Feature wert ist. Es 
kommt hinzu, da&szlig; in der Praxis so mancher Benutzer eine Volltextsuche nicht verwendet. 
</p>
<p>
F&uuml;r Leute, die sich trauen die Volltextsuche zu verwenden ist es jedoch einfach und praktisch. 
Als Beispiel k&ouml;nnte man auf die Idee kommen, die Dateien von SelfHTML in eine CHM Datei zu 
packen um sie hinterher per Volltextsuche zu durchsuchen. Als kleinen Bonus finden Sie ein 
Script im Download, das bei der Erstellung der Dateienliste hilft. F&uuml;r eine vollautomatische 
Generierung einer SelfHTML in CHM-Format mit Volltextsuche reicht es allerdings noch nicht 
ganz aus. Wenn Sie aber die automatische Erzeugung des Inhaltsverzeichnisses abschalten steht 
zumindest einem ersten Schnelltest nichts mehr im Weg.
</p>

<h2>Einige Tips</h2>
<ul>
	<li>Zum Lernen ist es hilfreich eine vorhandene CHM Datei auseinander zu nehmen (Decompile 
	im File Men&uuml;) und sich die Arbeit anderer Hilfeautoren anzusehen. 
	<li>Der Help Compiler ist arg beleidigt, wenn zum Kompilieren die aktuelle Hilfedatei 
	noch ge&ouml;ffnet ist, denn dann kann er die alte Datei nicht l&ouml;schen um eine neue anzulegen. 
	Also vor dem Kompilieren zuerst die zuletzt erstellte Datei schlie&szlig;en. 
	<li>Der HTML Help Image Editor in der gleichen Programmgruppe wie der HTML Help Workshop ist 
	ein kleines Tool zum Erstellen von Bildschirmkopien; es kann Bilder zuschneiden und Farben 
	ver&auml;ndern. Praktisch ist es f&uuml;r die Erstellung von Imagemaps. Und eine neckische, aber recht 
	brauchbare Funktion findet sich im Datei-Men&uuml; unter dem Befehl "Art Manuscript".  Dies l&auml;&szlig;t 
	sich mal schnell dazu "mi&szlig;brauchen", eine webf&auml;hige &Uuml;bersicht der Bilder einer 
	Digitalkamera zu erstellen. Gestartet wird der Assistent &uuml;ber den Befehl: Datei - Art 
	Manuscript - Create or Update. Ein Assistent bietet Erkl&auml;rungen und f&uuml;hrt durch die 
	einzelnen Schritte. Am Ende werden aus allen angegebenen Grafiken Miniaturbilder mit 
	Diarahmen generiert, die dazu passenden HTML Datei erstellt und die Miniaturbilder mit 
	den gro&szlig;en Originalbildern verlinkt. Sind es gar zu viele Grafiken, erstellt der Assistent 
	auch mehrere &Uuml;bersichtsseiten und verlinkt sie untereinander.  
	<li>Wie schon erw&auml;hnt werden zur Anzeige der Hilfedateien die Komponenten des Internet 
	Explorers verwendet. Das bedeutet, da&szlig; man auch dessen Befehle verwenden kann: zB Rechtsklick 
	und Quelle anzeigen, oder Bilder kopieren. Als weitere praktische Konsequenz daraus l&auml;&szlig;t 
	sich problemlos VBScript als Clientsprache einsetzen. 
</ul>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Mein besonderer Dank gilt Dominik-Pascal Kovacic-Vo&szlig;, Frank Matthiesen und Jens Lukas f&uuml;r Ihre 
Durchsicht und die kritischen Beitr&auml;ge bei der Erstellung dieses Artikels. Ich hoffe, wir 
konnten Ihnen eine praktische und nachvollziehbare Anleitung zum Erstellen von CHM Dateien 
liefern. Es stecken noch viele M&ouml;glichkeiten im System, die heute in der K&uuml;rze eines Artikels 
nicht angesprochen werden konnten. 
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20020617.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20020617.zip</span></p>
<h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20020730.htm">C# XML-Kommentare &mdash; Dokumentation von selbst</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020730.htm</span><br>
<a href="../artikel/20020506.htm">Schreib&quot;kunst&quot; f&uuml;r Programmierer, Teil I</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020506.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fmsdn%2Emicrosoft%2Ecom%2Flibrary%2Fen%2Dus%2Fhtmlhelp%2Fhtml%2FhwMicrosoftHTMLHelpDownloads%2Easp">HTML Help Download</a><br>
<SPAN class="content">http://msdn.microsoft.com/library/en-us/htmlhelp/html/hwMicrosoftHTMLHelpDownloads.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Emicrosoft%2Ecom%2Fmind%2F0297%2Fhtmlhelpsidebar%2Ehtm">HTML Help Sidebar</a><br>
<SPAN class="content">http://www.microsoft.com/mind/0297/htmlhelpsidebar.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
