<HTML>
<HEAD>
<TITLE>Yet Another Forums Software</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Es geht weiter mit der Serie "Yet Another...", und zwar stelle ich heute die StP Forums Software vor. Diese implementiert ein auf ASP und Access Datenbank basierendes Forum, das man in seine Site gratis einbinden kann.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Forum,Forensoftware,Diskussionsforum,StP,Foren,Administration,webbasiert,Setup,Installation">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Yet Another Forums Software</H1>
<p>
Geschrieben von: <a href="../autoren/christophwille.htm">Christoph Wille</a><br>
Kategorie: <a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20020502"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Es geht weiter mit der Serie "Yet Another...", und zwar stelle ich heute die StP Forums Software vor. Diese implementiert
ein auf ASP und Access Datenbank basierendes Forum, das man in seine Site gratis einbinden kann. Der heutige Artikel beleuchtet
die Features und Administrationsm&ouml;glichkeiten dieser Forensoftware.
</p>

<p>
Die aktuellste Version kann von <a href="http://www.saintopatrick.com/asp/forums.asp" target="_blank">St. Patrick's Works</a>
downgeloadet werden, die Version 1.5.1 ist im heutigen Artikeldownload mit dabei. Die Installation ist auch wie bei
<a href="../artikel/20020410.htm">StP Database Administrators</a> denkbar einfach: entzippen, konfigurieren und loslegen.
</p>

<h2>Erste Schritte</h2>
<p>
Der erste Schritt mu&szlig; in der Datei <b>config_db.asp</b> getan werden - die Konstante <i>ConnString</i> mu&szlig; an die eigenen
Bed&uuml;rfnisse angepasst werden. <b>Sicherheitshinweis</b>: die Datenbank sollte in ein gesichertes Verzeichnis verschoben werden, auf
das Internetbenutzer nicht per Webbrowser zugreifen k&ouml;nnen.
</p>

<p>
Nach diesem wichtigsten Installationsschritt teilt sich die Konfiguration in zwei Teile - Look &amp; Feel und die Konfiguration
der Foren. Mit der Konfiguration des Look &amp; Feels werden wir uns heute nicht besch&auml;ftigen (es existieren zwei Artikel dazu,
siehe dazu die Sektion Links am Ende des Artikels), daf&uuml;r aber mit der Konfiguration der Foren, der Administration.
</p>

<h2>Administration</h2>
<p>
Der erste Schritt ist, sich die Standardinstallation anzusehen:
</p>

<IMG SRC="/artikel/Bilder/200205/20020502_1.png" width="721" height="481" alt="" border="0">

<p>
Wer den Screenshot des Browser genauer ansieht, wird bemerken, da&szlig; kein <i>TITLE</i> f&uuml;r das Dokument gesetzt ist. Der Grund hierf&uuml;r ist,
da&szlig; s&auml;mtliche Dateien der Forensoftware zum inkludieren in bestehendes Sitedesign gedacht sein. Dies ist ein guter Ansatz, und erspart
im Gegensatz zui vielen anderen Forenimplementierungen unnotwendige Anpassungsarbeit. Dies f&auml;llt aber unter den Aspekt Look &amp; Feel, und wird in den
bereits erw&auml;hnten zwei Artikeln ausf&uuml;hrlich beschrieben.
</p>

<p>
Um zu administrieren mu&szlig; man sich klarerweise als Administrator anmelden (<i>Login</i>). Standardm&auml;&szlig;ig existiert ein Account <i>Admin</i>, und das
Passwort ist ebenso <i>Admin</i>:
</p>

<IMG SRC="/artikel/Bilder/200205/20020502_2.png" width="604" height="213" alt="" border="0">

<p>
Dann gelangt man zu einer leicht ver&auml;nderten Startseite zur&uuml;ck:
</p>

<IMG SRC="/artikel/Bilder/200205/20020502_3.png" width="830" height="231" alt="" border="0">

<p>
<b>Sicherheitshinweis</b>: Jetzt w&auml;re ein guter Zeitpunkt, sofort unter dem Punkt <i>Profile</i> das Passwort des Administratorenaccounts
zu &auml;ndern! 
</p>

<p>
Nach der Passwort&auml;nderung geht es zum Punkt <i>Administration</i> auf der Hauptseite. Damit gelangt man zum Administrationsbereich,
der folgende Optionen bietet (<i>Administration</i> und <i>Back to forums</i> sind nicht in der Liste enhalten, da deren Funktion
wohl einsichtig ist):
</p>

<ul>
<li><b>Create category</b>: Erlaubt das Erzeugen einer Gruppierung innerhalb der Foren. Im letzten Screenshot ist "Test" die Gruppe, unter
	der das Forum "Testing" eingeh&auml;ngt ist.
<li><b>Edit category</b>: Erlaubt das Editieren eines Gruppennamens.
<li><b>Delete category</b>: L&ouml;scht eine Gruppe (inklusive der Foren und Postings).
<li><b>Create Forum</b>: Anlegen eines Forums. Man hat drei Optionen: <i>Open for all</i> (auch anonyme Surfer k&ouml;nnen posten),
	<i>Registered only</i> (anonyme Surfer k&ouml;nnen nur lesen), <i>Allowed Members only</i> (nur vom Administrator selektierte
	User k&ouml;nnen lesen oder posten).
<li><b>Edit forum</b>: Erlaubt das Modifizieren der Forumseinstellungen.
<li><b>Delete forum</b>: L&ouml;schen eines Forums.
<li><b>Categories and Forums order</b>: Hier kann man die Foren umsortieren, als auch die Gruppenzugeh&ouml;rigkeit &auml;ndern. Der folgende
	Screenshot zeigt das User Interface dieses Administrationsfeatures:<br>
	<IMG SRC="/artikel/Bilder/200205/20020502_4.png" width="662" height="320" alt="" border="0">
<li><b>Update counters</b>: Updated Forum Counters, zB Anzahl der Posts.
<li><b>Allowed forums users</b>: Hier definiert man, welcher User in einem <i>Allowed Members only</i> Forum posten und lesen darf.
	Nicht hinzugef&uuml;gte User sind in der Listbox <i>Other Members</i>, autorisierte User in der Listbox <i>Forum Members</i>:<br>
	<IMG SRC="/artikel/Bilder/200205/20020502_7.png" width="515" height="449" alt="" border="0">
<li><b>View users</b>: Zeigt eine Liste der registrierten User. Man kann User l&ouml;schen.
</ul>

<p>
Die Administration deckt alle wichtigen Bereiche f&uuml;r den erfolgreichen Betrieb eines Forums ab. Wird sich der User aber wohlf&uuml;hlen?
</p>

<h2>Das Forum in der Benutzerperspektive</h2>
<p>
Da ich das Forum bereits ein wenig mit Daten gef&uuml;llt habe, sehen wir uns die fertige Hauptseite nun an:
</p>

<IMG SRC="/artikel/Bilder/200205/20020502_5.png" width="740" height="351" alt="" border="0">

<p>
Die Farbgestaltung kann umgestellt werden (nur als Erinnerung), aber eines sieht man bereits hier: dem Benutzer werden hilfreiche
Icons angezeigt; zwei der Foren sind nicht ohne Restriktionen zu betreten, n&auml;mlich das Kaffeehaus (autorisierte User only), beziehungsweise
das Bug Reporting Forum, das man zwar lesen kann, aber nur als registrierter User posten darf.
</p>
<p>
Unter der Annahme, da&szlig; ich im Bug Reporting Forum posten will, lege ich mir einen User Account an. Die ersten vier Felder sind 
verpflichtend (sollte der User das Passwort vergessen haben, kann er es sich emailen lassen):
</p>

<IMG SRC="/artikel/Bilder/200205/20020502_6.png" width="789" height="629" alt="" border="0">

<p>
Und mit erstelltem User Account kann man dann im Forum posten:
</p>

<IMG SRC="/artikel/Bilder/200205/20020502_8.png" width="744" height="496" alt="" border="0">

<p>
Pseudo-HTML Code ist standardm&auml;&szlig;ig erlaubt (siehe Look &amp; Feel Artikel), normales HTML ist nicht erlaubt (und das ist gut so).
&Uuml;ber Smilies kann man streiten, aber viele Forenbesucher lieben sie. Richtig n&uuml;tzlich f&uuml;r unregelm&auml;&szlig;ige Forenbesucher ist, da&szlig;
sie sich automatisch eine Email schicken lassen k&ouml;nnen, wenn jemand auf ihr Posting antwortet.
</p>
<p>
Auch von der Warte des Benutzers kann man sagen, da&szlig; das Forum den Anspr&uuml;chen gen&uuml;gt.
</p>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Es gibt inzwischen sehr viel verschiedene Forensoftware am Internet zur Gratisverwendung, und f&uuml;r welche man sich entscheidet,
wird mittlerweile immer schwieriger. Wer das Forum in sein eigenes Design einbetten will, ist mit der heute vorgestellten Software
sicherlich sehr gut bedient.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20020502.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20020502.zip</span></p>
<h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20010207.htm">ASPForums 2.1 installieren und anpassen</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010207.htm</span><br>
<a href="../artikel/20010201.htm">Einrichten des Snitz Forums</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20010201.htm</span><br>
<a href="../artikel/20020410.htm">Yet Another Access Database Administration Tool</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020410.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Ecodeproject%2Ecom%2Fuseritems%2Fstpforum%2Easp">CodeProject Artikel zu StP Forums</a><br>
<SPAN class="content">http://www.codeproject.com/useritems/stpforum.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Esaintopatrick%2Ecom%2Fasp%2Fforums%2Easp">StP Forums Homepage</a><br>
<SPAN class="content">http://www.saintopatrick.com/asp/forums.asp</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
