<HTML>
<HEAD>
<TITLE>.NET Komponenten in COM+ Clients einsetzen</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Mit dem .NET Framework sind Funktionen in die Griffweite eines jeden Programmierers ger&uuml;ckt, von denen man noch vor nicht allzu langer Zeit nur tr&auml;umen durfte. Dieser Artikel zeigt, wie man .NET in existierenden Anwendungen einsetzen kann.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,CCW,RCW,COM Callable Wrapper,Runtime Callable Wrapper,Dispose,Dispose Pattern,Deterministic Finalization,DF,ComVisible,regasm,gacutil,csharp">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>.NET Komponenten in COM+ Clients einsetzen</H1>
<p>
Geschrieben von: <a href="../autoren/christophwille.htm">Christoph Wille</a><br>
Kategorie: <a href="../kategorien/dotNET%20Allgemein.htm">.NET Allgemein</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20020702"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Mit dem .NET Framework sind Funktionen in die Griffweite eines jeden Programmierers ger&uuml;ckt, von denen man noch vor nicht
allzu langer Zeit nur tr&auml;umen durfte. Trotz all dieser neuen Features kann man meist seine alten Applikationen nicht einfach
wegwerfen und in .NET neu schreiben, sondern man mu&szlig; sie weiterwarten. Dieser Artikel zeigt, wie man seine existierende 
Applikation mit in .NET geschriebenen Komponenten verbinden kann.
</p>

<p>
Viele existierende VB6 oder ASP Applikationen werden uns noch Jahre begleiten, doch sind in diesen Programmiersprachen bestimmte
Dinge nur schwer oder gar nicht realisierbar. Diese gleichen Aufgaben sind jedoch in .NET in wenigen Zeilen erledigt; wie kann man
also neuen .NET Code in seine existierende Anwendung bringen? Die Antwort sind COM Callable Wrapper, kurz CCW.
</p>

<h2>COM Callable Wrapper</h2>
<p>
Der Name ist Programm: der COM Callable Wrapper ist nichts anderes als ein Wrapper rund um unsere .NET Komponente, damit sie
von VB6 und anderen COM Clients aus angesprochen werden. Ein CCW ist das Gegenst&uuml;ck zum Runtime Callable Wrapper (RCW), den wir
bereits im Artikel <a href="../artikel/20000828.htm">Verwenden von COM Komponenten in ASP.NET </a> n&auml;her betrachtet haben.
</p>
<p>
Was alles mu&szlig; man f&uuml;r CCW's beachten? Nun, es gibt einige wichtige Punkte:
</p>

<ul>
	<li>Die Klasse mu&szlig; einen &ouml;ffentlichen (<b>public</b>) Konstruktor haben.
	<li>Nur &ouml;ffentliche Instanzmethoden k&ouml;nnen von au&szlig;en angesprochen werden.
	<li>Statische Methoden oder Eigenschaften sind prinzipiell nicht ansprechbar.
</ul>

<p>
Weiters sollte die Assembly, in der die .NET Komponente lebt mit einem Strong Name versehen sein, und der Einfachheit halber im
Global Assembly Cache (GAC) abgelegt sein.
</p>

<h2>Beispiel</h2>
<p>
Als Beispiel verwenden wir die ImageInfo Klasse aus dem Artikel <a href="../artikel/20001130.htm">Bildinformationen selbst ermitteln</a>,
die wir um einige Best Practices f&uuml;r CCW's erweitern werden. Beginnen wir mit dem erw&auml;hnten Strong Name. Dieser legt die Identit&auml;t
der Assembly kryptographisch fest, und f&uuml;r diese Prozedur ben&ouml;tigen wir ein Schl&uuml;sselpaar, das man mit dem <b>sn</b> Utility erzeugen
kann:
</p>

<pre style="background='silver';">
F:\Inetpub\wwwroot\AspHeute\dotnetccw>sn -k ImageInfo.key

Microsoft (R) .NET Framework Strong Name Utility  Version 1.0.3705.0
Copyright (C) Microsoft Corporation 1998-2001. All rights reserved.

Key pair written to ImageInfo.key
</pre>

<p>
Der weitere Teil der Prozedur ist einfach, weil den Gro&szlig;teil der Compiler erledigt - man mu&szlig; dem Compiler nur mitteilen, da&szlig; er
das Schl&uuml;sselpaar zur Erzeugung des Strong Names verwenden soll. Dies geschieht am besten in einer separaten Datei (der &Uuml;bersichtlichkeit
halber), die man <b>AssemblyInfo.cs</b> nennen sollte:
</p>

<pre style="background='silver';">
using System.Reflection;
using System.Runtime.CompilerServices;

[assembly: AssemblyTitle("ImageInfo")]
[assembly: AssemblyDescription("")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("AlphaSierraPapa")]
[assembly: AssemblyProduct("")]
[assembly: AssemblyCopyright("(c) 2002 Christoph Wille")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

[assembly: AssemblyVersion("1.0.0.0")]

[assembly: AssemblyDelaySign(false)]
[assembly: AssemblyKeyFile("ImageInfo.key")]
</pre>

<p>
Die letzte Zeile sorgt daf&uuml;r, da&szlig; der Compiler automatisch den Strong Name anlegt. Damit, und mit einer korrekten Versionsnummer, ist
man dann sp&auml;ter in der Lage, die Assembly in den GAC (Global Assembly Cache) zu installieren. So weit sind wir aber noch nicht, wir
m&uuml;ssen die Komponente noch ein wenig anpassen.
</p>
<p>
Die im Artikel <a href="../artikel/20001130.htm">Bildinformationen selbst ermitteln</a> vorgestellte ImageInfo Komponente entspricht
noch nicht ganz unseren Vorgaben. Wir sollten f&uuml;r eine schnelle Zerst&ouml;rung der "teuren" Bitmapresource sorgen (mittels Dispose
Pattern), einen Konstruktor anlegen, und auch die Methoden explizit f&uuml;r COM markieren. Beginnen wir bei den leichten Dingen, dem
Konstruktor (<b>ImageInfo.cs</b>):
</p>

<pre style="background='silver';">
   // Ein &ouml;ffentlicher Konstruktor mu&szlig; vorhanden sein
   public ImageInfo()
   {
    m_bmpRepresentation = null;
   }
</pre>

<p>
Nun markieren wir alle Methoden mit dem <b>ComVisible</b> Attribut. Da wir keine Methode verstecken wollen, k&ouml;nnte man argumentieren,
da&szlig; dieser Schritt unnotwendig ist. Er hat aber einen guten Grund: jeder, der den Code sp&auml;ter liest wei&szlig;, da&szlig; diese Komponente f&uuml;r 
die Verwendung in COM Applikationen vorgesehen ist, und er keine &Auml;nderungen machen sollte, die diese Verwendung verhindert. Au&szlig;erdem
kann man mit externen Tools die Attribute auslesen, was zB f&uuml;r die Dokumentation wichtig sein kann. F&uuml;r die beiden Eigenschaften sieht
unser Code dann so aus:
</p>

<pre style="background='silver';">
   [ComVisible(true)]
   public int Height
   {
     get { return m_bmpRepresentation.Height; }
   }
   
   [ComVisible(true)]
   public int Width
   {
     get { return m_bmpRepresentation.Height; }
   }  
</pre>

<p>
Es ist kein gro&szlig;er Aufwand, dokumentiert aber die Absicht des Programmierers. Klarerweise kann man mit <i>false</i> als Argument
zum Attribut eine Methode verstecken (zB falls diese f&uuml;r COM Applikationen keinen Sinn machen w&uuml;rde).
</p>
<p>
Kommen wir zum letzten Punkt, dem Dispose Pattern. Ein <i>Bitmap</i> Objekt ist teuer, weil es viele Resourcen verbraucht. Daher sollte man
es nach Verwendung wieder freigeben, und hier setzt der Dispose Pattern an - er definiert, was man in seine Klasse einbauen mu&szlig;, damit
jeder das Objekt deterministisch zerst&ouml;ren kann (der Dispose Pattern wird auch gerne als DF, Deterministic Finalization, bezeichnet).
Ich habe die einfachste Variante gew&auml;hlt, indem ich von der <i>Component</i> Klasse abgeleitet habe, und deren <i>Dispose</i> Methode &uuml;berlade:
</p>

<pre style="background='silver';">
 using System.ComponentModel; // f&uuml;r Component Basisklasse

 public class ImageInfo : Component
 {
   protected override void Dispose(bool disposing)
   {
    if (disposing) {
      // explizit aufgerufen, wir k&ouml;nnen das Bitmap weggeben
      if (null != m_bmpRepresentation) m_bmpRepresentation.Dispose();
      // Dispose k&ouml;nnte mehr als einmal aufgerufen werden, daher setzen
      // wir die zerst&ouml;rte Referenz auf null
      m_bmpRepresentation = null;
    }
    base.Dispose(disposing);
   }
   
   [ComVisible(true)]
   public void Close()
   {
     Dispose();  // Close ruft nur Dispose auf
   }
</pre>

<p>
F&uuml;r einige Programmierer ist es ein "Problem", ein Objekt "wegzuwerfen". F&uuml;r viele ist es nat&uuml;rlicher, ein Objekt zu schlie&szlig;en,
was speziell f&uuml;r Dateien oder Datenbankverbindungen zutrifft. Deshalb kann man - man mu&szlig; nicht - zus&auml;tzlich zu <i>Dispose</i> weitere
synonyme Methoden anbieten (hier <i>Close</i>).
</p>
<p>
Damit sind die &Auml;nderungen beendet, wir m&uuml;ssen die Komponente nun kompilieren:
</p>

<pre style="background='silver';">
csc /out:ImageInfo.dll /target:library ImageInfo.cs AssemblyInfo.cs /r:System.Drawing.dll /r:System.dll
</pre>

<p>
Dadurch erhalten wir die Assembly mit einem Strong Name, die wir nun f&uuml;r COM registrieren k&ouml;nnen.
</p>

<h3>CCW erstellen und registrieren</h3>
<p>
Die Schritte zum CCW sind bestechend einfach - prinzipiell ist es nur der Aufruf des <b>regasm</b> Tools:
</p>

<pre style="background='silver';">
F:\Inetpub\wwwroot\AspHeute\dotnetccw>regasm ImageInfo.dll /tlb:ImageInfo.tlb
Microsoft (R) .NET Framework Assembly Registration Utility 1.0.3705.0
Copyright (C) Microsoft Corporation 1998-2001.  All rights reserved.

Types registered successfully
Assembly exported to 'F:\Inetpub\wwwroot\AspHeute\dotnetccw\ImageInfo.tlb', and
the type library was registered successfully
</pre>

<p>
Allerdings kann man leicht in Probleme laufen, wenn man die Assembly dann nicht in den GAC installiert (Pfade). Deshalb
sollte man noch
</p>

<pre style="background='silver';">
F:\Inetpub\wwwroot\AspHeute\dotnetccw>gacutil /i ImageInfo.dll

Microsoft (R) .NET Global Assembly Cache Utility.  Version 1.0.3705.0
Copyright (C) Microsoft Corporation 1998-2001. All rights reserved.

Assembly successfully added to the cache
</pre>


<p>
ausf&uuml;hren. Damit ist die Assembly von allen Applikationen aus verwendbar, und ein potentielles Problem ausger&auml;umt, das einem
stundenlange Fehlersuche bereiten kann.
</p>

<h3>.NET Komponente verwenden</h3>
<p>
Als Beispiel habe ich die .NET Komponente im Windows Scripting Host verwendet (es soll ja so einfach wie m&ouml;glich sein). Die
ProgId einer .NET Komponente ist <i>Namespacename.Classname</i>, also in unserem Falle <i>AspHeute.ImageInfo</i>. Damit sieht
der Sourcecode in <b>demo.vbs</b> so aus:
</p>

<pre style="background='silver';">
strImageFile = "myImage.jpg"
bLoadedOK = True
Set imgInfo = WScript.CreateObject("AspHeute.ImageInfo")

On Error Resume Next
imgInfo.Load strImageFile

If Err.Number &lt;&gt; 0 Then
  Wscript.Echo Err.Description
  bLoadedOK = False
End If

If (bLoadedOK) Then
  Wscript.Echo "Breite: " &amp; imgInfo.Width &amp; ", H&ouml;he: " &amp; imgInfo.Height &amp; ", Bildformat: " &amp; imgInfo.Format
End If

imgInfo.Close
Set imgInfo = Nothing
</pre>

<p>
Dieser Code kann auch in VB6 oder Office Applikationen eingesetzt werden. Und schon hat man Funktionalit&auml;t in seiner alten Applikation,
von der man ohne externe Komponente nur tr&auml;umen konnte.
</p>

<h2>Schlu&szlig;bemerkung</h2>
<p>
Dieser Artikel soll als Kochrezept und Ermunterung dazu dienen, existierende Anwendungen mit in .NET geschriebenen Komponenten zu
erweitern und zu verbessern. Der Nutzen steht einem sehr geringem Aufwand gegen&uuml;ber.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p>
<h2>Download des Codes</h2>
<p><a href="../Code/20020702.zip">Klicken Sie hier</a>, um den Download zu starten.<br><SPAN class="content">http://www.aspheute.com/code/20020702.zip</span></p>
<h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20001130.htm">Bildinformationen selbst ermitteln</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20001130.htm</span><br>
<a href="../artikel/20020703.htm">Eine kleine Bilddatenbank, Teil 1</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020703.htm</span><br>
<a href="../artikel/20000728.htm">On-the-fly Generierung von Graphiken</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000728.htm</span><br>
<a href="../artikel/20000824.htm">Scrapen von Webseiten</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000824.htm</span><br>
<a href="../artikel/20020225.htm">Thumbnailgenerierung in .NET</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20020225.htm</span><br>
<a href="../artikel/20000828.htm">Verwenden von COM Komponenten in ASP.NET</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000828.htm</span><br>
<a href="../artikel/20000825.htm">WHOIS Abfragen a la .NET</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000825.htm</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
