<HTML>
<HEAD>
<TITLE>Programmierer hilft Programmierer</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Wer kennt das nicht - man kommt bei der L&ouml;sung eines Problems einfach nicht weiter, oder man wei&szlig; nicht, wie man es am besten anpacken soll. Wenn man doch einen anderen Programmierer fragen k&ouml;nnte... man kann! Und zwar in Mailinglisten.">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Diskussionsliste,Mailingliste,Peer to peer,support,Unterstützung,Hilfe,gegenseitig,Liste,Programmierer,Code,Forum,Newsgroup,Newsgruppen,Foren">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Programmierer hilft Programmierer</H1>
<p>
Geschrieben von: <a href="../autoren/christophwille.htm">Christoph Wille</a><br>
Kategorie: <a href="../kategorien/ASP%20Grundlagen.htm">ASP Grundlagen</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20021230"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Wer kennt das nicht - man kommt bei der L&ouml;sung eines Problems einfach nicht weiter, oder man wei&szlig; nicht, wie man es am besten
anpacken soll. Wenn man doch einen anderen Programmierer fragen k&ouml;nnte... man kann! Und zwar in Mailinglisten, die auf dem Prinzip
der gegenseitigen Hilfe aufbauen. Der heutige Artikel stellt Ihnen die wichtigsten deutschen Diskussionslisten zu ASP und 
ASP.NET vor.
</p>
<p>
Die gegenseitige Hilfe von Programmierern (oder Usern) zu bestimmten Themen findet &uuml;blicherweise auf eine von drei Arten statt: 
Web-basierte Foren, Newsgroups oder Mailinglisten. Im Prinzip ist es pers&ouml;nliche Pr&auml;ferenz, welche der drei Arten man vorzieht.
Allerdings bieten Mailinglisten einige Vorteile: die neuen Postings kommen automatisch per Email, und im Gegensatz zu Foren am Web
verstecken sich die Teilnehmer nicht hinter Pseudonymen (was die Qualit&auml;t der Postings deutlich erh&ouml;ht, da ja der eigene
Name draufsteht).
</p>
<p>
Der Hauptzweck von Programmierermailinglisten ist, sich gegenseitig bei Problemen zu helfen. Diskussionslisten leben von der 
regen Teilnahme durch ihre Mitglieder, und &uuml;ber eines sollte man sich klar sein: alle machen freiwillig mit, eine Garantie f&uuml;r
eine Antwort / L&ouml;sung gibt es nicht - aber die Chancen sind sehr gut. Um die Chancen f&uuml;r andere zu erh&ouml;hen, sollte man auch
selbst antworten wenn man eine L&ouml;sung anzubieten hat - der Fragende wird es zu danken wissen.
</p>

<p>
Beginnen wir nun bei den allgemeinen Diskussionslisten die es f&uuml;r ASP und ASP.NET Programmierer gibt:
</p>

<ul>
	<li><a href="20021230.htm#jobmarket">Jobmarket</a> - Die Jobb&ouml;rse
	<li><a href="20021230.htm#coffeehouse">Coffeehouse</a> - Unser Kaffeehaus
</ul>

<p>
Die Jobb&ouml;rse ist f&uuml;r jeden interessant, der Jobs sucht oder Jobs zu vergeben hat. Der Traffic h&auml;lt sich verst&auml;ndlicherweise
in Grenzen, aber es gibt keinen besseren Platz einen Job zu suchen oder anzubieten. Im Gegensatz dazu geht es im 
Kaffeehaus "lauter" zu, denn hier darf &uuml;ber alles diskutiert werden. Ein gem&uuml;tlicher Plausch unter Kollegen, der zur Verbesserung
der Beziehungen unter den Listenmitgliedern dient.
</p>

<p>
Wer mit klassischem ASP zu tun hat, wird sich &uuml;ber diese Listen freuen (Details durch Klick auf den entsprechenden Link):
</p>

<ul>
	<li><a href="20021230.htm#beginners.asp">Beginners.ASP</a> - Die Liste f&uuml;r ASP-Anf&auml;nger
	<li><a href="20021230.htm#advanced.asp">Advanced.ASP</a> - Diskussionsliste f&uuml;r ASP Profis
	<li><a href="20021230.htm#database.asp">Database.ASP</a> - Fragen rund um Datenbanken und ASP
	<li><a href="20021230.htm#webfarm.admin">Webfarm.Admin</a> - Wie konfiguriere ich meine(n) Server?
	<li><a href="20021230.htm#xml.asp">Xml.ASP</a> - Wie verwende ich XML am Server?
	<li><a href="20021230.htm#golf.asp">ASP Golf</a> - Wessen Code ist kleiner?
</ul>

<p>
Die ersten f&uuml;nf Diskussionslisten sind selbsterkl&auml;rend, die ASP Golf Liste ben&ouml;tigt ein wenig Voraberkl&auml;rung: hierbei handelt
es sich um Programmierwettbewerbe, bei denen derjenige gewinnt, der eine gestellte Aufgabe mit dem k&uuml;rzesten Code zu l&ouml;sen 
vermag. Hierbei lernt man sehr viel &uuml;ber ASP und VBScript, und verbessert so sein grundlegendes Verst&auml;ndnis der Technologie
und der m&ouml;glichen Tricks bei der L&ouml;sung eines kniffligen Problems.
</p>

<p>
Die Beliebtheit von .NET und ASP.NET im speziellen ist stark im Steigen begriffen. Deshalb gibt es auch f&uuml;r diese Programmierer
einige Listen, um Programmierfragen in der Expertenrunde zu stellen:
</p>

<ul>
	<li><a href="20021230.htm#asp.net">ASP.NET</a> - Alles f&uuml;r den ASP.NET Web Forms Programmierer
	<li><a href="20021230.htm#webservices.net">Web Services</a> - Diskussions rund um ASP.NET Web Services
	<li><a href="20021230.htm#csharp.net">C#</a> - Fragen rund um die Programmiersprache C#
	<li><a href="20021230.htm#vb.net">Visual Basic.NET</a> - Unsere Mailingliste f&uuml;r VB.NET Programmierer
	<li><a href="20021230.htm#framework.net">.NET Framework</a> - Fragen und Antworten rund um das .NET Framework
	<li><a href="20021230.htm#ado.net">ADO.NET</a> - Datenbankzugriff unter .NET
	<li><a href="20021230.htm#security.net">.NET Security</a> - Fragen und Hinweise zur Sicherheit von .NET Anwendungen
</ul>

<p>
Klarerweise ist ASP.NET die Hauptliste der .NET Listen, da dies die interessanteste Technologie des ganzen .NET Frameworks
ist. Mit Sicherheit werden in Zukunft weitere Listen rund um .NET dazukommen, da wir erst am Anfang dieser Technologie stehen.
</p>

<h2>Allgemeine Listen</h2>

<a name="jobmarket"></a>
<p><strong>Jobmarket - Die Jobb&ouml;rse</strong><br>
Diese Liste dient als Jobb&ouml;rse f&uuml;r Jobsuchende und Firmen, die ASP / VB6 / .NET Programmierer suchen. Ob es ein
projektbezogenes Angebot ist, eine permanente Stelle oder das Angebot zu einer gemeinsamen Firmengr&uuml;ndung -
all dies ist auf dieser Liste gerne gesehen.
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/jobmarket.asp">Anmelden</a> und weitere Infos
</center>
</p>

<a name="coffeehouse"></a>
<p><strong>Coffeehouse - Unser Kaffeehaus</strong><br>
Der Ort f&uuml;r ungezwungene Unterhaltungen der ASP / .NET Programmierer zu verschiedenen Off-topic Themen.
Ziel ist es, eine Community f&uuml;r deutschsprachige Programmierer zu bilden, und es soll sich das 
Ganze in einer entspannten Atmosph&auml;re abspielen. Hier sollte jeder angemeldet sein!
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/coffeehouse.asp">Anmelden</a> und weitere Infos
</center>
</p>

<h2>ASP Mailinglisten</h2>

<a name="beginners.asp"></a>
<p><strong>Beginners.ASP - Die Liste f&uuml;r ASP-Anf&auml;nger</strong><br>
Wer gerade mit ASP begonnen hat, ist in dieser Liste am besten aufgehoben. Hier darf alles gefragt werden,
was nur irgendwie in Zusammenhang mit ASP steht - es gibt keine Trennung zwischen Datenbankfragen, VBScript
Fragen, Email usw. Das Ziel ist es, da&szlig; sich Anf&auml;nger gegenseitig helfen, allerdings sind f&uuml;r verzwickte Probleme
auch Profis auf der Liste, die Euch gerne weiterhelfen werden!
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/beginners.asp">Anmelden</a> und weitere Infos
</center>
</p>

<a name="advanced.asp"></a>
<p><strong>Advanced.ASP - Diskussionsliste f&uuml;r ASP Profis</strong><br>
Diese Liste ist - zusammen mit Database.ASP - der logische n&auml;chste Schritt nach Beginners.ASP. Es wird vorausgesetzt,
da&szlig; die Listenteilnehmer bereits mit ASP umgehen k&ouml;nnen, und die Fragen sich um spezielle Probleme und 
Implementierungsproblemstellungen drehen.
</p>
<p>
In dieser Liste werden ASP bezogene Fragen gestellt und beantwortet - jeder darf fragen, und jeder sollte
antworten, wenn er eine L&ouml;sung parat hat. Die genauen Regeln wie Fragen gestellt werden sollten (damit
die Hilfe m&ouml;glichst effektiv wird), und wie man jemanden mit seiner Antwort am besten helfen kann, ist
am Anmeldeformular ersichtlich. F&uuml;r IIS/NT/ASP Administrationsfragen gibt es die Webfarm.Admin Liste!
(Datenbankfragen werden in Database.ASP behandelt)
</p>
<p>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/Advanced.asp">Anmelden</a> und weitere Infos
</center>
</p>

<a name="database.asp"></a>
<p><strong>Database.ASP - Fragen rund um Datenbanken und ASP</strong><br>
Diese Liste ist ebenfalls f&uuml;r Aufsteiger aus Beginners.ASP angesetzt (Anf&auml;ngerdatenbankfragen werden in
Beginners.ASP beantwortet). Hier dreht es sich schon um verzwicktere Probleme.
</p>
<p>
Wer Fragen rund um Datenbanken hat, der sollte an dieser Liste teilnehmen. Hier werden ADO, ASP, OLE DB und
SQL Themen behandelt.
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/Database.asp">Anmelden</a> und weitere Infos
</center>
</p>

<a name="webfarm.admin"></a>
<p><strong>Webfarm.Admin - Wie konfiguriere ich meine(n) Server?</strong><br>
Um allen die M&ouml;glichkeit zu geben, Fragen rund um die Administration von Windows NT/2000, von Websites,
COM+ Applikationen uvm aus dem Administrationsbereich stellen zu k&ouml;nnen, haben wir diese Administrationsliste
eingerichtet.
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/webfarm.admin.asp">Anmelden</a> und weitere Infos
</center>
</p>

<a name="xml.asp"></a>
<p><strong>Xml.ASP - Wie verwende ich XML am Server?</strong><br>
In der Xml.ASP Liste werden Fragen rund um die Verwendung von XML mit ASP behandelt. Dazu geh&ouml;rt die
serverseitige Verwendung von XSL (Stylesheets), genauso wie das XML DOM (Document object model).
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/xml.asp">Anmelden</a> und weitere Infos
</center>
</p>


<a name="golf.asp"></a>
<p><strong>ASP Golf - Wessen Code ist kleiner?</strong><br>
Ziel eines Golfturnieres ist, mit m&ouml;glichst wenig Code die Problemstellung zu l&ouml;sen. Detaillierte Informationen 
zu den Regeln und Turnieren findet Ihr unter <a href="http://www.aspgerman.com/golf/">http://www.aspgerman.com/golf/</a>
<br>&nbsp;<br>
<center>
<a href="http://www.aspgerman.com/aspgerman/listen/anmelden/golf.asp">Anmelden</a> und weitere Infos
</center>
</p>

<h2>.NET Mailinglisten</h2>
<p>
<a name="asp.net"></a>
<strong>ASP.NET - Alles f&uuml;r den ASP.NET Web Forms Programmierer</strong><br>
Es wird &uuml;ber ASP.NET, C#, ADO.NET und das .NET Framework SDK diskutiert. 
Jeder, der ASP.NET programmiert, sollte in dieser Liste angemeldet sein! 
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/aspdotnet.asp">Anmelden</a> und weitere Infos
</center>
</p>

<p>
<a name="webservices.net"></a>
<strong>.NET Web Services - Diskussions rund um ASP.NET Web Services</strong><br>
In dieser Liste wird &uuml;ber Web Services diskutiert, was nat&uuml;rlich auch SOAP, WSDL
und anderes mehr umschlie&szlig;t. Clientprogrammierung ist hier nat&uuml;rlich auch ein Thema.
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/webservices.asp">Anmelden</a> und weitere Infos
</center>
</p>

<p>
<a name="csharp.net"></a>
<strong>C# - Fragen rund um die Programmiersprache C#</strong><br>
In dieser Liste wird &uuml;ber C# Themen diskutiert - von der einfachen Klassenprogrammierung bis hin
zu komplizierten Services. Komponentenprogrammierer sind in dieser Liste ebenso herzlich willkommen.
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/csharp.asp">Anmelden</a> und weitere Infos
</center>
</p>

<p>
<a name="vb.net"></a>
<strong>Visual Basic.net - Unsere Mailingliste f&uuml;r VB.NET Programmierer</strong><br>
Diese Liste ist f&uuml;r alle VB.NET Programmierer gedacht - Neueinsteiger als auch VB6 Umsteiger.
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/vbdotnet.asp">Anmelden</a> und weitere Infos
</center>
</p>

<p>
<a name="framework.net"></a>
<strong>.NET Framework - Fragen und Antworten rund um das .NET Framework</strong><br>
Das .NET Framework beeinhaltet tausende Klassen, mit denen man unter anderem Windows Programme
oder seinen eigenen Web Server programmieren kann. Da&szlig; dabei nat&uuml;rlich Fragen auftauchen, welche
Klassen man wie einsetzen soll, ist verst&auml;ndlich. Hierbei hilft diese Liste.
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/framework.asp">Anmelden</a> und weitere Infos
</center>
</p>

<p>
<a name="ado.net"></a>
<strong>ADO.NET - Datenbankzugriff unter .NET</strong><br>
In dieser Liste geht es um ADO.NET - Themengebiete umfassen DataReader, DataViews, SQL und
ADO Managed Provider. Nicht diskutiert wird hier ADO "Classic" (2.x).
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/adodotnet.asp">Anmelden</a> und weitere Infos
</center>
</p>

<p>
<a name="security.net"></a>
<strong>.NET Security - Fragen und Hinweise zur Sicherheit von .NET Anwendungen</strong><br>
Wer Fragen zu .NET und Security hat, ist hier richtig. Es wird &uuml;ber Code Access Security,
Location Security und vieles mehr diskutiert. Diese Liste ist moderiert.
<br>&nbsp;<br>
<center>
<a href="http://www.dotnetgerman.com/listen/security.asp">Anmelden</a> und weitere Infos
</center>
</p>


<h2>Schlu&szlig;bemerkung</h2>
<p>
Diskussionslisten "leben" durch ihre Teilnehmer - Fragen stellen und Antworten geben ist das Recht jedes Teilnehmers. Machen
Sie davon regen Gebrauch!
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Easpgerman%2Ecom%2F">AspGerman - ASP Diskussionslisten</a><br>
<SPAN class="content">http://www.aspgerman.com/</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Edotnetgerman%2Ecom%2F">DotNetGerman - .NET Diskussionslisten</a><br>
<SPAN class="content">http://www.dotnetgerman.com/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
