<HTML>
<HEAD>
<TITLE>Minigolf - 99 Bottles of Beer</TITLE>
<META HTTP-EQUIV="content-type: text/html; charset= ISO-8859-1">
<META HTTP-EQUIV="Content-Language" CONTENT="DE">
<META NAME="robots" CONTENT="FOLLOW,INDEX">
<META NAME="generator" CONTENT="Xitra Site Publishing">
<meta name="Author" content="webmaster@aspheute.com">

<META NAME="revisit-after" CONTENT="21 days">
<META NAME="copyright" CONTENT="(c) 2000-2006. Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich geschützt.">
<META HTTP-EQUIV="expires" CONTENT="1999-03-30T00:00:00+00:00"> 
<META HTTP-EQUIV="Pragma" CONTENT="no-cache">
<META HTTP-EQUIV="Cache-Control" CONTENT="no-store">

<meta http-equiv="Description" name="Description" content="Damit ein wenig Abwechslung ins Golferleben kommt, wurde dieses Mal ein Kurzturnier mit nur 48 Stunden Dauer ausgetragen - Minigolf sozusagen. Die Aufgabe war nat&uuml;rlich passend zum St. Patrick's Day gew&auml;hlt...">
<meta http-equiv="Keywords" name="Keywords" content="ASP,Active Server Pages,IIS,Internet Information Server,PWS,Personal Web Server,ADO,Golf,Tee Off,St. Patrick,Day,Bier,99 Bottles of Beer,Minigolf,ASP Golf,Codegolf,golfen,Golfer,Kurzturnier,Turnier,Abschlag,Fore">
<link rel="stylesheet" href="../includes/default.css">
</HEAD>
<BODY BGCOLOR="#ffffff" >


<div style="border-bottom: solid 5px white;">
<div class="DotNetGermanCommunityBar">
    <a href="http://www.glengamoi.com">Glengamoi (Forum)</a> &middot;
    <a href="http://www.aspheute.com/" style="font-weight: bold">AspHeute</a> &middot;
    <a href="http://dotnetheute.com/">.NET Heute (RSS-Suche)</a> &middot;
    <a href="http://aspxfiles.com/">AspxFiles (Wiki)</a> &middot;
    <a href="http://blogs.dotnetgerman.com/">.NET Blogs</a>
</div>
</div>


<H1>Minigolf - 99 Bottles of Beer</H1>
<p>
Geschrieben von: <a href="../autoren/bernhardspuida.htm">Bernhard Spuida</a><br>
Kategorie: <a href="../kategorien/Tee%20Off.htm">Tee Off</a><br>
<SCRIPT src="/service/artikelbewertung.asp?Artikel=20030324"></SCRIPT>
</p>


<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><p>
Damit ein wenig Abwechslung ins Golferleben kommt, wurde dieses Mal ein
Kurzturnier mit nur 48 Stunden Dauer ausgetragen - Minigolf sozusagen. Die
Aufgabe war nat&uuml;rlich passend zum St. Patrick's Day gew&auml;hlt...
</p>

<h2>Die Aufgabenstellung</h2>
<p>
Ein m&ouml;glichst kurzes ASP-Programm das den Text des Klassikers
"99 Bottles of Beer" ausgibt. Zu finden ist der Text hier:
<a href="http://www.noodleroni.com/beerlyrics.txt" target="_blank">http://www.noodleroni.com/beerlyrics.txt</a>
</p>

<p>
Bitte beachten, da&szlig; die letzten zwei Strophen korrekt gedruckt
werden m&uuml;ssen - schwindlige "bottle(s)" gelten nicht!
Dieses Mal gibt es in Anbetracht der kurzen Dauer keinen offiziellen
Tester da keine Testdaten geladen werden m&uuml;ssen, Ausgabe direkt
auf den Bildschirm.
</p>
<p>
Eine einfache, nahezu triviale Aufgabe nicht wahr? Wir werden ja sehen.
</p>

<h2>Nun zum Leaderboard</h2>
<ul>
	<li>1. Gerhard Buchner 104</li>
	<li>2. Alexander Zeitler 105</li>
	<li>3. Wolfgang Kluge 109</li>
	<li>4. Michael Guder 142</li>
	<li>5. Charles Bischof 175</li>
	<li>6. Roman Pitroff 189</li>
	<li>7. Stefan Mayer 196</li>
	<li>8. Michele Marsching 209</li>
	<li>8. Christian Rudig 209</li>
	<li>10. Joachim van der Bruck 227</li>
	<li>11. Andreas Roth 232</li>
	<li>12. Michael Schmidt 235</li>
	<li>13. Daniel Daxl 270</li>
	<li>14. Martin Huber 288</li>
	<li>15. Markus Oesterreicher 297</li>
</ul>

<p>
Der Bunker war am Ende des Turniers dieses Mal erfreulicherweise leer.
</p>

<p>
Aus Gr&uuml;nden die wir sp&auml;ter erkl&auml;ren werden kann man auch ein zweites, 'echtes'
Leaderboard erstellen:
</p>

<ul>
	<li>1. Gerhard Buchner 183</li>
	<li>2. Roman Pitroff 189</li>
	<li>3. Stefan Mayer 196</li>
	<li>4. Michele Marsching 209</li>
	<li>5. Christian Rudig 209</li>
	<li>6. Joachim van der Bruck 227</li>
	<li>7. Andreas Roth 232</li>
	<li>8. Michael Schmidt 235</li>
	<li>9. Daniel Daxl 270</li>
	<li>10. Martin Huber 288</li>
	<li>11. Markus Oesterreicher 297</li>
</ul>

<p>
Genug der Vorrede, auf zur Vorstellung einiger interessanter L&ouml;sungen. Die
Ans&auml;tze variieren st&auml;rker als man bei dieser simplen Aufgabe meinen k&ouml;nnte.
</p>

<h2>Gerhard Buchner</h2>
<p>
<i>Fangen wir mal mit einem offensichtlichen, geradezu 'klassischen' Ansatz an.
Gerhards L&ouml;sung sei Stellvertreter f&uuml;r alle anderen Golfer die eine L&ouml;sung im Sinne
der Regeln eingeschickt haben:</i>
</p>
<p>
M&ouml;chte Euch aber zumindest den Code meiner "echten geskripteten" Version
mit 183 Zeichen nicht vorenthalten :-)
</p>

<pre>
&lt;%h=" bottle"
c=h&amp;"s"
g=" of beer"
b=" on the wall"
y=",&lt;br&gt;"
z="No More"&amp;c&amp;g
for i=1to 99
f=i&amp;h&amp;g
x=f&amp;b&amp;y&amp;f&amp;y&amp;"Take one down, pass it around"&amp;y&amp;z&amp;b&amp;".&lt;br&gt;&lt;br&gt;"&amp;x
z=f
h=c
next%&gt;&lt;%=x%&gt;
</pre>

<p>
Dort habe ich versucht den Text so weit wie m&ouml;glich zu zerpfl&uuml;cken, in
Variablen zu speichern und diese dann gezielt wieder zusammen zu setzen.
Am besten hatte dies funktioniert als ich von unten nach oben zuerst alles
in einer Variablen gespeichert hatte und erst zum Schlu&szlig; ausgegeben.
</p>
<p>
<i>Anmerkungen: So geh&ouml;rt sich das. Einfach und bis auf das Minimum reduziert.
Die Idee ist bei allen 'richtigen' L&ouml;sungen die gleiche: in einer Schleife runter
z&auml;hlen und die Sonderf&auml;lle der letzen zwei Strophen abfangen, dann Ausgabe im Browser.
Und nun auf zu den 'kreativen' L&ouml;sungen.</i>
</p>

<h2>Wolfgang Kluge</h2>
<p>
<i>In diesem Minigolf der kreativste Golfer. Unglaublich was man nicht alles
tun kann um den Buchstaben, aber nicht den Sinn der Regeln (Ein bekannter
Software-Hersteller macht uns das ja seit Jahren erfolgreich vor) zu erf&uuml;llen:</i>
</p>
<p>
Mein erster "einfacher" L&ouml;sungsvorschlag wurde ja nicht angenommen :(
Vorenthalten will ich diesen deswegen aber noch lange nicht ;)
</p>
<p>
Der - laut Bernhard "aehm kreative" - Vorsto&szlig; w&auml;re 117 (am Anfang mal 129)
Bytes lang gewesen - zwar arg zusammengemogelt, aber wenn Windows es sagt
mu&szlig; es doch wohl stimmen.
</p>

<pre>
&lt;%=createObject("scripting.filesystemobject").
OpenTextFile(Request.ServerVariables("PATH_TRANSLATED")&amp;":a").readall%&gt;
</pre>

<p>
Trick dabei w&auml;re gewesen, den gesamten Text in einem weiteren Filestream
namens "a" (geht nur unter NTFS) zu halten. Windows zeigt nur die Gr&ouml;&szlig;e
des Hauptstreams an - so war's gedacht. Allerdings wurde es 1. nicht
zugelassen und 2. wurde der Stream nicht mit &uuml;bertragen (weitere Versuche
blieben allerdings auch gleich aus *g*)
</p>

<p>
Mehr dazu ist hier zu finden: <a href="../artikel/20000821.htm">Streams in NTFS Dateien</a>
</p>

<p>
Der 2. kreative Versuch wurde dann angenommen.
Diese L&ouml;sung ist dann zwar auch mehr k&uuml;nstlerischer Natur als ein
"so-programmiert-man-richtig"-Werk, aber es ist ja Golf.
</p>

<p>
Hier sind es dann 166 Bytes.
</p>

<pre>
&lt;%c=split(right(Request.ServerVariables("URL"),133),2)
for i=1to 99
j=i&amp;c(1)&amp;a
o=replace(replace(replace(c(2),c(3),"&lt;br&gt;"),1,j),"y",c(0))&amp;o
c(0)=j
a="s"
next
%&gt;&lt;%=o%&gt;
</pre>

<p>
Der Clou hierbei war, die Datei entsprechend zu nennen: In diesem Fall
"<i>No More bottles2 bottle21 of beer on the wall,.asp1 of beer,.aspTake one
down, pass it around,.aspy of beer on the wall..asp.asp2.asp</i>"
</p>
<p>
Der Dateiname ist damit 133 Zeichen lang (was unter Windows keinerlei
Auswirkungen auf die Dateigr&ouml;&szlig;e hat *g*!!). Die 2 dient als Trennzeichen
(Split), die 1 wird ersetzt durch die erste Zahl + "bottel(s)" und "y"
durch die 2. Zahl bzw. "No More". ".asp" wird zum Schlu&szlig; noch durch &lt;BR&gt;&acute;s
ersetzt - Der Rest ist gleich wie bei der letzten L&ouml;sung.
</p>
<p>
Und damit kommen wir zur "normalsten" L&ouml;sung mit 184 Bytes:
</p>

<pre>
&lt;%m=" of beer on the wall"
k="No More bottles"
t="&lt;BR&gt;"
for i=1to 99
j=i&amp;" bottle"&amp;a
o=j&amp;m&amp;","&amp;t&amp;j&amp;" of beer,"&amp;t&amp;"Take one down, pass it around,"&amp;t&amp;k&amp;m&amp;"."&amp;t&amp;t&amp;o 
k=j
a="s"
next%&gt;&lt;%=o%&gt;
</pre>

<p>
Hier ist ja eigentlich alles klar. Durch das "R&uuml;ckw&auml;rts"-Zusammensetzen
der Variable o spar' ich mir "Step-1" in der Schleife. If-Abfragen erspar'
ich mir, indem zuerst k auf "No More bottles" und sp&auml;ter (nach dem
zusammensetzen) dann auf die vorherige Ausgabevariable j gesetzt wird.
Gleiches gilt f&uuml;r "bottles" mit und ohne "s".
</p>
<p>
Die 109 sahen dann so aus... Wohl dem, der eine k&uuml;rzere Domain hat.
</p>

<pre>
&lt;%set t=createObject("MSXML2.ServerXMLHTTP")
t.open"GET","http://www.vbwelt.de/b"
t.send%&gt;&lt;%=t.responseText%&gt;
</pre>

<p>
Aber gegenteilig zu Chris&acute;s Ausf&uuml;hrung ist das "XMLHTTP"-Objekt doch
k&uuml;rzer zu verwenden. Mit 101 Bytes (leider zu sp&auml;t eingereicht, 15:04)
w&auml;re diese L&ouml;sung sehr wohl durchgekommen (statt "false" eben ",0"):
</p>

<pre>
&lt;%set t=createObject("MSXML2.XMLHTTP")
t.open"GET","http://vbwelt.de/b",0
t.send%&gt;&lt;%=t.responseText%&gt;
</pre>

<p>
Und dann noch eine L&ouml;sung, die ich erst gar nicht vorschlagen wollte (ich
will nicht geschlagen werden). Diese ist mit 41 Bytes dabei ;) (Die Datei
auf dem Server m&uuml;sste ich aber noch anpassen, damit die Umbr&uuml;che korrekt
angezeigt werden):
</p>

<pre>
&lt;%response.redirect"http://vbwelt.de/b"%&gt;
</pre>

<p>
<i>Anmerkungen: Sch&ouml;n gegolft! Kreativ gegolft! Einige Details in den Regeln
werden f&uuml;r zuk&uuml;nftige Turniere ge&auml;ndert werden, mehr dazu weiter unten.</i>
</p>

<p>
<i>Der erste Ansatz kann nicht au&szlig;erhalb der Entwicklungsmaschine funktionieren,
da zus&auml;tzliche Streams gew&ouml;hnlich nur vom Programm das die Datei erstellt hat erkannt werden.
Wird die Datei kopiert, geht der Stream verloren, da ihn zum Beispiel ein Email-Client
nicht in das Attachment mit &uuml;bernimmt. Trotzdem originelle Idee. Nummer zwei kann
in einem 'normalen' Golfturnier nicht angewandt werden, da der Dateiname aus dem
Teilnehmernamen und einer laufenden Nummer gebildet wird. Der XMLHTTP-Ansatz wird
im Folgenden noch weiter diskutiert. Und das Response.Redirect - einfach Pfui!
So etwas ist wirklich kein Golf.</i>
</p>

<h2>Michael Guder</h2>
<p>
OK, ich sch&auml;me mich ja schon ... meine L&ouml;sung, die auch akzeptiert wurde:
</p>

<pre>
1:&lt;%set s=createobject("Internetexplorer.Application")
2:s.navigate("www.wig3.de/b")
3:while s.ReadyState&lt;&gt;4
4:wend%&gt;&lt;%=s.Document.Body.InnerText%&gt;
</pre>

<p>
1: ich mach's mit dem IE direkt ... erzeuge mir also ein Object<br>
2: navigiere zu einer URL wo das komplette File liegt...<br>
3: frage ab, ob der schon fertig ist ...<br>
4: gebe den Body des Dokuments aus ..<br>
</p>

<p>
<i>Diese L&ouml;sung ist kreativ, elegant und erf&uuml;llt den Buchstaben der Aufgabenstellung
perfekt - vorausgesetzt auf dem Server ist der Internet Explorer vorhanden...</i>
</p>

<h2>Christoph Wille</h2>
<p>
<i>Christoph in seiner Rolle als Schiedsrichter kann nat&uuml;rlich nicht in die
offizielle Wertung aufgenommen werden, aber seine Erkl&auml;rung des L&ouml;sungsweges mittels
XMLHTTP soll trotzdem wiedergegeben werden, immerhin hat er diesen Ansatz als
erster entdeckt:</i>
</p>

<p>
Meine L&ouml;sung reizt sowohl die Angabe als auch die Regeln des Golfens bis
aufs letzte aus. Wolfgang Kluge (er als erster) und andere sind mir im
Laufe des Turniers noch auf die Schliche gekommen, was ich gemacht habe.
Stellvertretend erkl&auml;re ich meine und zeige dann noch Wolfgang's
weiterf&uuml;hrendes runtergolfen.
</p>
<p>
Rekapitulieren wir einmal die wichtigsten Teile der Angabe:
</p>

<p>
"Ein m&ouml;glichst kurzes ASP-Programm das den Text des Klassikers "99 Bottles
of Beer" ausgibt."
</p>

<p>
Die Betonung liegt auf "ausgibt", sp&auml;ter kommt auch noch "da&szlig; die letzten
zwei Strophen korrekt gedruckt werden m&uuml;ssen". Gut. Sehen wir uns eine
wichtige Golfregel an:
</p>
<p>
"Verwendung externer Komponenten au&szlig;er solchen die im Betriebssystem
ausgeliefert werden (zB CDONTS) ist nicht erlaubt. "
</p>
<p>
Was jetzt kommt kann sich der geneigte Leser vielleicht schon denken, wenn
man an Bernd's Angabe sich erinnert - da war doch die URL vom Liedtext...
hier also meine erste L&ouml;sung mit 165 Bytes:
</p>

<pre>
&lt;%
Set o = CreateObject("MSXML2.ServerXMLHTTP")
o.open "GET", "http://www.noodleroni.com/beerlyrics.txt"
o.send
Response.Write Replace(o.responseText,vbLf,"&lt;br&gt;")
%&gt;
</pre>

<p>
Leerzeichen, wie verschwenderisch (die kamen erst viel sp&auml;ter raus...)!
Das Problem warum ich Replace brauche ist da&szlig; es sich beim Text um .txt
handelt, und der dann im Browser nicht korrekt mit Zeilenumbr&uuml;chen
dargestellt wird, das vbLf weil es ein Unix-System war.
</p>
<p>
Das war klarerweise zu viel, aber wie bekomme ich die Zeilenumbr&uuml;che
"billiger"? Siehe da:
</p>

<pre>
&lt;pre&gt;&lt;%
Set o = CreateObject("MSXML2.ServerXMLHTTP")
o.open "GET", "http://www.noodleroni.com/beerlyrics.txt"
o.send
Response.Write o.responseText
%&gt;
</pre>

<p>
Wer sagt, da&szlig; man ein PRE Tag korrekt zumachen mu&szlig;? Neee. 16 Bytes gespart
(das war dann die eingereichte 149er L&ouml;sung).
</p>
<p>
Noch ist nicht aller Tage Abend, da geht noch was. Ich kann Response.Write
durch &lt;%=%&gt; ersetzen:
</p>

<pre>
&lt;pre&gt;&lt;%
Set o = CreateObject("MSXML2.ServerXMLHTTP")
o.open "GET", "http://www.noodleroni.com/beerlyrics.txt"
o.send
%&gt;&lt;%=o.responseText%&gt;
</pre>

<p>
Damit sind wir bei 138. Da mu&szlig; doch noch was gehen... Klar, viele Website
mappen nicht nur www.domain.com auf den Webserver, sondern auch
domain.com:
<p>

<pre>
&lt;pre&gt;&lt;%
Set o = CreateObject("MSXML2.ServerXMLHTTP")
o.open "GET", "http://noodleroni.com/beerlyrics.txt"
o.send
%&gt;&lt;%=o.responseText%&gt;
</pre>

<p>
Yes, somit sind wir auf 134 Bytes ("www." = 4 Bytes). Noch schnell die
Leerzeichen bei Set o= und "GET"," rausnehmen, und es sind nur noch 131.
</p>
<p>
Den Trick, den ich dann auspacken wollte, der hat nicht hingehauen - das
Ersetzen des Domainnamens durch die IP Adresse (h&auml;tte direkt 1 Byte, bzw
mehr durch alternative Codierung gebracht). Leider verwenden die
Herrschaften Host Header auf dem Web Server, schade schade. Klar h&auml;tte ich
es auf einen eigenen Server mit kurzer IP legen k&ouml;nnen, aber das war mir
dann zu m&uuml;hsam gewesen - aber das hat dann Wolfgang ausgepackt, der wie
Alex Zeitler (und Buchi) auch auf die Idee gekommen ist (109 Bytes):
</p>

<pre>
&lt;%set t=createObject("MSXML2.ServerXMLHTTP")
t.open"GET","http://www.vbwelt.de/b"
t.send%&gt;&lt;%=t.responseText%&gt;
</pre>

<p>
Einfach fertig formatiert auf den eigenen Server gelegt, presto.
Allerdings: er h&auml;tte noch 4 Byte auf 105 runtergolfen k&ouml;nnen, weil auch
bei seinem Server ist "www." nicht notwendig.
</p>
<p>
Zum "Abrunden" eine weitere meiner L&ouml;sungen, die tats&auml;chlich funktioniert,
aber einen gewissen kreativen Wahnsinn erkennen l&auml;&szlig;t (138 Bytes):
</p>

<pre>
&lt;pre&gt;&lt;%
With CreateObject("Msxml2.ServerXmlHttp")
.open "GET","http://noodleroni.com/beerlyrics.txt"
.send%&gt;&lt;%=.responseText%&gt;&lt;%End With%&gt;
</pre>

<p>
<b>Schirimitteilung: in Zukunft wird - au&szlig;er es ist bei einem Turnier
explizit erlaubt - das Abholen von statischen oder dynamischen
Inhalten/Rechenergebnissen von fremden Servern via XmlHTTP nicht mehr
erlaubt sein. Desgleichen gilt f&uuml;r die IE Control (Michael Guder's
L&ouml;sung).</b>
</p>

<h2>Alle zusammen</h2>
<p>
<i>Geht ja nicht an, da&szlig; bei 104 bzw. 101 (zu sp&auml;t eingereicht) Schlu&szlig;:
ist. Die magische Hundert mu&szlig; durchbrochen werden! Und das geschah denn auch bei
der Diskussion auf der Liste:</i>
</p>

<pre>
&lt;%set x=CreateObject("Msxml2.XMLHTTP")
x.open"get","http://uhj.de.vu",0
x.send%&gt;&lt;%=x.responseText%&gt;
</pre>

<p>
Und presto - 99! (Bytes, nicht bottles). Die &Auml;nderungen gegen&uuml;ber den oben
gezeigten XMLHTTP-L&ouml;sungen sind klein, aber bringen doch noch was: FALSE l&auml;&szlig;t
sich durch 0 ersetzen (synchroner Transfer), die URL m&ouml;glichst kurz w&auml;hlen und das Leerzeichen vor 'open'
kann man auch getrost weglassen. Um die entsprechende Originalmail zu zitieren:
</p>

<pre>
Ich meine 0 statt false nat&uuml;rlich, dann haben 'wir' 99 Bytes, gell?

CU
Schmiddl

Am Mittwoch, 19.03.03, um 15:32 Uhr (Europe/Berlin) schrieb Michael
Schmidt:

&gt; &lt;%set x=CreateObject("Msxml2.XMLHTTP")
&gt; x.open"get","http://uhj.de.vu",false
&gt; x.send%&gt;&lt;%=x.responseText%&gt;
&gt;
&gt; Bei mir klappt es auch ohne Leerzeichen nach dem open!!
&gt;
&gt; CU
&gt; Schmiddl
&gt;
&gt; Am Mittwoch, 19.03.03, um 15:17 Uhr (Europe/Berlin) schrieb Buchner
&gt; Gerhard:
&gt;
&gt;&gt;&gt; da geht noch was ;)
&gt;&gt;&gt; false = 0 ;)
&gt;&gt;
&gt;&gt; Dann fehlt noch 1 Byte um die 100 zu knacken ;-)
&gt;&gt; Wer sieht noch was?
&gt;&gt;
&gt;&gt; Buchi
</pre>

<p>
Nicht schlecht - 36 Minuten nach Turnierende war die Mutter aller L&ouml;sungen
gefunden! Das zeigt was Teamgeist leisten kann.
</p>

<h2>Schlu&szlig;bemerkung</h2>
<p>
So, liebe Golffreunde, das wars wieder einmal vom Golfplatz. Schalten sie
sich wieder ein wenn sie das n&auml;chste mal 'Fore!' h&ouml;ren.
</p>

<p><strong>This printed page brought to you by <a href="http://www.alphasierrapapa.com/">AlphaSierraPapa</a></strong></p><h2>Verwandte Artikel</h2>
<p>
<a href="../artikel/20000821.htm">Streams in NTFS Dateien</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20000821.htm</span><br>
<a href="../artikel/20031222.htm">Tee Off! Wolpertinger Genome Project</a><br>
<SPAN class="content">http:/www.aspheute.com/artikel/20031222.htm</span><br>

</p>
<h2>Links zu anderen Sites</h2>
<p>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Enoodleroni%2Ecom%2Fbeerlyrics%2Etxt">99 Bottles of Beer</a><br>
<SPAN class="content">http://www.noodleroni.com/beerlyrics.txt</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Easpgerman%2Ecom%2Faspgerman%2Flisten%2Fanmelden%2Fgolf%2Easp">ASP Golf Diskussionsliste</a><br>
<SPAN class="content">http://www.aspgerman.com/aspgerman/listen/anmelden/golf.asp</span><br>
<a target="_blank" href="/REMOVED/3w_link.asp?3wsite=http%3A%2F%2Fwww%2Easpgerman%2Ecom%2Fgolf%2F">Virtueller ASP Golfplatz</a><br>
<SPAN class="content">http://www.aspgerman.com/golf/</span><br>

</p>

&nbsp;<P>
<center>

</center>

<center>
<p class="content">
&copy;2000-2006 <A HREF="../service/copyright.htm" title="Copyright Informationen">AspHeute.com</A><br>
Alle Rechte vorbehalten. Der Inhalt dieser Seiten ist urheberrechtlich gesch&uuml;tzt.<br>
Eine &Uuml;bernahme von Texten (auch nur auszugsweise) oder Graphiken bedarf unserer schriftlichen Zustimmung.
<hr>
</p>
</center>

</td>
</tr><!--Tabelle aussen, 2/2-->
</table><!--Tabelle aussen-->
</div>

</BODY>
</HTML>
